Repository: AFPy/python_doc_fr
Catalog: 3.2/glossary.po
Languages: fr

source: An expression that returns an iterator. It looks like a normal expression followed by a :keyword:`for` expression defining a loop variable, range, and an optional :keyword:`if` expression. The combined expression generates values for an enclosing function::
fr: Une expression qui donne un itérateur. Cela ressemble à une expression normale, suivie d'une expression :keyword:`for` définissant une variable de boucle, d'un range, et d'une expression, optionnelle, :keyword:`if`. Cette expression combinée génère des valeurs pour la fonction qui l'entoure ::

source: See :term:`global interpreter lock`.
fr: Voir :term:`verrou global de l'interpréteur`.

source: global interpreter lock
fr: verrou global de l’interpréteur

source: The mechanism used by the :term:`CPython` interpreter to assure that only one thread executes Python :term:`bytecode` at a time. This simplifies the CPython implementation by making the object model (including critical built-in types such as :class:`dict`) implicitly safe against concurrent access. Locking the entire interpreter makes it easier for the interpreter to be multi-threaded, at the expense of much of the parallelism afforded by multi-processor machines.
fr: Le mécanisme utilisé par l'interpréteur :term:`CPython` pour s'assurer qu'un seul thread n'execute du bytecode à la fois. Cela simplifie l'implémentation de CPython en rendant le modèle objet (incluant des parties critiques comme la classe native :class:`dict`) implicitement protégé des accès concourants. Vérouiller l'interpréteur entier le rend plus facile à rendre multi-thread, en perdant malheureusement la majorité du parallélisme possible sur les machines ayant plusieurs processeurs.

source: However, some extension modules, either standard or third-party, are designed so as to release the GIL when doing computationally-intensive tasks such as compression or hashing. Also, the GIL is always released when doing I/O.
fr: Cependant, certains modules d'extension, standards ou non, sont construits de manière à libérer le GIL lorsqu'ils effectuent des tâches lourdes tel que la compression ou le hachage. Aussi, le GIL est toujours libéré lors des lectures et écritures.

source: Past efforts to create a "free-threaded" interpreter (one which locks shared data at a much finer granularity) have not been successful because performance suffered in the common single-processor case. It is believed that overcoming this performance issue would make the implementation much more complicated and therefore costlier to maintain.
fr: Les tentatives précédentes d'implémenter un interpréteur Python avec une granularité de verrouillage plus fine ont toutes échouées, à cause de leur performances sur un seul processeur. Il est admis que corriger c'est problèmes de performance induits mènerai vers une implémentation compliquée et donc plus coûteuse à maintenir.

source: hashable
fr: hachable

source: An object is *hashable* if it has a hash value which never changes during its lifetime (it needs a :meth:`__hash__` method), and can be compared to other objects (it needs an :meth:`__eq__` method). Hashable objects which compare equal must have the same hash value.
fr: Un objet est *hachable* s'il a une empreinte (*hash*) qui ne change jamais. (etil a besoin d'une méthode :meth:`__hash__`) et peut être comparé à d'autres objets (avec la méthode :meth:`__eq__`). Les objets hachables dont ``_eq__`` dit être équivalents, ont aussi la même empreinte.

source: Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
fr: La hashabilité permet à un objet d'être utilisé comme clef de dictionnaire, ou en temps que membre d'un *set*, car ces structures de données utilisent ce *hash*.

source: All of Python's immutable built-in objects are hashable, while no mutable containers (such as lists or dictionaries) are. Objects which are instances of user-defined classes are hashable by default; they all compare unequal (except with themselves), and their hash value is their :func:`id`.
fr: Tous les types immuables fournis par Python sont hachables, et aucun type variable (comme les listes ou les dictionnaires) ne l'est. Toutes les instances de classes définies par les utilisateurs sont hachables par défaut, elles sont toutes différentes selon ``__eq__``, sauf comparées à elles mêmes, et leur empreinte (*hash*) est calculée à partir de leur :func:`id`.

source: An Integrated Development Environment for Python. IDLE is a basic editor and interpreter environment which ships with the standard distribution of Python.
fr: Un environnement de développement intégré pour Python. IDLE est un éditeur et interpréteur basique livré avec la distribution standard de Python.

source: immutable
fr: immuable

source: An object with a fixed value. Immutable objects include numbers, strings and tuples. Such an object cannot be altered. A new object has to be created if a different value has to be stored. They play an important role in places where a constant hash value is needed, for example as a key in a dictionary.
fr: Un objet dont la valeur ne change pas. Les nombres, les chaînes et les tuples sont immuables. Ils ne peuvent être modifiés. Un nouvel objet doit être créé si une valeur différente doit être stockée. Ils jouent un rôle important aux endroits où une valeur de hash constante est requise, typiquement en clef de dictionnaire.

source: importer
fr: importateur

source: An object that both finds and loads a module; both a :term:`finder` and :term:`loader` object.
fr: Un objet qui trouve et charge un module, en même temps un :term:`finder` et un :term:`loader`.

source: interactive
fr: interactif

source: Python has an interactive interpreter which means you can enter statements and expressions at the interpreter prompt, immediately execute them and see their results. Just launch ``python`` with no arguments (possibly by selecting it from your computer's main menu). It is a very powerful way to test out new ideas or inspect modules and packages (remember ``help(x)``).
fr: Python à un interpréteur interactif, ce qui signifie que vous pouvez écrire des expressions et instructions à l'invite de l'interpréteur, qui va les exécuter immédiatement, et vous en présenter le résultat. Démarrez juste ``python`` (probablement depuis un menu de votre ordinateur). C'est un moyen puissant pour tester de nouvelles idées ou étudier de nouveaux modules (souvenez vous de ``help(x)``).

source: interpreted
fr: interprété

source: Python is an interpreted language, as opposed to a compiled one, though the distinction can be blurry because of the presence of the bytecode compiler. This means that source files can be run directly without explicitly creating an executable which is then run. Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly. See also :term:`interactive`.
fr: Python est un langage interprété, en opposition aux langages compilés, bien que la frontière soit floue du à la présence d'un compilateur en bytecode. Cela signifie que les fichiers sources peuvent être exécutés directement, sans avoir à compiler un fichier exécutable intermédiaire. Les langages interprétées ont généralement un cycle de développement / débug plus rapide, et ils s'exécutent généralement plus lentement. Voir aussi :term:`interactif`.

source: iterable
fr: itérable

source: An object capable of returning its members one at a time. Examples of iterables include all sequence types (such as :class:`list`, :class:`str`, and :class:`tuple`) and some non-sequence types like :class:`dict`, :term:`file objects <file object>`, and objects of any classes you define with an :meth:`__iter__` or :meth:`__getitem__` method. Iterables can be used in a :keyword:`for` loop and in many other places where a sequence is needed (:func:`zip`, :func:`map`, ...). When an iterable object is passed as an argument to the built-in function :func:`iter`, it returns an iterator for the object. This iterator is good for one pass over the set of values. When using iterables, it is usually not necessary to call :func:`iter` or deal with iterator objects yourself. The ``for`` statement does that automatically for you, creating a temporary unnamed variable to hold the iterator for the duration of the loop. See also :term:`iterator`, :term:`sequence`, and :term:`generator`.
fr: Un objet capable de donner ses éléments un à un. Pour lister quelques exemples d'itérables, on pourrait lister tout les types séquence (comme :class:`list`, :class:`str`, et :class:`tuple`), et quelques autres comme :class:`dict`, :term:`objets fichiers <objet fichier>`, ou tout objet de toute classe ayant une méthode :meth:`__iter__` ou :meth:`__getitem__`. Les itérables peuvent être utilisés dans des boucles :keyword:`for` ou tout autre endroit où une séquence est requise (:func:`zip`, :func:`map`, ...). Lorsqu'un itérable est passé comme argument à la fonction native :func:`iter`, elle donnera un itérateur de cet itérable. Cet itérateur n'est valable que pour une passe sur le jeu de valeurs. Lors de l'utilisation d'itérables, il n'est habituellement pas nécessaire d'appeler :func:`iter` ou de s'occuper d'objet itérateurs. L'instruction ``for`` fait ça automatiquement pour vous, créant une variable temporaire anonyme pour garder l'itérateur durant la boucle. Voir aussi :term:`itérateur`, :term:`séquence`, et :term:`générateur`.

source: iterator
fr: itérateur

source: An object representing a stream of data. Repeated calls to the iterator's :meth:`~iterator.__next__` method (or passing it to the built-in function :func:`next`) return successive items in the stream. When no more data are available a :exc:`StopIteration` exception is raised instead. At this point, the iterator object is exhausted and any further calls to its :meth:`__next__` method just raise :exc:`StopIteration` again. Iterators are required to have an :meth:`__iter__` method that returns the iterator object itself so every iterator is also iterable and may be used in most places where other iterables are accepted. One notable exception is code which attempts multiple iteration passes. A container object (such as a :class:`list`) produces a fresh new iterator each time you pass it to the :func:`iter` function or use it in a :keyword:`for` loop. Attempting this with an iterator will just return the same exhausted iterator object used in the previous iteration pass, making it appear like an empty container.
fr: Un objet représentant un flux de donnée. Des appels successifs à la méthode :meth:`~iterator.__next__` de l'itérateur (ou le donner à la fonction native :func:`next`) donne successivement les objets du flux. Lorsque plus aucune donnée n'est disponible, une exception :exc:`StopIteration` est lancée. À ce point, l'itérateur est épuisé et tous les appels suivants à sa méthode :meth:`__next__` lanceront encore une exception :exc:`StopIteration`. Les itérateurs doivent avoir une méthode :meth:`__iter__` qui renvoie l'objet itérateur lui même, tel que chaque itérateur soit aussi itérable et puisse être utilisé dans la plupart des endroits où d'autres itérables sont attendus. Une exception notable serait un code qui tenterai plusieurs itérations complètes. Un objet conteneur, (tel que :class:`list`) produit un nouvel itérateur neuf à chaque fois qu'il est donné à la fonction :func:`iter` où qu'il est utilisé dans une boucle :keyword:`for`. Faire ceci sur un itérateur donnerai simplement le même objet itérateur épuisé utilisé dans son itération précédente, le faisant ressembler à un conteneur vide.

source: More information can be found in :ref:`typeiter`.
fr: Plus d'informations ici : :ref:`typeiter`.

source: key function
fr: fonction clef

source: A key function or collation function is a callable that returns a value used for sorting or ordering. For example, :func:`locale.strxfrm` is used to produce a sort key that is aware of locale specific sort conventions.
fr: Une fonction clef, est un objet appelable qui renvoie une valeur utilisée pour trier ou organiser. Par exemple la fonction :func:`local.strxfrm` sert à produire une fonction clef de tri prennant en compte les conventions de tri spécifiques aux paramètres régionaux courants.

source: A number of tools in Python accept key functions to control how elements are ordered or grouped. They include :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.nsmallest`, :func:`heapq.nlargest`, and :func:`itertools.groupby`.
fr: Plusieurs outils dans Python acceptent des fonctions clef pour maîtriser comment les éléments dont triés ou groupés. Typiquement les fonctions :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.nsmallest`, :func:`heapq.nlargest`, et :func:`itertools.groupby`.

source: There are several ways to create a key function. For example. the :meth:`str.lower` method can serve as a key function for case insensitive sorts. Alternatively, an ad-hoc key function can be built from a :keyword:`lambda` expression such as ``lambda r: (r[0], r[2])``. Also, the :mod:`operator` module provides three key function constructors: :func:`~operator.attrgetter`, :func:`~operator.itemgetter`, and :func:`~operator.methodcaller`. See the :ref:`Sorting HOW TO <sortinghowto>` for examples of how to create and use key functions.
fr: La méthode :meth:`str.lower` peut servir en fonction clef pour effectuer des recherches insensibles à la casse. Aussi, il est possible de créer des fonctions clef au besoin avec des expressions lambda, comme ``lambda r: (r[0], r[2])``. Finalement le module :mod:`operator` fournit des constructeurs de fonctions clef : :func:`~operator.attrgetter`, :func:`~operator.itemgetter`, et :func:`~operator.methodcaller`. Voir :ref:`Comment Trier <sortinghowto>` pour avoir des exemple de création et d'utilisation de fonctions clés.

source: keyword argument
fr: argument nommé

source: See :term:`argument`.
fr: Voir :term:`argument`.

source: An anonymous inline function consisting of a single :term:`expression` which is evaluated when the function is called. The syntax to create a lambda function is ``lambda [arguments]: expression``
fr: Une fonction anonyme sous forme d'une expression, et ne contenant qu'une expression, exécutée lorsqu'elle est appelée. La syntaxe pour créer des fonctions lambda est: ``lambda [arguments]: expression``

source: Look before you leap. This coding style explicitly tests for pre-conditions before making calls or lookups. This style contrasts with the :term:`EAFP` approach and is characterized by the presence of many :keyword:`if` statements.
fr: Regarde devant avant de tomber, (*Look before you leap*). Ce style de programmation consiste à vérifier des conditions avant d'effectuer des appels ou des accès. Ce style contraste avec le style :term:`EAFP` et se caractérise par la présence de beaucoup d'instructions :keyword : `if`.

source: In a multi-threaded environment, the LBYL approach can risk introducing a race condition between "the looking" and "the leaping". For example, the code, ``if key in mapping: return mapping[key]`` can fail if another thread removes *key* from *mapping* after the test, but before the lookup. This issue can be solved with locks or by using the EAFP approach.
fr: Dans un environnement multi-thread, le style *LBYL* peut engendrer une séquence critique (*race condition*) entre "regarder" et "tomber". Par exemple, le code ``if key in mapping: return mapping[key]`` peut échouer si un autre thread supprime la clef *key* du *mapping* après le test mais avant l'accès. Ce problème peut être résolu avec des verrous (*locks*) ou avec l'approche EAFP.

source: A built-in Python :term:`sequence`. Despite its name it is more akin to an array in other languages than to a linked list since access to elements are O(1).
fr: Un type natif de :term:`sequence` dans Python. En dépit de son nom, une ``list`` ressemble plus à un *array* qu'à une liste chaînée puisque les accès se font en O(1).

source: list comprehension
fr: liste en compréhension

source: A compact way to process all or part of the elements in a sequence and return a list with the results. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` generates a list of strings containing even hex numbers (0x..) in the range from 0 to 255. The :keyword:`if` clause is optional. If omitted, all elements in ``range(256)`` are processed.
fr: Un moyen compacte de manipuler tous ou partie des éléments d'une séquence renvoyant une liste avec les résultats. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` génère une liste de chaînes de caractères contenant les nombres paires sous forme hexadécimale (0x...) de 0 à 255. La clause :keyword : `if` est optionnelle. Si elle est omise, tous les éléments du ``range(256)`` seront utilisés.

source: An object that loads a module. It must define a method named :meth:`load_module`. A loader is typically returned by a :term:`finder`. See :pep:`302` for details and :class:`importlib.abc.Loader` for an :term:`abstract base class`.
fr: Un objet qui charge un module. Il doit définir une méthode nommée :meth:`load_module`. Un *loader* est typiquement donné par un :term:`finder`. Voir :pep:`302` pour les détails et :class:`importlib.ABC.Loader` pour sa :term:`classe de base abstraite`.

source: A container object that supports arbitrary key lookups and implements the methods specified in the :class:`~collections.Mapping` or :class:`~collections.MutableMapping` :ref:`abstract base classes <collections-abstract-base-classes>`. Examples include :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` and :class:`collections.Counter`.
fr: Un conteneur acceptant de rechercher des éléments par clef et implémente les méthodes des :ref:`classes de base abstraites <collections-abstract-base-classes>` :class : `collections.abc.Mapping` ou :class : `collections.abc.MutableMapping`. Les classes suivantes sont des exemples de mapping: :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict`, et :class:`collections.Counter`.

source: metaclass
fr: metaclasse

source: The class of a class. Class definitions create a class name, a class dictionary, and a list of base classes. The metaclass is responsible for taking those three arguments and creating the class. Most object oriented programming languages provide a default implementation. What makes Python special is that it is possible to create custom metaclasses. Most users never need this tool, but when the need arises, metaclasses can provide powerful, elegant solutions. They have been used for logging attribute access, adding thread-safety, tracking object creation, implementing singletons, and many other tasks.
fr: La classe d'une classe. Les définitions de classe créent un nom pour la classe, un dictionnaire et une liste de classes patentes. La métaclasse a pour rôle de réunir ces trois paramètres pour construire la classe. La plupart des langages de programmation orientés objet fournissent une implémentation par défaut. Python est spécial puisqu’il est possible de créer des métaclasses personnalisées. La plupart des utilisateurs n’ont jamais besoin de cet outil, mais quand le besoin se fait sentir les métaclasses peuvent fournir de puissantes et élégantes solutions. Elles ont été utilisées pour journaliser les accès aux attributs, supporter les threads, suivre la création des objets, implémenter des singletons, et plein d’autres tâches.

source: More information can be found in :ref:`metaclasses`.
fr: Plus d'informations à ce sujet : :ref:`metaclasses`.

source: method
fr: méthode

source: A function which is defined inside a class body. If called as an attribute of an instance of that class, the method will get the instance object as its first :term:`argument` (which is usually called ``self``). See :term:`function` and :term:`nested scope`.
fr: Une fonction définie dans une classe. Lorsqu'elle est appelée comme un attribut d'une instance, la méthode reçoit l'instance en premier :term:`argument` (qui par convention est nommé ``self``). Voir :term:`function` et :term:`nested scope`.

source: method resolution order
fr: Ordre de résolution des méthodes

source: Method Resolution Order is the order in which base classes are searched for a member during lookup. See `The Python 2.3 Method Resolution Order <http://www.python.org/download/releases/2.3/mro/>`_.
fr: L'ordre de résolution des méthodes (*MRO* de *Method Resolution Order*) est l'ordre dans lequel les membres sont recherchés dans l'arbre d'héritage. Voir `The Python 2.3 Method Resolution Order <https://www.python.org/download/releases/2.3/mro/>`_.

source: See :term:`method resolution order`.
fr: Voir :term:`ordre de résolution des méthodes `.

source: mutable
fr: variable

source: Mutable objects can change their value but keep their :func:`id`. See also :term:`immutable`.
fr: Un objet variable (*mutable*) peut changer de valeur tout en gardant le même :func:`id`. Voir aussi :term:`immuable`.

source: Any tuple-like class whose indexable elements are also accessible using named attributes (for example, :func:`time.localtime` returns a tuple-like object where the *year* is accessible either with an index such as ``t[0]`` or with a named attribute like ``t.tm_year``).
fr: Une classe, proche d'un tuple, dont les éléments, classiquement accessible par leur indice, sont aussi accessibles par leur nom (par exemple, :func:`time.localtime` donne un objet ressemblant à un tuple, dont *year* est accessible par son indice : ``t[0]`` ou par son nom : ``t.tm_year``).

source: A named tuple can be a built-in type such as :class:`time.struct_time`, or it can be created with a regular class definition. A full featured named tuple can also be created with the factory function :func:`collections.namedtuple`. The latter approach automatically provides extra features such as a self-documenting representation like ``Employee(name='jones', title='programmer')``.
fr: Un *named tuple* peut être un type natif tel que :class:`time.struct_time` ou il peut être construit comme une simple classe. Un *named tuple* complet peut aussi être créé via la fonction :func:`collections.namedtuple`. Cette dernière approche fournit automatiquement des fonctionnalités supplémentaires, tel qu'une représentation lisible comme ``Employee(name='jones', title='programmer')``.

source: namespace
fr: espace de nom

source: nested scope
fr: portée imbriquée

source: The ability to refer to a variable in an enclosing definition. For instance, a function defined inside another function can refer to variables in the outer function. Note that nested scopes by default work only for reference and not for assignment. Local variables both read and write in the innermost scope. Likewise, global variables read and write to the global namespace. The :keyword:`nonlocal` allows writing to outer scopes.
fr: La possibilité de toucher une variable déclarée dans une définition englobante. Typiquement, une fonction définie à l'intérieur d'une autre fonction aura accès aux variables de cette autre fonction. Souvenez-vous cependant que cela ne fonctionne que pour accéder à des variables, pas pour les assigner. Les variables locales sont lues et assignées dans l'espace de nom le plus proche. Tout comme les variables globales qui sont stockés sur l'espace de noms global, le mot clef :keyword:`nonlocal` permet d'écrire dans l'espace de nom dans lequel est déclaré la variable.

source: new-style class
fr: nouvelle classe

source: object
fr: objet
