Repository: AFPy/python_doc_fr
Catalog: 3.2/glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: The default Python prompt of the interactive shell. Often seen for code examples which can be executed interactively in the interpreter.
fr: L'invite de commande utilisée par défaut dans l'interpréteur interactif. On la voit souvent dans des exemples de code qui peuvent être exécutés interactivement dans l'interpréteur.

source: The default Python prompt of the interactive shell when entering code for an indented code block or within a pair of matching left and right delimiters (parentheses, square brackets or curly braces).
fr: L'invite de commande utilisée par défaut dans l'interpréteur interactif lorsqu'on entre un bloc de code indenté ou entre deux délimiteurs (parenthèses, crochets ou accolades).

source: 2to3
fr: 3to3

source: A tool that tries to convert Python 2.x code to Python 3.x code by handling most of the incompatibilities which can be detected by parsing the source and traversing the parse tree.
fr: Un outil qui essaie de convertir du code pour Python 2.x en code pour Python 3.x en gérant la plupart des incompatibilités qui peuvent être détectées en analysant la source et parcourant son arbre syntaxique.

source: 2to3 is available in the standard library as :mod:`lib2to3`; a standalone entry point is provided as :file:`Tools/scripts/2to3`. See :ref:`2to3-reference`.
fr: 2to3 est disponible dans la bibliothèque standard sous le nom de :mod:`lib2to3`\ ; un point d’entrée indépendant est fourni via :file:`Tools/scripts/2to3`. Cf. \ :ref:`2to3-reference`.

source: abstract base class
fr: classe de base abstraite

source: Abstract base classes complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy or subtly wrong (for example with :ref:`magic methods <special-lookup>`). ABCs introduce virtual subclasses, which are classes that don't inherit from a class but are still recognized by :func:`isinstance` and :func:`issubclass`; see the :mod:`abc` module documentation. Python comes with many built-in ABCs for data structures (in the :mod:`collections` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` module.
fr: Les classes de base abstraites (*ABC*, suivant l'abréviation anglaise) complètent le :term:`duck-typing` en fournissant un moyen de définir des interfaces pour les cas où d'autres techniques comme :func:`hasattr` seraient inélégantes, ou subtilement fausses (par exemple avec les :ref:`méthodes magiques <special-lookup>`). Les ABC introduisent des sous-classes virtuelles, qui n'héritent pas d'une classe mais qui sont quand même reconnues par :func:`isinstance` ou :func:`issubclass` (Voir la documentation du module :mod:`abc`). Python contient de nombreuses ABC pour les structures de données (dans le module :mod:`collections`), les nombres (dans le module :mod:`numbers`), les flux (dans le module :mod:`io`), et les chercheurs / chargeurs d'import (dans le module :mod:`importlib.abc`). Vous pouvez créer vos propres ABC avec le module :mod:`abc`.

source: A value passed to a :term:`function` (or :term:`method`) when calling the function. There are two types of arguments:
fr: Une valeur, donnée à une :term:`fonction` ou à une :term:`méthode` lors de son appel. Il existe deux types d'arguments :

source: :dfn:`keyword argument`: an argument preceded by an identifier (e.g. ``name=``) in a function call or passed as a value in a dictionary preceded by ``**``. For example, ``3`` and ``5`` are both keyword arguments in the following calls to :func:`complex`::
fr: :dfn:`argument nommé`: un argument précédé d'un identifiant (comme ``name=``) ou un dictionnaire précédé de ``**``, lors d'un appel de fonction. Par exemple, ``3`` et ``5`` sont tous les deux des arguments nommés dans l'appel à :func:`complex` ici ::

source: :dfn:`positional argument`: an argument that is not a keyword argument. Positional arguments can appear at the beginning of an argument list and/or be passed as elements of an :term:`iterable` preceded by ``*``. For example, ``3`` and ``5`` are both positional arguments in the following calls::
fr: :dfn:`argument positionnel` : Un argument qui n'est pas nommé. Les arguments positionnels apparaissent au début de la liste des arguments, ou donnés sous forme d'un :term:`itérable` précédé par ``*``. Par exemple, ``3`` et ``5`` sont tous les deux des arguments positionnels dans les appels suivants ::

source: Arguments are assigned to the named local variables in a function body. See the :ref:`calls` section for the rules governing this assignment. Syntactically, any expression can be used to represent an argument; the evaluated value is assigned to the local variable.
fr: Les arguments se retrouvent dans le corps de la fonction appelée parmi les variables locales. Voir la section :ref:`calls` à propos des règles dictant cet affectation. Syntaxiquement, toute expression est acceptée comme argument, et c'est la valeur résultante de l'expression qui sera affectée à la variable locale.

source: See also the :term:`parameter` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, and :pep:`362`.
fr: Voir aussi :term:`paramètre` dans le glossaire, la FAQ à aussi une question à propos de `la différence entre argument et paramètre <faq-argument-vs-parameter>` et la :pep:`362`.

source: attribute
fr: attribut

source: A value associated with an object which is referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
fr: Une valeur associée à un objet et référencé par un nom via une notation utilisant des points. Par exemple, si un objet *o* a un attribut *a*, il sera référencé par *o.a*.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <http://www.python.org/~guido/>`_, Python's creator.
fr: Dictateur bénévole à vie, alias `Guido van Rossum <https://www.python.org/~guido/>`_, le créateur de Python.

source: Python source code is compiled into bytecode, the internal representation of a Python program in the CPython interpreter. The bytecode is also cached in ``.pyc`` and ``.pyo`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode. Do note that bytecodes are not expected to work between different Python virtual machines, nor to be stable between Python releases.
fr: Le code source, en Python, est compilé en un bytecode, la représentation interne à CPython d'un programme Python. Le bytecode est aussi stocké dans un fichier nommé ``.pyc`` ou ``.pyo``. Ces caches permettent de charger les fichiers plus rapidement lors de la 2ème exécution (en évitant ainsi de recommencer la compilation en bytecode). On dit que ce *langage intermédiaire* est exécuté sur une :term:`machine virtuelle` qui exécute des instructions machine pour chaque instruction du bytecode. Notez que le bytecode n'a pas vocation à fonctionner entre différentes sur différentes machines virtuelle Python, encore moins entre différentes version de Python.

source: A list of bytecode instructions can be found in the documentation for :ref:`the dis module <bytecodes>`.
fr: Une liste des instructions du bytecode se trouve dans la documentation du :ref:`module dis <bytecodes>`.

source: class
fr: classe

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
fr: Un modèle pour créer des objets définis par l'utilisateur. Les définitions de classes contiennent normalement des définitions de méthodes qui agissent sur les instances de classe.

source: coercion
fr: coercition

source: The implicit conversion of an instance of one type to another during an operation which involves two arguments of the same type. For example, ``int(3.15)`` converts the floating point number to the integer ``3``, but in ``3+4.5``, each argument is of a different type (one int, one float), and both must be converted to the same type before they can be added or it will raise a ``TypeError``. Without coercion, all arguments of even compatible types would have to be normalized to the same value by the programmer, e.g., ``float(3)+4.5`` rather than just ``3+4.5``.
fr: La conversion implicite d'une instance d'un type vers un autre lors d'une opération impliquant deux opérandes de même type. Par exemple ``int(3.15)`` convertis explicitement le nombre a virgule flottante en nombre entier (ici, ``3``), mais dans l'opération ``3 + 4.5``, les deux opérandes ont un type différent, alors qu'elles doivent avoir le même type pour être additionnées, sans quoi une exception ``TypeError`` serait levée. Sans coercition, toutes les opérandes, même de types compatibles, devraient être convertis (on parle aussi de "cast") explicitement par le développeur, par exemple : ``float(3) + 4.5`` au lieu du simple ``3 + 4.5``.

source: complex number
fr: nombre complexe

source: An extension of the familiar real number system in which all numbers are expressed as a sum of a real part and an imaginary part. Imaginary numbers are real multiples of the imaginary unit (the square root of ``-1``), often written ``i`` in mathematics or ``j`` in engineering. Python has built-in support for complex numbers, which are written with this latter notation; the imaginary part is written with a ``j`` suffix, e.g., ``3+1j``. To get access to complex equivalents of the :mod:`math` module, use :mod:`cmath`. Use of complex numbers is a fairly advanced mathematical feature. If you're not aware of a need for them, it's almost certain you can safely ignore them.
fr: Une extension du système numéral réel familier dans laquelle tous les nombres sont exprimés sous la forme d'une somme d'un réel et d'un imaginaire. Les nombres imaginaures sont de réels multiples d'une unité imaginaire (la racine carrée de ``-1``), souvent écrite ``i`` en mathématiques ou ``j`` en ingénierie. Python supporte nativement les nombres complexes, écrits avec cette dernière notation; la partie imaginaire est écrite avec un suffixe ``j``, exemple, ``3+1j``. Pour utiliser les équivalents complexes à :mod:`math`, utilisez :mod:`cmath`. L'utilisation des nombres complexes est une caractéristiques des mathématiques avancées. Si vous n'en avez pas l'utilité, vous pouvez les ignorer en toute tranquilité.

source: context manager
fr: gestionnaire de contexte

source: An object which controls the environment seen in a :keyword:`with` statement by defining :meth:`__enter__` and :meth:`__exit__` methods. See :pep:`343`.
fr: Un objet contrôlant l'environnement a l'intérieur d'une instruction :keyword:`with` en définissant les méthodes :meth:`__enter__` et :meth:`__exit__`. Consultez la :pep:`343`.

source: The canonical implementation of the Python programming language, as distributed on `python.org <http://python.org>`_. The term "CPython" is used when necessary to distinguish this implementation from others such as Jython or IronPython.
fr: L'implémentation canonique du langage de programmation Python, tel que distribué sur `python.org <https://www.python.org>`_. Le terme « CPython » est utilisé dans certains contextes lorsqu'il est nécessaire de distinguer cette implémentation des autres comme Jython ou IronPython.

source: decorator
fr: décorateur

source: A function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax. Common examples for decorators are :func:`classmethod` and :func:`staticmethod`.
fr: Une fonction retournant une autre fonction, utilisé habituellement dans une transformation de fonction via la syntaxe ``@wrapper``.Les exemples habituels pour les décorateurs sont :func:`classmethod` et :func:`staticmethod`.

source: The decorator syntax is merely syntactic sugar, the following two function definitions are semantically equivalent::
fr: La syntaxe decorator est simplement du sucre syntaxique, les définitions des deux fonctions suivantes sont sémantiquement équivalentes :

source: The same concept exists for classes, but is less commonly used there. See the documentation for :ref:`function definitions <function>` and :ref:`class definitions <class>` for more about decorators.
fr: Quoique moins fréquemment utilisé, le même concept existe pour les classes. Consultez la documentation :ref:`définitions de fonctions <fonction>` et :ref:`définitions de classes <classe>` pour en savoir plus sur les decorators.

source: descriptor
fr: descripteur

source: Any object which defines the methods :meth:`__get__`, :meth:`__set__`, or :meth:`__delete__`. When a class attribute is a descriptor, its special binding behavior is triggered upon attribute lookup. Normally, using *a.b* to get, set or delete an attribute looks up the object named *b* in the class dictionary for *a*, but if *b* is a descriptor, the respective descriptor method gets called. Understanding descriptors is a key to a deep understanding of Python because they are the basis for many features including functions, methods, properties, class methods, static methods, and reference to super classes.
fr: N'importe quel objet définissant les méthodes :meth:`__get__`, :meth:`__set__`, ou :meth:`__delete__`. Lorsque l'attribut d'une classe est un descripteur, son comportement spécial est déclenché lors de la recherche des attributs. En utilisant *a.b* pour obtenir, valoriser ou effacer un attribut, il recherche l'objet nommé *b* dans la dictionnaire de la classe pour *a*, mais si *b* est un descripteur, la méthode de ce descripteur est alors appelée. Comprendre les descripteurs est la clé d'une compréhension approfondie de Python, ils sont la base de nombre de ses caractéristiques notamment les fonctions, méthodes, propriétés, méthodes de classe, méthodes statiques, et les références aux classes mères.

source: For more information about descriptors' methods, see :ref:`descriptors`.
fr: Pour plus d'informations sur les méthodes des descripteurs, consultez :ref:`descriptors`.

source: dictionary
fr: dictionnaire

source: An associative array, where arbitrary keys are mapped to values. The keys can be any object with :meth:`__hash__` and :meth:`__eq__` methods. Called a hash in Perl.
fr: Une structure de donnée associant des clefs et des valeurs. Les clefs peuvent être n'importe quel objet comportant les méthodes :meth:`__hash__` et :meth:`__eq__``. Elle s'appelle "hash" en Perl.

source: A string literal which appears as the first expression in a class, function or module. While ignored when the suite is executed, it is recognized by the compiler and put into the :attr:`__doc__` attribute of the enclosing class, function or module. Since it is available via introspection, it is the canonical place for documentation of the object.
fr: Une chaîne littérale étant la première expression d'une classe, fonction, ou module. Bien qu'ignoré à l'exécution, elles sont reconnues par le compilateur, et placées dans l'attribut :attr:`__doc__` de sa classe, fonction, ou module respectif. Puisque cette chaîne est disponible par introspection, c'est l'endroit idéal pour documenter l'objet.

source: A programming style which does not look at an object's type to determine if it has the right interface; instead, the method or attribute is simply called or used ("If it looks like a duck and quacks like a duck, it must be a duck.") By emphasizing interfaces rather than specific types, well-designed code improves its flexibility by allowing polymorphic substitution. Duck-typing avoids tests using :func:`type` or :func:`isinstance`. (Note, however, that duck-typing can be complemented with :term:`abstract base classes <abstract base class>`.) Instead, it typically employs :func:`hasattr` tests or :term:`EAFP` programming.
fr: Un style de programmation qui ne prend pas en compte le type d'un objet pour déterminer s'il respecte une interface, mais qui qui appelle simplement la méthode ou l'attribut (*Si ça à un bec et que ça cancane, c'est un canard*). En se concentrant sur les interfaces plutôt que les types, du code bien construit améliore sa flexibilité en autorisant des substitutions polymorphiques. Le duck-typing évitent de vérifier les types via :func:`type` ou :func:`isinstance`, (notez cependant que le duck-typing peut travailler de pair avec les :term:`classes de base abstraites <classe de base abstraite>`.) À la place, le duck-typique utilise plutôt :func:`hasattr` ou la programmation :term:`EAFP`.

source: Easier to ask for forgiveness than permission. This common Python coding style assumes the existence of valid keys or attributes and catches exceptions if the assumption proves false. This clean and fast style is characterized by the presence of many :keyword:`try` and :keyword:`except` statements. The technique contrasts with the :term:`LBYL` style common to many other languages such as C.
fr: Il est plus simple de demander pardon que demander permission. Ce style de développement Python fait l'hypothèse que le code est valide, et attrape les exceptions si cette hypothèse s'avère fausse. Ce style, propre et efficace, est caractérisé par la présence de beaucoup de mot clé :keyword:`try` et :keyword:`except`. Cette technique de programmation contraste avec le style :term:`LBYL` présent courament dans des langages tel que C.

source: A piece of syntax which can be evaluated to some value. In other words, an expression is an accumulation of expression elements like literals, names, attribute access, operators or function calls which all return a value. In contrast to many other languages, not all language constructs are expressions. There are also :term:`statement`\s which cannot be used as expressions, such as :keyword:`if`. Assignments are also statements, not expressions.
fr: Une suite logique de termes et chiffres conformes à la syntaxe Python dont l'évaluation fournit une valeur. En d'autres termes, une expression est une suite d'éléments tels que des noms, opérateurs, littéraux, accès d'attributs, méthodes ou fonctions qui aboutissent à une valeur. Contrairement à beaucoup d'autres langages, les différentes constructions du langage ne sont pas toutes des expressions. Il y a également des :term:`instructions`\s qui ne peuvent pas être utilisés comme expressions, tel que :keyword:`if`. Les affectations sont également des :term:`instructions` et non des expressions.

source: extension module
fr: module d'extension

source: A module written in C or C++, using Python's C API to interact with the core and with user code.
fr: Un module écrit en C ou C++, utilisant l'API C de Python pour interagir avec Python et le code de l'utilisateur.

source: file object
fr: objet fichier

source: An object exposing a file-oriented API (with methods such as :meth:`read()` or :meth:`write()`) to an underlying resource. Depending on the way it was created, a file object can mediate access to a real on-disk file or to another type of storage or communication device (for example standard input/output, in-memory buffers, sockets, pipes, etc.). File objects are also called :dfn:`file-like objects` or :dfn:`streams`.
fr: Un objet exposant une ressource via une API orientée fichier (avec les méthodes :meth:`read()` ou :meth:`write()`). En fonction de la manière dont ils ont été créés, les objets fichiers peuvent exposer un fichier sur le disque, ou un autre type de stockage ou de communication (typiquement l'entrée standard, la sortie standard, un tampon en mémoire, des sockets, ...). Les objets fichiers sont aussi appelés :dfn:`file-like-objects` ou :dfn:`streams`.

source: file-like object
fr: objet fichier-compatible

source: A synonym for :term:`file object`.
fr: Un synonyme de :term:`objet fichier `.

source: floor division
fr: division entière

source: Mathematical division that rounds down to nearest integer. The floor division operator is ``//``. For example, the expression ``11 // 4`` evaluates to ``2`` in contrast to the ``2.75`` returned by float true division. Note that ``(-11) // 4`` is ``-3`` because that is ``-2.75`` rounded *downward*. See :pep:`238`.
fr: Division mathématique arrondissant à l'entier le plus petit. L'opérateur de la division entière est ``//``. Par exemple l'expression ``11 // 4`` vaut ``2``, contrairement à ``11 / 4`` qui vaut ``2.75``. Notez que ``(-11) // 4`` vaut ``-3`` car l'arrondi se fait par le bas. Voir la :pep:`328`.

source: function
fr: fonction

source: A series of statements which returns some value to a caller. It can also be passed zero or more :term:`arguments <argument>` which may be used in the execution of the body. See also :term:`parameter`, :term:`method`, and the :ref:`function` section.
fr: Une suite d'instructions qui renvoient une valeur à celui qui l'appelle. On peut aussi lui passer des :term:`arguments <argument>` qui pourront être utilisés dans le corps de la fonction. Voir aussi :term:`paramètre`, :term:`méthode`, et :ref:`function`.

source: A pseudo-module which programmers can use to enable new language features which are not compatible with the current interpreter.
fr: Un pseudo-module que les développeurs peuvent utiliser pour activer de nouvelles fonctionnalités du langage qui ne sont pas compatibles avec l'interpréteur utilisé.

source: By importing the :mod:`__future__` module and evaluating its variables, you can see when a new feature was first added to the language and when it becomes the default::
fr: En important le module :mod:`__future__` et en affichant ses variables, vous pouvez voir quand une nouvelle fonctionnalité à été rajoutée dans le langage, et quand elle devient le comportement par défaut ::

source: garbage collection
fr: ramasse-miette

source: The process of freeing memory when it is not used anymore. Python performs garbage collection via reference counting and a cyclic garbage collector that is able to detect and break reference cycles.
fr: Le processus de libérer de la mémoire lorsqu'elle n'est plus utilisée. Python utilise un ramasse-miettes par comptage de référence, et un ramasse miette cyclique capable de détecter et casser les références circulaires.

source: generator
fr: générateur

source: A function which returns an iterator. It looks like a normal function except that it contains :keyword:`yield` statements for producing a series a values usable in a for-loop or that can be retrieved one at a time with the :func:`next` function. Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the generator resumes, it picks-up where it left-off (in contrast to functions which start fresh on every invocation).
fr: Une fonction qui renvoie un itérateur. Ça ressemble à une fonction normale, en dehors du fait qu'il contient une ou plusieurs instruction :keyword:`yield`, produisant une série de valeurs utilisables dans une boucle for, ou pouvant être récupérées une à une avec la fonction :func:`next`. Chaque instruction :keyword:`yield` suspend temporairement l'exécution de la fonction, en se rappelant de la position et de l'état (les variables locales, et les *try* en cours). Lorsque le générateur reprend, il reprend là où il en était (contrairement à une fonction classique qui reprendrait du départ à chaque appel).

source: generator expression
fr: expression génératrice
