Repository: AFPy/python_doc_fr
Catalog: 3.2/glossary.po
Languages: fr

source: Any data with state (attributes or value) and defined behavior (methods). Also the ultimate base class of any :term:`new-style class`.
fr: N'importe quelle donnée comportant des états sous forme d'attributs ou de valeurs, et un comportement (des :term:`méthodes <méthode>`). C'est aussi (``object``) l'ancêtre commun à absolument toutes les :term:`nouvelles classes <nouvelle classe>`.

source: parameter
fr: paramètre

source: A named entity in a :term:`function` (or method) definition that specifies an :term:`argument` (or in some cases, arguments) that the function can accept. There are five types of parameters:
fr: Une entité nommée, dans la définition d'une :term:`fonction` ou d'une :term:`méthode`, décrivant un :term:`argument` (ou dans certains cas des arguments) que la fonction accepte. Il existe cinque sorte de paramètres :

source: :dfn:`positional-or-keyword`: specifies an argument that can be passed either :term:`positionally <argument>` or as a :term:`keyword argument <argument>`. This is the default kind of parameter, for example *foo* and *bar* in the following::
fr: :dfn:`positional-or-keyword`: dit d'un argument qui peut être passé soit par sa :term:`position <argument>` soit en temps que :term:`paramètre nommé <argument>`. C'est le type de paramètre par défaut, par exemple, *foo* et *bar* dans l'exemple suivant ::

source: :dfn:`positional-only`: specifies an argument that can be supplied only by position. Python has no syntax for defining positional-only parameters. However, some built-in functions have positional-only parameters (e.g. :func:`abs`).
fr: :dfn:`positional-only`: un argument qui ne peut être donné que par sa position. Python n'a pas de syntaxe pour déclarer de tels paramètre, cependant des fonctions natives, comme :func:`abs` en utilisent.

source: :dfn:`keyword-only`: specifies an argument that can be supplied only by keyword. Keyword-only parameters can be defined by including a single var-positional parameter or bare ``*`` in the parameter list of the function definition before them, for example *kw_only1* and *kw_only2* in the following::
fr: :dfn:`keyword-only`: définit un argument qui ne peut être fournit que par nom. Les paramètres *keyword-only* peuvent être définis en utilisant un

source: :dfn:`var-positional`: specifies that an arbitrary sequence of positional arguments can be provided (in addition to any positional arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``*``, for example *args* in the following::
fr: :dfn:`var-positional`: spécifie qu'une séquence d'arguments positionels peut être fourni (en plus de tous les arguments positionels déjà acceptés par d'autres paramètres). Un tel paramètre peut être définit en préfixant son nom par une ``*``, par exemple *args* ici ::

source: :dfn:`var-keyword`: specifies that arbitrarily many keyword arguments can be provided (in addition to any keyword arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``**``, for example *kwargs* in the example above.
fr: :dfn:`var-keyword`: spécifie qu'une quantité arbitraire d'arguments peuvent être passés par nom (en plus de tous les arguments nommés déjà acceptés par d'autres paramètres). Un tel paramètre est définit en préfixant le nom du paramètre par ``**``, par exemple, *kwargs* ci-dessus.

source: Parameters can specify both optional and required arguments, as well as default values for some optional arguments.
fr: Les paramètres peuvent décrire aussi bien des paramètres optionnels ou obligatoires, aussi que des valeurs par défaut pour les paramètres optionnels.

source: See also the :term:`argument` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, the :class:`inspect.Parameter` class, the :ref:`function` section, and :pep:`362`.
fr: Voir aussi :term:`argument` dans le glossaire, la question sur :ref:`la différence entre les arguments et les paramètre <faq-argument-vs-parameter>` dans la FAQ, la classe :class:`inspect.Parameter`, la section :ref:`fonction`, et la :pep:`362`.

source: positional argument
fr: augment positionnel

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
fr: Surnom de la série des Python 3.x (très vieux surnom donné à l'époque pour Python 3 n'était qu'un futur lointain). Aussi abrégé "Py3k".

source: Pythonic
fr: Pythonique

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
fr: Une idée, ou un bout de code, qui suit de près la philosophie de Python, parfois en opposition avec les concepts rencontrés dans d'autres langages. Typiquement, la coutume en Python est de parcourir les éléments d'un itérable en utilisant :keyword:`for`. Beaucoup de langages n'ont pas cette possibilité, donc les gens qui ne sont pas habitués à Python pourraient parfois utiliser un compteur à la place ::

source: As opposed to the cleaner, Pythonic method::
fr: Plutôt qu'utiliser la méthode, plus propre et élégante, donc Pythonique ::

source: reference count
fr: nombre de références

source: The number of references to an object. When the reference count of an object drops to zero, it is deallocated. Reference counting is generally not visible to Python code, but it is a key element of the :term:`CPython` implementation. The :mod:`sys` module defines a :func:`~sys.getrefcount` function that programmers can call to return the reference count for a particular object.
fr: Le nombre de références à un objet. Lorsque le nombre de références à un objet descend à zéro, l'objet est désalloué. Le comptage de référence n'est généralement pas visible dans le code Python, mais c'est un élément clef de l'implémentation :term:`CPython`. Le module :mod:`sys` défini une fonction :func:`~sys.getrefcount` que les développeurs peuvent utiliser pour obtenir le nombre de référence d'un objet donné.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
fr: Une déclaration dans une classe qui économise de la mémoire en pré-allouant de l'espace pour les instances des attributs, et le dictionnaire des instances. Bien que populaire, cette technique est difficile à maîtriser et devrait être réservée à de rares cas avec un grand nombre d'instances dans une application où la mémoire est un sujet critique.

source: sequence
fr: séquence

source: An :term:`iterable` which supports efficient element access using integer indices via the :meth:`__getitem__` special method and defines a :meth:`__len__` method that returns the length of the sequence. Some built-in sequence types are :class:`list`, :class:`str`, :class:`tuple`, and :class:`bytes`. Note that :class:`dict` also supports :meth:`__getitem__` and :meth:`__len__`, but is considered a mapping rather than a sequence because the lookups use arbitrary :term:`immutable` keys rather than integers.
fr: Un :term:`itérable` qui gère l'accès efficient à ses éléments par un indice sous forme de nombre entier via la méthode spéciale :meth:`__getitem__` et qui défini une méthode :meth:`__len__` qui donne sa taille. Voici quelques séquences natives : :class:`list`, :class:`str`, :class:`tuple`, et :class:`bytes`. Notez que :class:`dict` a aussi une méthode :meth:`__getitem__` et une méthode :meth:`__len__`, mais il est considéré comme un *mapping* plutôt qu'une séquence, car ses accès se font par une clef arbitraire :term:`immuable` plutôt qu'un nombre entier.

source: slice
fr: tranche

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
fr: *slice*, un objet contenant habituellement une portion de :term:`séquence`. Une tranche est crée en utilisant la notation ``[]`` avec des ``:`` entre les nombres lorsque plusieurs sont fournis, tel que dans ``variable_name[1:3:5]``. Cette notation utilise des objets :class:`slice` en interne.

source: special method
fr: méthode spéciale

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
fr: *special method*: Une méthode appelée implicitement par Python pour exécuter une opération sur un type, tel qu'une addition. De telles méthodes ont des noms commençant et terminant par des doubles tirets bas. Les méthodes spéciales sont documentées dans :ref:`specialnames`.

source: statement
fr: instruction

source: triple-quoted string
fr: chaîne entre triple guillemets

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
fr: Une chaîne qui est assembée par trois guillemets simples (``'``) ou trois guillemets doubles (``"``). Bien qu'elles ne fournissent aucune fonctionalité qui ne serait pas disponnible avec les chaînes entre guillemets, elles sont utiles pour moultes raisons. Elles vous autorisent à insérer des guillemets simples et doubles dans une chaîne sans avoir à les protéger, et elles peuvent s'étendre sur plusieurs lignes sans avoir à les terminer par un ``\``, les rendant ainsi particulièrement utile pour les chaînes de documentation (*docstrings*).

source: universal newlines
fr: retours à la ligne universels

source: virtual machine
fr: machine virtuelle

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
fr: Un ordinateur défini entièrement par du logiciel. La machine virtuelle (*virtual machine*) de Python exécute le :term:`bytecode` donné par le compilateur de *bytecode*.

source: Zen of Python
fr: Le Zen de Python

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
fr: Liste de principes et de philosophies utiles pour comprendre et utiliser le langage. Cette liste peut être obtenue en tapant "``import this``" dans une invite Python interactive.
