Repository: AFPy/python_doc_fr
Catalog: 2.7/sphinx.po
Languages: fr

source: The Python Software Foundation is a non-profit corporation.
fr: La Python Software Foundation est une organisation à but non lucratif.

source: Please donate.
fr: Les dons sont les bienvenus.

source: Last updated on %(last_update)s.
fr: Dernière mise à jour le %(last_update)s.

source: <a href="%(pathto_bugs)s">Found a bug</a>?
fr: <a href="%(pathto_bugs)s">Vous avez trouvé un bug</a> ?

source: Created using <a href="http://sphinx.pocoo.org/">Sphinx</a> %(sphinx_version)s.
fr: Crée via <a href="http://sphinx.pocoo.org/">Sphinx</a> %(sphinx_version)s.

source: This Page
fr: Cette Page

source: Report a Bug
fr: Rapporter un bug

source: Show Source
fr: Voir la source

source: Parts of the documentation:
fr: La documentation:

source: What's new in Python %(version)s?
fr: Quoi de neuf avec Python %(version)s ? [en]

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
fr: ou <a href="%(whatsnew_index)s">tous les "Quoi de neuf"</a> depuis la 2.0

source: Tutorial
fr: Tutoriel

source: start here
fr: démarrez ici

source: Library Reference
fr: Référence de la Bibliothèque [en]

source: keep this under your pillow
fr: gardez-ça sous votre oreiller

source: Language Reference
fr: Référence du Langage [en]

source: describes syntax and language elements
fr: décrit la syntaxe et les éléments du langage

source: Python Setup and Usage
fr: Installation et Utilisation de Python [en]

source: how to use Python on different platforms
fr: comment utiliser Python sur différentes plateformes

source: Python HOWTOs
fr: Les HOWTOs de Python [en]

source: in-depth documents on specific topics
fr: documents explorant certains sujets en profondeur

source: Extending and Embedding
fr: Améliorer et Intégrer [en]

source: tutorial for C/C++ programmers
fr: tutoriel pour les développeurs C/C++

source: Python/C API
fr: Python/C API [en]

source: reference for C/C++ programmers
fr: référence pour les développeurs C/C++

source: Installing Python Modules
fr: L'installation de modules Python

source: information for installers &amp; sys-admins
fr: Informations pour les installateurs &amp; administrateurs système

source: Distributing Python Modules
fr: Distribuer des Modules Python

source: sharing modules with others
fr: partager des modules

source: FAQs
fr: FAQs [en]

source: frequently asked questions (with answers!)
fr: foire aux questions (avec les réponses !)

source: Indices and tables:
fr: Indexes et tables des matières:

source: Global Module Index
fr: Index global des modules

source: quick access to all modules
fr: accès rapide à tous les modules

source: General Index
fr: Index Général

source: all functions, classes, terms
fr: toutes les fonctions, classes, et termes

source: Glossary
fr: Glossaire

source: the most important terms explained
fr: les mots les plus importants expliqués

source: Search page
fr: Page de recherche

source: search this documentation
fr: chercher dans cette documentation

source: Complete Table of Contents
fr: Table des matières complète

source: lists all sections and subsections
fr: liste toute les sections et sous-sections

source: Meta information:
fr: Méta informations :

source: Reporting bugs
fr: Rapporter des bugs

source: About the documentation
fr: À propos de la documentation

source: History and License of Python
fr: Histoire et Licence de Python

source: Download
fr: Téléchargement

source: Download these documents
fr: Télécharger ces documentations

source: Docs for other versions
fr: Docs des autres versions

source: Python 3.5 (in development)
fr: Python 3.5 (en développement)

source: Old versions
fr: Anciennes versions

source: Other resources
fr: Autres ressources

source: PEP Index
fr: Index des PEP

source: Beginner's Guide
fr: Guide du débutant

source: Book List
fr: Liste de Livres

source: Audio/Visual Talks
fr: Discours audiovisuels

source: Download Python %(release)s Documentation
fr: Télécharger la documentation de Python %(release)s

source: Last updated on: %(last_updated)s.
fr: Dernière mise à jour le : %(last_updated)s.

source: To download an archive containing all the documents for this version of Python in one of various formats, follow one of links in this table. The numbers in the table are the size of the download files in megabytes.
fr: Pour télécharger une archive contenant toute la documentation de cette version de Python un ou différents formats, suivez l'un des liens de ce tableau. Les nombres dans ce tableau représentent la taille des fichiers en mégaoctet.

source: Packed as .zip
fr: Archive .zip

source: Packed as .tar.bz2
fr: Archive .tar.bz2

source: PDF (US-Letter paper size)
fr: PDF (format US-Letter)

source: (ca. 8 MB)
fr: (approx. 8 Mo)

source: PDF (A4 paper size)
fr: PDF (Format A4)

source: (ca. 6 MB)
fr: (approx. 6 Mo)

source: (ca. 4 MB)
fr: (approx. 4 Mo)

source: Plain Text
fr: Texte brut

source: (ca. 2 MB)
fr: (approx. 2 Mo)

source: (ca. 1.5 MB)
fr: (approx. 1,5 Mo)

source: These archives contain all the content in the documentation.
fr: Ces archives contiennent tout le contenu de la documentation.

source: HTML Help (<tt>.chm</tt>) files are made available in the "Windows" section on the <a href=%(download_page)s>Python download page</a>.
fr: Les fichiers d'aide HTML (<tt>.chm</tt>) sont disponibles dans la section "Windows" sur la <a href=%(download_page)s>Page de téléchargement de Python</a>.

source: Unpacking
fr: Décompresser

source: Unix users should download the .tar.bz2 archives; these are bzipped tar archives and can be handled in the usual way using tar and the bzip2 program. The <a href="http://www.info-zip.org">InfoZIP</a> unzip program can be used to handle the ZIP archives if desired. The .tar.bz2 archives provide the best compression and fastest download times.
fr: Les utilisateurs Unix peuvent télécharger les archives .tar.bz2, ce sont des archives tar compressées avec bzip2, et sont gérées classiquement avec les programmes tar et bzip2. Le programme <a href="http://www.info-zip.org">InfoZIP</a> peut gérer les archives ZIP si nécessaire. Les archives .tar.bz2 sont les mieux compressées et donc les plus rapides à télécharger.

source: Windows users can use the ZIP archives since those are customary on that platform. These are created on Unix using the InfoZIP zip program.
fr: Les utilisateurs de Windows peuvent utiliser les archivez ZIP, le format le plus classique sur cette plateforme. Ils ont été crées en utilisant le programme Unix InfoZIP.

source: Problems
fr: Probèmes

source: If you have comments or suggestions for the Python documentation, please send email to <a href="mailto:docs@python.org">docs@python.org</a>.
fr: If vous avez des commentaires ou suggestions pour la documentation de Python, vous pouvez envoyer un mail à <a href="mailto:docs@python.org">docs@python.org</a>, ou si ils concerne la traduction en français, à <a href="mailto:traductions@lists.afpy.org">traductions@lists.afpy.org</a>.
