Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: In addition to alternative list implementations, the library also offers other tools such as the :mod:`bisect` module with functions for manipulating sorted lists::
fr: Au delà de fournir des implémentations de listes alternatives, la bibliothèque fournit des outils tels que :mod:`bisect`, un module contenant des fonctions de manipulation de listes triées ::

source: The :mod:`heapq` module provides functions for implementing heaps based on regular lists. The lowest valued entry is always kept at position zero. This is useful for applications which repeatedly access the smallest element but do not want to run a full list sort::
fr: Le module :mod:`heapq`, permettant d'implémenter des tas (heaps) à partir de simple listes. La valeur la plus faible est toujours à la première position (indice 0). C'est utile dans les cas où l'application souvent besoin de trouver l'élément le plus petit sans trier entièrement la liste ::

source: Decimal Floating Point Arithmetic
fr: Arithmétique décimale à Virgule Flottante

source: The :mod:`decimal` module offers a :class:`~decimal.Decimal` datatype for decimal floating point arithmetic. Compared to the built-in :class:`float` implementation of binary floating point, the class is especially helpful for
fr: Le module :mod:`decimal` expose la classe :class:`~decimal.Decimal`, spécialisée dans le calcul de nombres décimaux représentés en virgule flottante. Par rapport à la classe native :class:`float`, elle est particulièrement utile pour

source: financial applications and other uses which require exact decimal representation,
fr: les application traitant de finance est autres usages nécessitant une représentation décimale exacte,

source: control over precision,
fr: contrôle sur la précision,

source: control over rounding to meet legal or regulatory requirements,
fr: contrôle sur les arrondis pour correspondre aux obligations légales ou du régulateur,

source: tracking of significant decimal places, or
fr: suivre les décimales significatives, ou

source: applications where the user expects the results to match calculations done by hand.
fr: les applications avec lesquelles l'utilisateur attend des résultats identiques aux calculs faits à la main.

source: For example, calculating a 5% tax on a 70 cent phone charge gives different results in decimal floating point and binary floating point. The difference becomes significant if the results are rounded to the nearest cent::
fr: Par exemple, calculer 5% de taxe sur une facture de 70 centimes donne un résultat différent en nombre a virgule flottantes binaires et décimales. La différence devient significative lorsqu'on arrondit le résultat au centime près ::

source: The :class:`~decimal.Decimal` result keeps a trailing zero, automatically inferring four place significance from multiplicands with two place significance. Decimal reproduces mathematics as done by hand and avoids issues that can arise when binary floating point cannot exactly represent decimal quantities.
fr: Le résultat d'un calcul donné par :class:`~decimal.Decimal` conserve les zéro non-significatifs. La classe conserve automatiquement quatre décimales significatives pour des opérandes à deux décimales significatives. La classe ``Decimal`` imite les mathématiques tels qu'elles pourraient être effectuées à la main, évitant les problèmes typique de l'arithmétique binaire à virgule flottante qui n'est pas capable de représenter exactement certaines quantités décimales.

source: Exact representation enables the :class:`~decimal.Decimal` class to perform modulo calculations and equality tests that are unsuitable for binary floating point::
fr: La représentation exacte de la classe :class:`~decimal.Decimal`lui permet de faire des calculs du modulo ou des tests d'égalité qui ne seraient pas possibles avec des virgules flottantes binaires ::

source: The :mod:`decimal` module provides arithmetic with as much precision as needed::
fr: Le module :mod:`decimal` permet de faire des calculs avec autant de précision que nécessaire ::

source: Virtual Environments and Packages
fr: Environnements virtuels et Paquets

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
fr: Les programmes Python utilisent souvent des paquets et modules qui ne font pas partie de la bibliothèque standard. Ils nécessitent aussi, parfois, une version spécifique de la bibliothèque, nécessitant par exemple qu'un certain bug ai été corrigé, ou encore que le programme à été implémenté en utilisant une version obsolète de l'interface de la bibliothèque.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
fr: Cela signifie qu'il n'est pas forcément possible, pour une installation de Python, de couvrir tous les besoins de toutes les applications. Basiquement, si une application A dépend de la version 1.0 d'un module et qu'une application B dépend de la version 2.0, il y a conflit, et installer la version 1.0 ou 2.0 laissera une des deux application incapable de fonctionner.

source: The solution for this problem is to create a :term:`virtual environment` (often shortened to "virtualenv"), a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
fr: La solution à ce problème est de créer un :term:`environnement virtuel` (souvent aérienne appelé "virtualenv"), une arborescence de dossiers contenant une installation de Python autonome, d'une certaine version de Python, avec des paquets additionnels.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtualenv with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
fr: Différents programmes peuvent utiliser différents environnements virtuels. Pour résoudre le conflit précédent (des dépendances conflictuelles) l'application A peut avoir son propre environnement virtuel, avec la version 1.0 du module installée, pendant que l'application B à un autre environnement virtuel avec la version 2.0. Si l'application B nécessite une mise à jour de la bibliothèque en version 3.0, ça n'affectera toujours pas l'application A.

source: Creating Virtual Environments
fr: Création d'Environnements Virtuels

source: The script used to create and manage virtual environments is called :program:`pyvenv`. :program:`pyvenv` will usually install the most recent version of Python that you have available; the script is also installed with a version number, so if you have multiple versions of Python on your system you can select a specific Python version by running ``pyvenv-3.4`` or whichever version you want.
fr: Le script utilisé pour créer et gérer des environnements virtuels est appelé :program:`pyvenv`. :program:`pyvenv` installe habituellement la version la plus récente de Python. Il existe aussi suffixé d'un numéro de version, de manière à pourvoir choisir la version de :program:`pyvenv` ex exécutant par exemple ``pyvenv-3.4`` (ou n'importe quelle autre version).

source: To create a virtualenv, decide upon a directory where you want to place it and run :program:`pyvenv` with the directory path::
fr: Pour créer un virtualenv, appelez le programme :program:`pyvenv` avec en paramètre le nom du dossier dans lequel vous voulez l'installer ::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter, the standard library, and various supporting files.
fr: Cela créera le dossier ``tutorial-env`` (s'il n'existe pas) et des sous dossiers contenant une copie de l'interpréteur Python, de la bibliothèque standard, et quelques autres fichiers utiles.

source: Once you've created a virtual environment, you need to activate it.
fr: Une fois le virtualenv créé, vous devez l'activer.

source: On Windows, run::
fr: Sur windows, lancez ::

source: On Unix or MacOS, run::
fr: Sur Unix et MacOS, lancez ::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
fr: (Ce script est écrit pour le shell :program:`bash`, si vous utilisez :program:`csh` ou :program:`fish`, utilisez les variantes ``activate.csh`` ou ``activate.fish``.)

source: Activating the virtualenv will change your shell's prompt to show what virtualenv you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example::
fr: Activer un virtualenv change votre invite shell pour vous indiquer quel virtualenv vous utilisez, et change votre environnement de manière à ce qu'en lançant ``python``, votre shell trouve le Python de votre virtualenv. Par exemple ::

source: Managing Packages with pip
fr: Gérer les Paquets avec pip

source: Once you've activated a virtual environment, you can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the Python Package Index, <https://pypi.python.org/pypi>. You can browse the Python Package Index by going to it in your web browser, or you can use ``pip``'s limited search feature::
fr: Une fois un virtualenv activé, vous pouvez installer, mettre à jour, ou supprimer des paquets via un programme nommé :program:`pip`. Par défaut pip installe ses paquets depuis le "Python Package Index", <https ://pypi.python.org/pypi>. Vous pouvez parcourir les paquets en allant sur PyPI avec votre navigateur, ou en utilisant la fonction de recherche, basique, de ``pip`` ::

source: ``pip`` has a number of subcommands: "search", "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
fr: ``pip`` a plusieurs sous commandes : "search", "install", " uninstall", "freeze", etc... (Consultez le guide :ref:`installing-index` contenant une documentation exhaustive sur ``pip``.)

source: You can install the latest version of a package by specifying a package's name::
fr: Vous pouvez installer la dernière version d'un paquet simplement par son nom ::

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number::
fr: Il est aussi possible d'installer une version spécifique, en suffixant son nom de ``=`` et le numéro de version ::

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``pip install --upgrade`` to upgrade the package to the latest version::
fr: Si vis exécutez cette commande à nouveau, ``pip`` ne fera rien : il sera conscient que la version demandée est déjà installée. Vous pouvez fournir un numéro de version différent, et ainsi obtenir le paquet à la version demandée, ou lancer ``pip install --upgrade`` pour mettre à jour le paquet vers sa version la plus récente ::

source: ``pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
fr: ``pip uninstall`` suivi d'un ou plusieurs noms de paquets les supprimera de votre virtualenv.

source: ``pip show`` will display information about a particular package::
fr: ``pip show`` affichera des informations à propos d'un paquet donné ::

source: ``pip list`` will display all of the packages installed in the virtual environment::
fr: ``pip list`` énumère les paquets installés dans l'environnement virtuel courant ::

source: ``pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file::
fr: ``pip freeze`` produit aussi une liste de paquets installés, mais dans un format lisible par ``pip install``. Il est coutumier de ranger cette liste dans un fichier nommé ``requirements.txt`` ::

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``::
fr: Le fichier ``requirements.txt`` peut être archivé dans le système de contrôle de version, et livré comme une pièce de l'application. Les utilisateurs pourront ainsi installer les paquets nécessaires avec ``install -r`` ::

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the :ref:`distributing-index` guide.
fr: ``pip`` a beaucoup d'autres options, documentées dans le guide :ref:`installing-index`. Lorsque vous aurez écrit un paquet, si vous voulez le rendre disponible sur PyPI, lisez le guide :ref:`distributing-index`.

source: What Now?
fr: Et Maintenant ?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
fr: Lire ce tutoriel a probablement renforcé votre intérêt pour Python, en der l'utiliser pour résoudre des vrais problèmes. Ou devriez vous aller pour en apprendre plus ?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
fr: Ce tutoriel fait partie de la documentation de Python, mais la documentation de Python est vaste ::

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, write CGI programs, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
fr: Vous devriez naviguer dans le manuel, il est une référence complète, (et donc laconique...) sur les types, fonctions, et modules de la bibliothèque standard. La distribution standard de Python inclus *énormément* de code supplémentaire. Il existe des modules pour lire des emails, récupérer des documents via HTTP, générer des nombres aléatoires, analyser les paramètres de la ligne de commande, écrire des programmes CGI, compresser de la donnée, et plein d'autres tâches. Vous balader dans la documentation de la bibliothèque vous donnera une idée de ce qui est disponnible.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
fr: :ref:`installing-index` explique comment installer des paquets écrits par d'autres utilisateurs de Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
fr: :ref:`reference-index`: Une explication détaillée de la syntaxe et sémantique de Python. C'est une lecture fastidieuse, mais qui a sa place dans une documentation exhaustive.

source: More Python resources:
fr: D'autres ressources:

source: https://www.python.org: The major Python Web site. It contains code, documentation, and pointers to Python-related pages around the Web. This Web site is mirrored in various places around the world, such as Europe, Japan, and Australia; a mirror may be faster than the main site, depending on your geographical location.
fr: https://www.python.org: C'est le site principal pour Python, il y contient du code, de la documentation, des liens vers d'autres sites à propos de Python tout autour d'internet. Il est répliqué dans différents endroits autours du globe, comme en Europe, au Japon, et en Australie, ces répliques peuvent dans certains cas être plus rapides que le site principal, tout dépend d'où vous vous situez.

source: https://docs.python.org: Fast access to Python's documentation.
fr: https://docs.python.org: Un accès rapide à la documentation de Python en anglais. (La traduction en français, vous y êtes, est ici: http://www.afpy.org/doc/python)

source: https://pypi.python.org/pypi: The Python Package Index, previously also nicknamed the Cheese Shop, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
fr: https://pypi.python.org/pypi: "The Python Package Index", (Le Répertoire des Paquets Python), ou auparavant surnommé "The Cheese Shop" (La Fromagerie), est un catalogue de modules Python disponibles au téléchargement, construit par les utilisateurs. Lorsque vous commencez à distribuer du code, vous pouvez l'inscrire ici afin que les autres puissent le trouver.

source: http://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
fr: http://code.activestate.com/recipes/langs/python/: "The Python Cookbook" est un recueil assez important d'exemples de code, de modules, et de scripts. Les contributions les plus remarquables y sont regroupées dans un livre appelé "Python Cookbook" (O'Reilly & Associates, ISBN 0-596-00797-3.)

source: http://www.pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
fr: http://www.pyvideo.org regroupe des liens vers des vidéos relatives à Python, de conférences ou de réunions de groupes d'utilisateurs.

source: http://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
fr: http://scipy.org: Le projet "The Scientific Python" inclu des modules pour manipuler et effectuer des calculs efficients sur des listes. Le projet héberge aussi des paquets divers pour manipuler entre autre l'algèbre linéaire, les transformées de Fourier, des résolveurs non-linéaires, la distributions de nombres aléatoires, l'analyse statistique, etc.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
fr: Pour poser des questions ou rapporter des problèmes liés à Python, vous pouvez écrire sur le forum :newsgroup:`comp.lang.python`, ou les envoyer à la liste de diffusion à python-list@python.org. Le forum et la liste de diffusion sont liées, un message publié sur l'un sera automatiquement transféré sur l'autre. Il y sont publiés des centaines de messages par jour, demandant (ou répondant) à des questions, suggérant des nouvelles fonctionalités, et annoncant des nouveaux modules. Les archives sont disponibles à https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
fr: Avant de poster, assurez vous d'avoir lu la liste de la :ref:`Foire Aux Questions <faq-index>` (aussi appelée FAQ). La FAQ répond à beaucoup de questions fréquentes, et contient probablement une solution à votre problème.
