Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the :keyword:`for` loop, **not** the :keyword:`if` statement.)
fr: (Oui, ce code est correct. Regardez attentivement : l'instruction ``else`` est rattachée à la boucle :keyword:`for`, et **non** à l'instruction :keyword:`if`.)

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does that of :keyword:`if` statements: a :keyword:`try` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the :keyword:`try` statement and exceptions, see :ref:`tut-handling`.
fr: Lorsqu'elle utilisée dans une boucle, la clause ``else`` est donc plus proche de celle associée à une instruction :keyword:`try` que de celle associée à une instruction :keyword:`if` : la clause ``else`` d'une instruction :keyword:`try` s'exécute lorsqu'aucune exception n'est déclenchée, et celle d'une boucle lorsque aucun ``break`` n'intervient. Plus plus d'informations sur l'instruction :keyword:`try` et le traitement des exceptions, consultez :ref:`tut-handling`.

source: The :keyword:`continue` statement, also borrowed from C, continues with the next iteration of the loop::
fr: L'instruction :keyword:`continue`, également empruntée au C, fait passer la boucle à son itération suivante ::

source: :keyword:`pass` Statements
fr: L'instruction :keyword:`pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
fr: L'instruction :keyword:`pass` ne fait rien. Elle peut être utilisée lorsqu'une instruction est nécessaire pour fournir une syntaxe correcte, mais qu'aucune action ne doit être effectuée. Par exemple ::

source: This is commonly used for creating minimal classes::
fr: On utilise couramment cette instruction pour créer des classes minimales ::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`pass` is silently ignored::
fr: Un autre cas d'utilisation du :keyword:`pass` est de réserver un espace en phase de développement pour une fonction ou un traitement conditionnel, vous permettant ainsi de construire votre code à un niveau plus abstrait. L'instruction :keyword:`pass` est alors ignorée silencieusement ::

source: Defining Functions
fr: Définir des fonctions

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
fr: On peut créer une fonction qui écrit la suite de Fibonacci jusqu'à une limite imposée ::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
fr: Le mot-clé :keyword:`def` introduit une *définition* de fonction. Il doit être suivi du nom de la fonction et d'une liste entre parenthèses de ses paramètres. L'instruction qui constitue le corps de la fonction débute à la ligne suivante, et doit être indentée.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
fr: La première instruction d'une fonction peut, de façon facultative, être une chaîne de caractères littérale ; cette chaîne de caractères sera alors la chaîne de documentation de la fonction, ou :dfn:`docstring` (consultez la section :ref:`tut-docstrings` pour en savoir plus). Il existe des outils qui utilisent ces chaînes de documentation pour générer automatiquement une documentation en ligne ou imprimée, ou pour permettre à l'utilisateur de naviguer de façon interactive dans le code ; prenez-en l'habitude, c'est une bonne habitude que de documenter le code que vous écrivez !

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables cannot be directly assigned a value within a function (unless named in a :keyword:`global` statement), although they may be referenced.
fr: *L'exécution* d'une fonction introduit une nouvelle table de symboles utilisée par les variables locales de la fonction. Plus précisément, toutes les affectations de variables effectuées au sein d'une fonction stockent la valeur dans la table de symboles locale ; tandis que les références de variables sont recherchées dans la table de symboles locale, puis dans la table de symboles locale des fonctions englobantes, puis dans la table de symboles globale et finallement dans la table de noms des primitives. Par conséquent, il est impossible d'affecter une valeur à une variable globale (sauf en utilisant une instruction :keyword:`global`), bien qu'elles puissent être référencées.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, a new local symbol table is created for that call.
fr: Les paramètres effectifs (arguments) d'une fonction sont introduits dans la table de symboles locale de la fonction appelée lorsqu'elle est appelée ; par conséquent, les passages de paramètres se font *par valeur*, la *valeur* étant toujours une *référence* à un objet, et non la valeur de l'objet lui-même. [#]_ Lorsqu'une fonction appelle une autre fonction, une nouvelle table de symboles locale est créée pour cet appel.

source: A function definition introduces the function name in the current symbol table. The value of the function name has a type that is recognized by the interpreter as a user-defined function. This value can be assigned to another name which can then also be used as a function. This serves as a general renaming mechanism::
fr: Une définition de fonction introduit le nom de la fonction dans la table de symboles courante. La valeur du nom de la fonction est un type qui est reconnu par l'interpréteur comme une fonction utilisateur. Cette valeur peut être affectée à un autre nom qui pourra alors être utilisé également comme une fonction. Ceci fournit un mécanisme de renommage général ::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
fr: Si vous venez d'autres langages, vous pouvez penser que ``fib`` n'est pas une fonction mais une procédure, puisqu'elle ne renvoie pas de résultat. En fait, même les fonctions sans instruction :keyword:`return` renvoient une valeur, quoique ennuyeuse. Cette valeur est appelée ``None`` (c'est le nom d'une primitive). Écrire la valeur ``None`` est normalement supprimé par l'interpréteur lorsqu'il s'agit de la seule value écrite. Vous pouvez le voir si vous y tenez vraiment en utilisant :func:`print` ::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
fr: Il est facile d'écrire une fonction qui renvoie une liste de la série de Fibonacci au lieu de l'imprimer ::

source: This example, as usual, demonstrates some new Python features:
fr: Cet exemple, comme d'habitude, illustre de nouvelles fonctionnalités de Python :

source: The :keyword:`return` statement returns with a value from a function. :keyword:`return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
fr: L'instruction :keyword:`return` provoque la sortie de la fonction en renvoyant une valeur. :keyword:`return` sans expression en paramètre renvoie ``None``. Arriver à la fin d'une fonction sans instruction :keyword:`return` renvoie également ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
fr: L'instruction ``result.append(a)`` appelle une *méthode* de l'objet ``result`` qui est une liste. Une méthode est une fonction qui 'appartient' à un objet et qui est nommée ``obj.methodname``, où ``obj`` est un objet (il peut également s'agir d'une expression), et ``methodname`` est le nom d'une méthode définie par le type de l'objet. Différents types définissent différentes méthodes. Des méthodes de différents types peuvent porter le même nom sans qu'il n'y ait d'ambigüité (vous pouvez définir vos propres types d'objets et leurs méthodes en utilisant des *classes*, voir :ref:`tut-classes`). La méthode :meth:`append` donnée dans cet exemple est définie pour les listes ; elles ajoute un nouvel élément à la fin de la liste. Dans cet exemple, elle est l'équivalent de ``result = result + [a]``, mais elle est plus efficace.

source: More on Defining Functions
fr: D'avantage sur la définition des fonctions

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
fr: Il est également possible de définir des fonctions avec un nombre variable d'arguments. Trois syntaxes peuvent être utilisées, éventuellement combinées.

source: Default Argument Values
fr: Valeur par défaut des arguments

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
fr: La forme la plus utile consiste à indiquer une valeur par défaut pour certains arguments. Ceci crée une fonction qui pourra être appelée avec moins d'arguments que ceux présents dans sa définition. Par exemple ::

source: This function can be called in several ways:
fr: Cette fonction peut être appelée de plusieurs façons :

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
fr: en ne fournissant que les arguments obligatoires : ``ask_ok('Voulez-vous vraiment quitter ?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
fr: en fournissant une partie des arguments facultatifs : ``ask_ok('OK pour écraser le fichier ?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
fr: en fournissant tous les arguments : ``ask_ok('OK pour écraser le fichier ?', 2, 'Allez, seulement oui ou non !')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
fr: Cet exemple présente également le mot-clé :keyword:`in`. Celui-ci permet de tester si une séquence contient une certaine valeur.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
fr: Les valeurs par défaut sont évaluées lors de la définition de la fonction dans la portée de *définition*, de telle sorte que ::

source: will print ``5``.
fr: imprimera ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
fr: **Avertissement important :** La valeur par défaut n'est évaluée qu'une seule fois. Ceci fait une différence lorsque cette valeur par défaut est un objet mutable tel qu'une liste, un dictionnaire ou des instances de la plupart des classes. Par exemple, la fonction suivante accumule les arguments qui lui sont passés au fil des appels successifs ::

source: This will print ::
fr: Ceci imprimera ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
fr: Si vous ne voulez pas que cette valeur par défaut soit partagée entre des appels successifs, vous pouvez écrire la fonction de cette façon ::

source: Keyword Arguments
fr: Les arguments nommés

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
fr: Les fonctions peuvent également être appelées en utilisant des :term:`arguments nommés <keyword argument>` sous la form ``kwarg=value``. Par exemple, la fonction suivante ::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
fr: accepte un argument obligatoire (``voltage``) et trois arguments facultatifs (``state``, ``action`` et ``type``). Cette fonction peut être appelée de n'importe laquelle des façons suivantes ::

source: but all the following calls would be invalid::
fr: mais tous les appels qui suivent sont incorrects ::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
fr: Dans un appel de fonction, les arguments nommés doivent suivre les arguments positionnés. Tous les arguments nommés doivent correspondre à l'un des arguments acceptés par la fonction (par exemple, ``actor`` n'est pas un argument accepté par la fonction ``parrot``), mais leur ordre n'est pas important. Ceci inclut également les arguments facultatifs (``parrot(voltage=1000)`` est également correct). Aucun argument ne peut recevoir une valeur plus d'une fois, comme l'illustre cet exemple incorrect du fait de cette restriction ::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a tuple containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
fr: Quand un dernier paramètre formel est présent sous la forme ``**name``, il reçoit un dictionnaire (voir :ref:`typesmapping`) contenant tous les arguments nommés à l'exception de ceux correspondant à un paramètre formel. Ceci peut être combiné à un paramètre formel sous la forme ``*name`` (décrit dans la section suivante) qui lui reçoit un tuple contenant les arguments positionnés au-delà de la liste des paramètres formels (``*name`` doit être présent avant ``**name``). Par exemple, si vous définissez une fonction comme ceci :

source: It could be called like this::
fr: Elle pourrait être appelée comme ceci ::

source: and of course it would print::
fr: et imprimera alors ::

source: Note that the list of keyword argument names is created by sorting the result of the keywords dictionary's ``keys()`` method before printing its contents; if this is not done, the order in which the arguments are printed is undefined.
fr: Notez que la liste des arguments nommés est créée en triant les clés du dictionnaire extraites par la méthode ``keys()` avant de les imprimer. Si celà n'est pas fait, l'ordre dans lequel les arguments sont imprimée n'est pas défini.

source: Arbitrary Argument Lists
fr: Listes d'arguments arbitraires

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
fr: Pour terminer, l'option la moins fréquente consiste à indiquer qu'une fonction peut être appelée avec un nombre arbitraire d'arguments. Ces arguments sont intégrés dans un tuple (voir :ref:`tut-tuples`). Avant le nombre variable d'arguments, zéro arguments normaux ou plus peuvent apparaître ::

source: Normally, these ``variadic`` arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
fr: Normalement, c'est arguments ``variadiques`` sont les derniers paramètres, parce qu'ils agrègent toutes les valeurs suivantes. Tout paramètre placé après le paramètre ``*arg`` ne pourront être utilisées que par leur nom.

source: Unpacking Argument Lists
fr: Séparation des listes d'arguments

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
fr: La situation inverse intervient lorsque les arguments sont déjà dans une liste ou un tuple mais doivent être séparés pour un appel de fonction nécessitant des arguments positionnés séparés. Par exemple, la primitive :func:`range` attend des arguments *start* et *stop* distincts. S'ils ne sont pas disponibles séparément, écrivez l'appel de fonction en utilisant l'opérateur ``*`` pour séparer les arguments présents dans une liste ou un tuple ::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
fr: De la même façon, les dictionnaires peuvent fournir des arguments nommés en utilisant l'opérateur ``**`` ::

source: Lambda Expressions
fr: Fonctions anonymes

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
fr: Avec le mot-clé :keyword:`lambda`, on peut créer de petites fonctions anonymes. Voilàune fonction qui renvoie la somme de ses deux arguments : ``lambda a, b: a+b``. Les fonctions lambda peuvent être utilisées partout où un objet fonction est attendu. Elles sont syntaxiquement restreintes à une seule expression. Sémantiquement, elles ne sont qu'un sucre syntaxique pour une définition de fonction normale. Comme les fonctions imbriquées, les fonctions lambda peuvent référencer des variables de la portée englobante ::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
fr: L'exemple précédent utilise une fonction anonyme pour renvoyer une fonction. Un aute usage typique est de donner une fonction minimaliste directement en temps que paramètre::

source: Documentation Strings
fr: Chaînes de documentation

source: Here are some conventions about the content and formatting of documentation strings.
fr: Voici quelques conventions concernant le contenu et le format des chaînes de documentation.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
fr: La première ligne devrait toujours être courte, un résumé concis de l'utilité de l'objet. Pour être bref, nul besoin de rappeler le nom de l'objet ou son type, qui sont accessibles par d'autres moyens (sauf si le nom est un verbe qui décrit une opération). Cette ligne devrait commencer avec une majuscule et se terminer par un point.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
fr: Si il a d'autres lignes dans la chaîne de documentation, la seconde ligne devrait être vide, pour la séparer visuellement du reste de la description. Les autres lignes peuvent alors constituer un ou plusieurs paragraphes décrivant le mode d'utilisation de l'objet, ses effets de bord, etc.
