Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
fr: L'analyseur de code Python ne supprime pas l'indentation des chaînes de caractères littérales multi-lignes, donc les outils qui utilisent la documentation doivent si besoin faire cette opération eux-mêmes. La convention suivante s'applique : la première ligne non vide *après* la première détermine la profondeur d'indentation de l'ensemble de la chaîne de documentation (on ne peut pas utiliser la première ligne qui est généralement accolée aux guillemets d'ouverture de la chaîne de caractères et dont l'indentation n'est donc pas visible). Les espaces "correspondant" à cette profondeur d'indentation sont alors supprimés du début de chacune des lignes de la chaîne. Aucune ligne ne devrait présenter un niveau d'indentation inférieur mais si cela arrive, tous les espaces situés en début de ligne doivent être supprimés. L'équivalent des espaces doit être testé après expansion des tabulations (normalement remplacés par 4 espaces).

source: Here is an example of a multi-line docstring::
fr: Voici un exemple de chaîne de documentation multi-lignes ::

source: Function Annotations
fr: Annotations de fonctions

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`484` for more information).
fr: :ref:`Function annotations <function>` sont des métadonnée optionnelles décrivant les types utilisées par une fonction définie par l'utilisateur (Voir la :pep:`484` pour plus d'informations).

source: Annotations are stored in the :attr:`__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a positional argument, a keyword argument, and the return value annotated::
fr: Les annotations sont stockées dans l'attribut :attr:`__annotations__` de la fonction, sous forme d'un dictionnaire, et n'ont aucun autre effet. Les annotations sur les paramètres sont définis par deux points (:) après le nom du paramètre suivi d'une expression donnant la valeur de l'annotation. Les annotations de retour sont définies par ``->`` suivi d'une expression, entre la liste des paramètres et les deux points de fin de l'instruction :keyword:`def`. L'exemple suivant a un paramètre positionnel, un paramètre nommé, et une valeur de retour annotée ::

source: Intermezzo: Coding Style
fr: Un style de codage : Intermezzo

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
fr: Maintenant que vous êtes prêt à écrire des programmes plus longs et plus complexes, il est temps de parler du *style de codage*. La plupart des langages peuvent être écrits (ou plutôt *formattés*) selon différents styles ; certains sont plus lisibles que d'autres. Rendre la lecture de votre code plus facile aux autres est toujours une bonne idée, et adopter un bon style de codage peut énormément vous y aider.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
fr: En Python, la :pep:`8` a émergé comme étant un guide auquel la plupart des projets adhèrent ; elle met en avant un style de codage très lisible et agréable à l'oeil. Chaque développeur Python devrait donc la lire et s'en inspirer autant que possible ; voici ses principaux points notables :

source: Use 4-space indentation, and no tabs.
fr: Utilisez des indentations de 4 espaces, et pas de tabulation.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
fr: 4 espaces constituent un bon compromis entre une indentation courte (qui permet une profondeur d'imbrication plus importante) et une longue (qui rend le code plus facile à lire). Les tabulations introduisent de la confusion, et doivent être proscrites autant que possible.

source: Wrap lines so that they don't exceed 79 characters.
fr: Faites des retours à la ligne, de telle sorte qu'elles n'excèdent pas 79 caractères.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
fr: Ceci aide les utilisateurs ne disposant que de petits écrans, et permet sur de plus grands de disposer plusieurs fichiers côte à côte sans difficulté.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
fr: Utilisez des lignes vides pour séparer les fonctions et les classes, ou pour scinder de gros blocs de code à l'intérieur de fonctions.

source: When possible, put comments on a line of their own.
fr: Lorsque c'est possible, placez les commentaires sur leur propres lignes.

source: Use docstrings.
fr: Utilisez les chaînes de documentation

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
fr: Utilisez des espaces autour des opérateurs et après les virgules, mais pas directement à l'intérieur des parenthèses : ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``CamelCase`` for classes and ``lower_case_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
fr: Nommez toujours vos classes et fonctions de la même manière ; la convention est d'utiliser une notation ``CamelCase`` pour les classes, et ``minuscules_avec_trait_bas`` pour les fonctions et méthodes. Utilisez toujours ``self`` comme nom du premier argument des méthodes (voyez :ref:`tut-firstclasses` pour en savoir plus sur les classes et les méthodes).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
fr: N'utilisez pas d'encodages exotiques dès lors que votre code est sensé être utilisé dans des environnements internationaux. Par défaut, Python travaille en UTF-8, ou sinon du simple ASCII fonctionne dans la plupart des cas.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
fr: De la même manière, n'utilisez que des caractères ASCII pour vos noms de variables si vous soupçonnez qu'un personne parlant une autre langue lira ou devra modifiervotre code.

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
fr: En fait, *appels par référence d'objets* serait sans doute une desciption plus juste, dans la mesure où si un objet mutable est passé en argument, l'appelant verra toutes les modifications qui lui auront été apportées par l'appelé (insertion d'éléments dans une liste...).

source: Data Structures
fr: Structures de données

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
fr: Ce chapitre reprend plus en détail quelques point déjà décrits précédemment, et introduit également de nouvelles notions.

source: More on Lists
fr: Compléments sur les listes

source: The list data type has some more methods. Here are all of the methods of list objects:
fr: Le type liste dispose de méthodes supplémentaires. Voici la liste complète des méthodes des objets de type liste :

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
fr: Ajoute un élément à la fin de la liste. Equivalent à ``a[len(a):] = [x]``.

source: Extend the list by appending all the items in the given list. Equivalent to ``a[len(a):] = L``.
fr: Étend la liste en y ajoutant tous les éléments de la liste fournie.Équivalent à ``a[len(a):] = L``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
fr: Insère un élément à la position indiquée. Le premier argument est la position de l'élément courant avant lequel l'insertion doit s'effectuer, donc ``a.insert(0, x)`` insère l'élément en tête de la liste, et ``a.insert(len(a), x)`` est équivalent à ``a.append(x)``.

source: Remove the first item from the list whose value is *x*. It is an error if there is no such item.
fr: Supprime de la liste le premier élément dont la valeur est *x*. Une exception est levée s'il existe aucun élément avec cette valeur.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. (The square brackets around the *i* in the method signature denote that the parameter is optional, not that you should type square brackets at that position. You will see this notation frequently in the Python Library Reference.)
fr: Enlève de la liste l'élément situé à la position indiquée, et le retourne. Si aucune position n'est indiqué, ``a.pop()`` enlève et retourne le dernier élément de la liste (les crochets autour du *i* dans la signature de la méthode indiquent bien que ce paramètre est facultatif, et non que vous devez placer des crochets dans votre code ! Vous retrouverez cette notation fréquemment dans le Guide de Référence de la Bibliothèque Python).

source: Remove all items from the list. Equivalent to ``del a[:]``.
fr: Supprime tous les éléments de la liste, équivalent à ``del a[:]``.

source: Return the index in the list of the first item whose value is *x*. It is an error if there is no such item.
fr: Retourne la position du premier élément de la liste ayant la valeur *x*. Une exception est levée s'il n'existe aucun élément avec cette valeur.

source: Return the number of times *x* appears in the list.
fr: Retourne le nombre d'éléments ayant la valeur *x* dans la liste.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
fr: Trie les éléments sur place, (les arguments peuvent personaliser le tri, voir :func:`sorted` pour leur explication).

source: Reverse the elements of the list in place.
fr: Inverse l'ordre des éléments de la liste, sur place.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
fr: Renvoie une copie superficielle de la liste. Équivalent à ``a[:]``.

source: An example that uses most of the list methods::
fr: L'exemple suivant utilise la plupart des méthodes des listes ::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [1]_ This is a design principle for all mutable data structures in Python.
fr: Vous avez probablement remarqué que les méthodes tel que ``insert``, ``remove`` ou``sort``, qui ne font que modifier la liste, ne renvoient pas de valeur mais ``None``. [1]_ C'est un principe respecté par toutes les structures de données variables en Python.

source: Using Lists as Stacks
fr: Utiliser les listes comme des piles

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`append`. To retrieve an item from the top of the stack, use :meth:`pop` without an explicit index. For example::
fr: Les méthodes des listes rendent très facile leur utilisation comme des piles, où le dernier élément ajouté est le premier récupéré ("dernier entré, premier sorti", ou LIFO pour "last-in, first-out"). Pour ajouter un élément sur la pile, utilisez la méthode :meth:`append`. Pour récupérer l'objet au sommet de la pile, utilisez la méthode :meth:`pop`, sans indicateur de position. Par exemple ::

source: Using Lists as Queues
fr: Utiliser les listes comme des files

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
fr: Il est également possible d'utiliser une liste comme une file, où le premier élément ajouté est le premier récupéré ("premier entré, premier sorti", ou FIFO pour "first-in, first-out") ; touefois, les listes ne sont pas très efficaces pour ce type de traitement. Alors que les ajouts et suppressions en fin de liste sont rapides, les opérations d'insertions ou de retraits en début de liste sont lentes (car tous les autres éléments doivent être décalés d'une position).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
fr: Pour implémenter une file, utilisez donc la classe :class:`collections.deque` qui a été conçue pour fournir des opérations d'ajouts et de retraits rapides aux deux extrémités. Par exemple ::

source: List Comprehensions
fr: Compréhensions de listes

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
fr: Les compréhensions de listes fournissent un moyen de construire des listes de manière très concice. Une application classique est la construction de nouvelles listes où chaque élément est le résultat d'une opération appliquée à chaque élément d'une autre séquence, ou de créer une sous-séquence des éléments satisfaisant une condition spécifique.

source: For example, assume we want to create a list of squares, like::
fr: Par exemple, supposons que l'on veuille créer une liste de carrés, comme ::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
fr: Notez que cela créé (ou écrase) une variable nommée ``x``qui existe toujours après l'exécution de la boucle. On peut calculer une liste de carrés sans effet de bord, avec ::

source: or, equivalently::
fr: ou ::

source: which is more concise and readable.
fr: qui est plus court et lisible.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`for` clause, then zero or more :keyword:`for` or :keyword:`if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`for` and :keyword:`if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
fr: Une compréhension de liste consiste en crochets contenant une expression suivie par une clause :keyword:`for`, puis par zéro ou plus clauses :keyword:`for` ou :keyword:`if`. Le résultat sera une nouvelle liste résultat de l'évaluation de l'expression dans le contexte des clauses :keyword:`for` et :keyword:`if` qui la suivent. Par exemple, cette compréhension de liste combine les éléments de deux listes s'ils ne sont pas égaux ::

source: and it's equivalent to::
fr: et c'est équivaent à ::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
fr: Notez que l'ordre des instructions :keyword:`for` et :keyword:`if` est le même dans ces différents extraits de code.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
fr: Si l'expression est un tuple (c'est à dire ``(x, y)`` dans cet exemple), elle doit être entourée par des parenthèses ::

source: List comprehensions can contain complex expressions and nested functions::
fr: Les compréhensions de listes peuvent contenir des expressions complexes et des fonctions imbriquées ::

source: Nested List Comprehensions
fr: Compréhensions de listes imbriquées

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
fr: La première expression dans une compréhension de liste peut être n'importe quelle expression, y compris une autre compréhension de liste.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
fr: Voyez l'exemple suivant d'une matrice de 3x4, implémentée sous la forme de 3 listes de 4 éléments ::

source: The following list comprehension will transpose rows and columns::
fr: Cette compréhension de liste va transposer les lignes et les colonnes ::

source: As we saw in the previous section, the nested listcomp is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
fr: Comme on l'a vu dans la section précédente, la compréhension de liste imbriquée est évaluée dans le contexte de l'instruction :keyword:`for` qui la suit, donc cet exemple est équivalent à ::

source: which, in turn, is the same as::
fr: lequel à son tour est équivalent à ::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
fr: Dans des cas concrets, il est toujours préférable d'utiliser des fonctions natives plutôt que des instructions de contrôle de flux complexes. La fonction :func:`zip` ferait dans ce cas un excellent travail ::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
fr: Voyez :ref:`tut-unpacking-arguments` pour plus de détails sur cette ligne.

source: The :keyword:`del` statement
fr: L'instruction :keyword:`del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`pop` method which returns a value. The :keyword:`del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
fr: Il existe un moyen de retirer un élément d'une liste à partir de sa position au lieu de sa valeur : l'instruction :keyword:`del`. Elle diffère de la méthode :meth:`pop` qui, elle, renvoie une valeur. L'instruction :keyword:`del` peut également être utilisée pour supprimer des tranches d'une liste ou la vider complètement (ce que nous avions fait auparavent en affectant une liste vide à la tranche). Par exemple ::

source: :keyword:`del` can also be used to delete entire variables::
fr: :keyword:`del` peut aussi être utilisée pour supprimer des variables ::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
fr: À partir de là, référencer le nom ``a`` est une erreur (au moins jusqu'à ce qu'une autre valeur lui soit affectée). Vous trouverez d'autres utilisations de la fonction :keyword:`del` plus tard.

source: Tuples and Sequences
fr: Tuples et séquences

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
fr: Nous avons vu que les listes et les chaînes de caractères ont beaucoup de propriétés en commun, comme l'indexation et les opérations sur des tranches. Ce sont deux exemple de *séquences* (voir :ref:`typesseq`). Comme Python est un langage en constante évolution, d'autres types de séquences y seront peut-être ajoutés. Il existe également un autre type standard de séquence : le *tuple*.

source: A tuple consists of a number of values separated by commas, for instance::
fr: Un tuple consiste en différentes valeurs séparées par des virgules, comme par exemple ::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
fr: Comme vous pouvez le voir, à l'affichage les tuples sont toujours encadrés par des parenthèses, de façon à ce que des tuples imbriqués soient interprétés correctement ; ils peuvent être entrés avec ou sans parenthèses, même si celles-ci sont souvent nécessaires (notamment lorsqu'un tuple fait partie d'une expression plus longue). Il n'est pas possible d'affecter de valeur à un élément d'un tuple ; par contre, il est possible de créer des tuples contenant des objets mutables, comme des listes.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain an heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
fr: Si les tuples peuvent sembler similaires aux listes, ils sont souvent utilisés dans des cas différents et pour des raisons différentes. Les tuples sont :term:`immuable`\s et contiennent souvent des séquences hétérogènes d'éléments qui sont accédés par "déballage" (voir plus loin) ou indexation (ou même par attributs dans le cas des :func:`namedtuples <collections.namedtuple>`). Les listes sont souvent :term:`mutables <mutable>`, et contiennent des éléments homogènes qui sont accédés par itération sur la liste.
