Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: Attempting to use an index that is too large will result in an error::
fr: Utiliser un indice trop grand générera une erreur ::

source: However, out of range slice indexes are handled gracefully when used for slicing::
fr: Cependant, les indices hors bornes sont gérés silencieusement lorsqu'ils sont utilisés dans des tranches ::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
fr: Les chaînes de caractères, en Python ne peuvent pas être modifiées, on dit quelles sont :term:`immuables `. Affecter une nouvelle valeur à un indice dans une chaîne produit une erreur ::

source: If you need a different string, you should create a new one::
fr: Si vous avez besoin d'une chaîne différente, vous devez en créer une autre ::

source: The built-in function :func:`len` returns the length of a string::
fr: La fonction native :func:`len` renvoie la longueur d'une chaîne ::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
fr: Les chaînes de caractères sont des exemples de *types séquences*, et supportent donc lesopérations classiques prises en charge par ces types.

source: Strings support a large number of methods for basic transformations and searching.
fr: Les chaînes de caractères supportent un large éventail de méthodes de transformations basiques et de recherche.

source: Information about string formatting with :meth:`str.format` is described here.
fr: Le formatage des chaînes avec la méthode :meth:`str.format` est décrit ici.

source: The old formatting operations invoked when strings and Unicode strings are the left operand of the ``%`` operator are described in more detail here.
fr: Les anciennes opérations de formatage appelées lorsque les chaînes de caractères et les chaînes Unicode sont les opérandes placés à gauche de l'opérateur ``%`` sont décrites plus en détail ici.

source: Lists
fr: Les listes

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
fr: Python connaît différents types de données *combinés*, utilisés pour regrouper plusieurs valeurs. La plus souple est la *liste*, qui peut être écrite comme une suite de valeurs (éléments) séparés par des virgules placée entre crochets. Les éléments d'une liste ne sont pas obligatoirement tous du même type, bien qu'à l'usage ce soit souvent le cas. ::

source: Like strings (and all other built-in :term:`sequence` type), lists can be indexed and sliced::
fr: Comme les chaînes de caractères (et toute autre types de :term:`sequence`), les listes peuvent être indicées et découpées ::

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a new (shallow) copy of the list::
fr: Toutes les opérations par tranches renvoient une nouvelle liste contenant les éléments demandés. Ce qui signifie que l'opération suivante renvoie une copie superficielle de la liste ::

source: Lists also support operations like concatenation::
fr: Les listes gèrent aussi les opérations comme les concaténations ::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
fr: Mais à la différence des listes qui sont :term:`immuable`\s, les listes sont :term:`variable`\s : il est possible de changer leur contenu ::

source: You can also add new items at the end of the list, by using the :meth:`~list.append` *method* (we will see more about methods later)::
fr: Il est aussi possible d'ajouter de nouveaux éléments à la fin d'une liste avec la méthode :meth:`~list.append`. (Les méthodes seront abordées plus tard) ::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
fr: Des affectations de tranches sont également possibles, ce qui peut même modifier la taille de la liste ou la vider complètement ::

source: The built-in function :func:`len` also applies to lists::
fr: La primitive :func:`len` s'applique aussi aux listes ::

source: It is possible to nest lists (create lists containing other lists), for example::
fr: Il est possible d'imbriquer des listes (de créer des listes contenant d'autres listes), par exemple ::

source: First Steps Towards Programming
fr: Premiers pas vers la programmation

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the *Fibonacci* series as follows::
fr: Bien entendu, on peut utiliser Python pour des tâches plus compliquées que d'additionner deux et deux. Par exemple, on peut écrire une sous-séquence initiale de la suite de Fibonacci comme ceci ::

source: This example introduces several new features.
fr: Cet exemple introduit plusieurs nouvelles fonctionnalités.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
fr: La première ligne contient une *affectation multiple* : les variables ``a`` et ``b`` se voient affecter simultanément leurs nouvelles valeurs 0 et 1. Cette méthode est encore utilisée à la dernière ligne, pour démontrer que les expressions sur la partie droite de l'affectation sont toutes évaluées avant que les affectations ne soient effectuées. Ces expressions en partie droite sont toujours évaluées de la gauche vers la droite.

source: The :keyword:`while` loop executes as long as the condition (here: ``b < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
fr: La boucle :keyword:`while` s'exécute tant que la condition (ici : ``b < 10``) reste vraie. En Python, comme en C, tout entier différent de zéro est vrai et zéro est faux. La condition peut aussi être une chaîne de caractères, une liste, ou en fait toute séquence ; une séquence avec une valeur non nulle est vraie, une séquence vide est fausse. Le test utilisé dans l'exemple est une simple comparaison. Les opérateurs de comparaison standards sont écrits comme en C : ``<`` (inférieur), ``>`` (supérieur), ``==`` (égal), ``<=`` (inférieur ou égal), ``>=`` (supérieur ou égal) et ``!=`` (non égal).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
fr: Le *corps* de la boucle est *indenté* : l'indentation est la méthode utilisée par Python pour regrouper des instructions. En mode interactif, vous devez saisir une tabulation ou des espaces pour chaque ligne indentée. En pratique, vous aurez intérêt à utiliser un éditeur de texte pour les saisies plus compliquées ; tous les éditeurs de texte dignes de ce nom disposent d'une fonction d'auto-indentation. Lorsqu'une expression composée est saisie en mode interactif, elle doit être suivie d'une ligne vide pour indiquer qu'elle est terminée (car l'analyseur ne peut pas deviner que vous venez de saisir la dernière ligne). Notez bien que toutes les lignes à l'intérieur d'un bloc doivent être indentées au même niveau.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
fr: La fonction :func:`print` écrit les valeur des paramètres qui lui sont fournis. Ce n'est pas la même chose que d'écrire l'expression que vousvoulez afficher (comme nous l'avons fait dans l'exemple de la calculatrice), dû à la manière de :func:`print` de gérer les paramètres multiples, les nombres décimaux, et les chaînes. Les chaînes sont affichées sans apostrophes et unespace est inséré entre les éléments de telle sorte que vous pouvez facilement formater les choses, comme ceci ::

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
fr: Le paramètre nommé *end* peut servir pour enlever le retour à la ligne, ou terminer la ligne par une autre chaîne ::

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
fr: Puisque ``**`` est prioritaire sur ``-``, ``-3 ** 2`` sera interprété ``-(3 ** 2)`` et vaudra donc ``-9``. Pour éviter cela et obtenir ``9``, utilisez des parenthèses : ``(-3) ** 2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
fr: Contrairement à d'autres langages, les caractères spéciaux comme ``\n`` ont la même signification entre guillemets (`"..."`) ou guillemets simples (`'...'`). La seule différence est que dans une chaîne entre guillemets il n'est pas nécessaire de protéger les guillemets simples et vice-versa.

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
fr: Lorsque vous quittez et entrez à nouveau dans l'interpréteur Python, tout ce que vous avez déclaré dans la session précédente est perdu. Afin de rédiger des programmes plus longs, vous devriez utiliser un éditeur de texte, préparer votre code dans un fichier, et exécuter Python avec ce fichier en paramètre. Ça s'appelle créé un *script*. Lorsque votre programme deviendra plus long encore, vous pourrez séparer votre code dans plusieurs fichiers, et vous trouverez aussi pratique de réutiliser des fonctions écrites pour un programme dans un autre sans avoir à les copier.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
fr: Pour gérer ça, Python à un moyen de rédiger des définitions dans un fichier et les utiliser dans un script ou une session interactive. Un tel fichier est appelé un *module*, et les définitions d'un module peuvent être importées dans un autre module ou dans le module *main* (qui est le module qui contiens vous variables et définitions lors de l'exécution d'un script ou en mode interactif).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
fr: Un module est un fichier contenant des définitions et des instructions. Son nom de fichier est le même que son nom, suffixé de :file:`.py`. À l'intérieur d'un module, son propre nom est accessible dans la variable ``__name__``. Par exemple, prenez votre éditeur favori et créez un fichier :file:`fibo.py` contenant ::

source: Now enter the Python interpreter and import this module with the following command::
fr: Maintenant, en étant dans le même dossier, ouvrez un interpréteur et importez le module en tapant ::

source: This does not enter the names of the functions defined in ``fibo`` directly in the current symbol table; it only enters the module name ``fibo`` there. Using the module name you can access the functions::
fr: Cela n'importe pas les noms des fonctions définies dans ``fibo`` directement dans la table des symboles courante, mais y ajoute simplement ``fibo``. Vous pouvez donc appeler les fonctions via le nom du module ::

source: If you intend to use a function often you can assign it to a local name::
fr: Si vous avez l'intention d'utiliser une fonction souvent, il est possible de lui assigner un nom local ::

source: More on Modules
fr: Les modules en détails

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
fr: Un module peut contenir aussi bien des instructions que des déclarations de fonctions. C'est instructions permettent d'initialiser le module, et ne sont donc exécutées que la première fois que le nom d'un module est trouvé dans un ``import``. [#]_ (Elles sont aussi exécutées lorsque le fichier est exécuté en temps que script.)

source: Each module has its own private symbol table, which is used as the global symbol table by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
fr: Chaque module a sa propre table de symboles, utilisée comme table de symboles globaux par toutes les fonctions définies par le module. Ainsi l'auteur d'un module peut utiliser des variables globales dans un module sans se soucier de collisions de noms avec des globales définies par l'utilisateur du module. D'un autre côté, si vous savez ce que vous faites, vous pouvez modifier une variable globale d'un module avec la même notation que pour accéder aux fonctions : ``modname.itemname``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names are placed in the importing module's global symbol table.
fr: Des modules peuvent importer d'autres modules. Il est habituel mais pas obligatoire de ranger tous les :keyword:`import` au début du module (ou du script). Les noms des module importés sont insérés dans la table des symboles globaux du module qui importe.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's symbol table. For example::
fr: Il existe une variation à l'instruction :keyword:`import`qui importe les noms d'un module directement dans la table de symboles du module qui l'importe, par exemple ::

source: This does not introduce the module name from which the imports are taken in the local symbol table (so in the example, ``fibo`` is not defined).
fr: Cela n'insère pas le nom du module depuis lequel les définitions sont récupérées dans la table locale de symboles (dans cet exemple, ``fibo`` n'est pas défini).

source: There is even a variant to import all names that a module defines::
fr: Il existe même une variation permettant d'importer tous les noms qu'un module définit ::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
fr: Tous les noms ne commencant pas par un tiret bas (``_``) sont importés. Dans la grande majorité des cas, les développeurs n'utilisent pas cette syntaxe puisqu'en important un ensemble indéfini de noms, des noms déjà définis peuvent se retrouver cachés.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
fr: Notez qu'en général, importer ``*`` d'un module ou d'un paquet est déconseillé, en général ça engendre du code difficilement lisible. Cependant, c'est acceptable de l'utiliser pour gagner quelques secondes en mode interactif.

source: Executing modules as scripts
fr: Exécuter des modules comme des scripts

source: When you run a Python module with ::
fr: Lorsque vous exécutez un module Python avec ::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
fr: le code du module sera exécuté comme si vous l'aviez importé, mais son ``__name__`` vaudra ``"__main__"``. Donc en ajoutant ces lignes à la fin du module ::

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file::
fr: vous pouvez rendre le fichier utilisable comme un script ou importable en temps que module, puisque le code qui lis les paramètres de la ligne de commande n'est exécuté que si le module est le fichier principal ::

source: If the module is imported, the code is not run::
fr: Si le fichier est importé, le code n'est pas exécuté ::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
fr: C'est typiquement utilisé soit pour proposer une interface utilisateur pour un module, soit pour lancer les tests sur le module (où exécuter le module en temps que script lance les tests).

source: The Module Search Path
fr: Les dossiers de recherche de modules

source: When a module named :mod:`spam` is imported, the interpreter first searches for a built-in module with that name. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
fr: Lorsqu'un module nommé par exemple :mod:`spam` est importé, il est d'abord recherché parmis les modules natifs, puis s'il n'y est pas trouvé, l'interpréteur va chercher un fichier nommé :file:`spam.py` dans une liste de dossiers donnés par la variable :data:`sys.path` initialisée par défaut à ::

source: The directory containing the input script (or the current directory when no file is specified).
fr: Le dossier contenant le script courant (ou le dossier courant si aucun script n'est donné).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
fr: :envvar:`PYTHONPATH` (une liste de dossiers, utilisant la même syntaxe que la variable shell :envvar:`PATH`).

source: The installation-dependent default.
fr: La valeur par défaut, dépendante de l'installation.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
fr: Sur les systèmes qui gèrent les liens symboliques, le dossier contenant le script courant est résolu après avoir suivi le lien sublimer du script. Autrement dit le dossier contenant le lien symbolique n'est **pas** ajouté au dossiers de recherche de modules.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
fr: Après leur initialisation, les programmes Python peuvent modifier leur :data:`sys.path`. Le dossier contenant le script courant est placé au début de la liste des dossiers à rechercher, avant les dossiers de bibliothèques, Cela signifie qu'un module dans ce dossier, ayant le même nom qu'un module, sera chargé à sa place. C'est une erreur typique, à moins que ce soit voulu. Voir :ref:`tut-standardmodules` pour plus d'informations.

source: "Compiled" Python files
fr: Fichiers Python "compilés"

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
fr: Pour accélérer le chargement des modules, Python cache une version compilée de chaque module, dans un fichier nommé :file:`module(version).pyc` (ou *version* représente le format du fichier compilé, typiquement une version de Python) dans le dossier ``__pycache__``. Par exemple avec CPython 3.3 la version compilée de spam.py serait ``__pycache__/spam.cpython-33.pyc``. Cette règle de nommage permet à des versions compilées par des versions de Python différentes de coexister.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
fr: Python compare les dates de modification du fichier source et de sa version compilée pour voir si le module doit être recompilé. Ce processus est entièrement automatique, et les versions compilées sont indépendantes de la plateforme, et peuvent donc être partagées entre des systèmes d'architecture différente.
