Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see https://www.python.org/download/releases/2.3/mro/.
fr: L'ordre défini dynamiquement est nécessaire car tous les cas d'héritage multiple comportent une ou plusieurs relations en losange (où au moins une classe peut être accédée à partir de plusieurs chemins en pariant de la classe la plus base). Par exemple, puisque toutes les classes héritent de :class:`object`, tout héritage multiple ouvre plusieurs chemins pour atteindre :class:`object`. Pour qu'une classe de base ne soit pas appelée plusieurs fois, l'algorithme dynamique linéarise l'ordre de recherche d'une façon qui préserve l'ordre d'héritage, de lagauche vers la droite, spécifié dans chaque classe, qui appelle chaque classe parente une seule fois, qui est monotone (ce qui signifie qu'une classe peut être sous-classée sans affecter l'ordre d'héritage de ses parents). Prises ensemble, ces propriétés permettent de concevoir des classes de façon fiable et extensible dans un contexte d'héritage multiple. Pour plus de détail, consultez http://www.python.org/download/releases/2.3/mro/.

source: Private Variables
fr: Variables privées

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
fr: Les membres "privés", qui ne peuvent être accédés en dehors d'un objet, n'existent pas en Python. Toutefois, il existe une convention respectée par la majorité du code Python : un nom préfixé par un tiret bas (comme ``_spam``) doit être vu comme une partie non publique de l'API (qu'il s'agisse d'une fonction, d'une méthode ou d'une variable membre). Il doit être considéré comme un détail d'implémentation pouvant faire l'objet de modification futures sans préavis.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
fr: Dès lors qu'il y a un cas d'utilisation valable pour avoir des membres privés (notamment pour éviter des conflits avec des noms définis dans des sous-classes), il existe un support (certes limité) pour un tel mécanisme, appelé :dfn:`name mangling`. Tout identifiant sous la forme ``__spam`` (avec au moins deux underscores en tête, et au plus un à la fin) est remplacé textuellement par ``_classname__spam``, où ``classname`` est le nom de la classe sans le(s) premier(s) underscore(s). Ce "bricolage" est effectué sans tenir compte de la position syntaxique de l'identifiant, tant qu'il est présent dans la définition d'une classe.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
fr: Ce changement de nom est utile pour permettre à des sous-classes de surcharger des méthodes sans interrompre les appels de méthodes intra-classes. Par exemple ::

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
fr: Notez que ces règles sont conçues avant tout pour éviter les accidents ; il reste possible d'accéder ou de modifier une variable considérée comme privée. Ceci peut même être utile dans certaines circonstances, comme au sein du débogueur.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
fr: Notez que le code passé à ``exec()``, ``eval()`` ne considère pas le nom de la classe appelante comme étant la classe courante ; le même effet s'applique à la directive ``global``, dont l'effet est de la même façon restreint au code compilé dans le même ensemble de byte-code. Les mêmes restrictions s'appliquent à ``getattr()``, ``setattr()`` et ``delattr()``, ainsi qu'aux références directes à ``__dict__``.

source: Odds and Ends
fr: Trucs et astuces

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. An empty class definition will do nicely::
fr: Il est parfois utile d'avoir un type de donnée similaire au "record" du Pascal ou au "struct" du C, qui regroupent ensemble quelques attributs nommés. La définition d'une classe vide remplit parfaitement ce besoin ::

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`read` and :meth:`!readline` that get the data from a string buffer instead, and pass it as an argument.
fr: On peut souvent fournir, à du code Python qui s'attend à recevoir un type de donnée abstrait spécifique, une classe qui simule les méthodes de ce type. Par exemple, si vous avez une fonction qui formate des données extraites d'un objet fichier, vous pouvez définir une classe avec des méthodes :meth:`read` et :meth:`!readline` qui extrait ses données d'un tampon de chaînes de caractères à la place, et lui passer une instance comme argument.

source: Instance method objects have attributes, too: ``m.__self__`` is the instance object with the method :meth:`m`, and ``m.__func__`` is the function object corresponding to the method.
fr: Les objets méthodes d'instances ont également des attributs : ``m.im_self`` est l'instance d'objet avec la méthode :meth:`m`, et ``m.im_func`` est l'objet fonction correspondant à la méthode.

source: Exceptions Are Classes Too
fr: Les exceptions sont aussi des classes

source: User-defined exceptions are identified by classes as well. Using this mechanism it is possible to create extensible hierarchies of exceptions.
fr: Les exceptions définies par l'utilisateur sont également définies par des classes. En utilisant ce mécanisme, il est possible de créer des hiérarchies d'exceptions extensibles.

source: There are two new valid (semantic) forms for the :keyword:`raise` statement::
fr: Il y a deux nouvelles formes (sémantiques) pour l'instruction :keyword:`raise` ::

source: In the first form, ``Class`` must be an instance of :class:`type` or of a class derived from it. The first form is a shorthand for::
fr: Dans la première forme, ``Class`` doit être une instance de :class:`type` ou d'une classe dérivée. La seconde forme est un raccourci pour ::

source: A class in an :keyword:`except` clause is compatible with an exception if it is the same class or a base class thereof (but not the other way around --- an except clause listing a derived class is not compatible with a base class). For example, the following code will print B, C, D in that order::
fr: Une classe dans une clause :keyword:`except` est compatible avec une exception si elle est de la même classe ou d'une de ses classes dérivées (mais l'inverse n'est pas vrai --- une clause except spécifiant une classe dérivée n'est pas compatible avec une classe de base.) Par exemple, le code suivant imprimera B, C et D dans cet ordre ::

source: Note that if the except clauses were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching except clause is triggered.
fr: Notez que si les clauses except avaient été inversées (avec ``except B`` en premier), il aurait imprimé B, B, B --- la première clause except correspondante étant déclenchée.

source: When an error message is printed for an unhandled exception, the exception's class name is printed, then a colon and a space, and finally the instance converted to a string using the built-in function :func:`str`.
fr: Quand un message d'erreur est imprimé pour une exception non traitée, la classe de l'exception est indiquée, suivie de deux points, d'un espace et de l'instance convertie en chaîne de caractères via la fonction :func:`str`.

source: Iterators
fr: Itérateurs

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
fr: Vous avez maintenant certainement remarqué que l'on peut itérer sur la plupart des objets conteneurs en utilisant une instruction :keyword:`for` ::

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
fr: Ce mode d'accès est simple, concis et pratique. L'utilisation d'itérateurs imprègne et unifie Python. En arrière plan, l'instruction :keyword:`for` appelle la fonction :func:`iter` sur l'objet conteneur. Cette fonction renvoie un itérateur qui définit la méthode :meth:`~iterator.__next__`, laquelle accèdeaux éléments du conteneur un par un. Lorsqu'il n'y a plus d'élément, :meth:`~iterator.__next__` lève une exception :exc:`StopIteration` qui indique à la boucle del'instruction :keyword:`for` de se terminer. Cet exemple montre comment tout cela fonctionne ::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`__next__`, then :meth:`__iter__` can just return ``self``::
fr: Une fois compris les mécanismes de gestion des itérateurs, il est simple d'ajouter ce comportement à vos classes. Définissez une méthode :meth:`__iter__`, qui retourne un objet disposant d'une méthode :meth:`~iterator.__next__`. Sila classe définit elle-même la méthode :meth:`__next__`, alors :meth:`__iter__`peut simplement renvoyer ``self`` ::

source: Generators
fr: Générateurs

source: :term:`Generator`\s are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
fr: Les :term:`générateur`\s sont des outils simples et puissants pour créer des itérateurs. Ils sont écrits comme des fonctions classiques mais utilisent l'instruction :keyword:`yield` lorsqu'ils veulent renvoyer des données. À chaque fois que :func:`next` est appelée, le générateur reprend son exécution là où il s'était arrété (en conservant tout son contexte d'exécution). Un exemple montre très bien combien les générateurs sont simples à créer ::

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`__iter__` and :meth:`~generator.__next__` methods are created automatically.
fr: Tout ce qui peut être fait avec des générateurs peut également être fait avec des itérateurs basés sur des classes, comme décrit dans le paragraphe précédent. Si qui fait que les générateurs sont si compacts est que les méthodes :meth:`__iter__` et :meth:`~generator.__next__` sont créées automatiquement.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
fr: Une autre fonctionnalité clé est que les variables locales ainsi que le contexte d'exécution sont sauvegardés automatiquement entre les appels. Cela simplifie d'autant plus l'écriture de ces fonctions, et rend leur code beaucoup plus lisible qu'avec une approche utilisant des variables d'instance telles que ``self.index`` et ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
fr: En plus de la création automatique de méthodes et de la sauvegarde du contexte d'exécution, les générateurs lèvent automatiquement une exception :exc:`StopIteration` lorsqu'ils terminent leur exécution. Combinées, ces fonctionnalités rendent très simple la création d'itérateurs sans plus d'effort que l'écriture d'une fonction classique.

source: Generator Expressions
fr: Expressions et générateurs

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
fr: Des générateurs simples peuvent être codés très rapidement avec des expressions utilisant la même syntaxe que les compréhensions de listes, mais en utilisant des parenthèses à la place des crochets. Ces expressions sont conçues pour des situations où le générateur est utilisé tout de suite dans une fonction. Ces expressions sont plus compactes mais moins souples que des définitions complètes de générateurs, et ont tendance à être plus économes en mémoire que leur équivalent en compréhension de listes.

source: Examples::
fr: Exemples ::

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`__dict__` which returns the dictionary used to implement the module's namespace; the name :attr:`__dict__` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
fr: Sauf pour une chose. Les modules disposent d'un attribut secret en lecture seule appelé :attr:`__dict__`, qui renvoie le dictionnaire utilisé pour implémenter l'espace de noms du module ; le nom :attr:`__dict__` est un attribut mais pas un nom global. Évidemment, son utilisation brise l'abstraction de l'implémentation des espaces de noms, et ne doit être restreinte qu'à des choses comme des debogueurs post-mortem.

source: More Control Flow Tools
fr: D'autres outils de contrôle de flux

source: Besides the :keyword:`while` statement just introduced, Python knows the usual control flow statements known from other languages, with some twists.
fr: En plus de l'instruction :keyword:`while` qui vient d'être présentée, Python dispose des instructions de contrôle de flux classiques que l'on trouve dans d'autres langages, mais toujours avec ses propres tournures.

source: :keyword:`if` Statements
fr: L'instruction :keyword:`if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
fr: L'instruction :keyword:`if` est sans doute la plus connue. Par exemple ::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`if` ... :keyword:`elif` ... :keyword:`elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
fr: Il peut y avoir un nombre quelconque de parties :keyword:`elif`, et la partie :keyword:`else` est facultative. Le mot clé ':keyword:`elif`' est un raccourci pour 'else if', mais permet de gagner un niveau d'indentation. Une séquence :keyword:`if` ... :keyword:`elif` ... :keyword:`elif` ... est par ailleurs équivalente aux instructions ``switch`` ou ``case`` disponibles dans d'autres langages.

source: :keyword:`for` Statements
fr: L'instruction :keyword:`for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
fr: L'instruction :keyword:`for` que propose Python est un peu différente de celle que l'on peut trouver en C ou en Pascal. Au lieu de toujours itérer sur une suite arithmétique de nombres (comme en Pascal), ou de donner à l'utilisateur la possibilité de définir le pas d'itération et la condition de fin (comme en C), l'instruction :keyword:`for` en Python itère sur les éléments d'une séquence (qui peut être une liste, une chaîne de caractères...), dans l'ordre dans lequel ils apparaissent dans la séquence. Par exemple (sans jeu de mots) :

source: If you need to modify the sequence you are iterating over while inside the loop (for example to duplicate selected items), it is recommended that you first make a copy. Iterating over a sequence does not implicitly make a copy. The slice notation makes this especially convenient::
fr: Si vous devez modifier la séquence sur laquelle s'effectue l'itération à l'intérieur de la boucle (par exemple pour dupliquer ou supprimer un élément), il est plus que recommandé de commencer par en faire une copie, celle-ci n'étant pas implicite. La notation "par tranches" rend cette opération particulièrement simple ::

source: The :func:`range` Function
fr: La fonction :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
fr: Si vous devez itérer sur une suite de nombres, la fonction intégrée :func:`range` est faite pour cela. Elle génère des suites arithmétiques : :

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
fr: Le dernier élément fourni en paramètre ne fait jamais partie de la liste générée ; ``range(10)`` génère une liste de 10 valeurs, dont les valeurs vont de 0 à 9. Il est possible de spécifier une valeur de début et/ou une valeur d'incrément différente(s) (y compris négative pour cette dernière, que l'on appelle également parfois le 'pas') ::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
fr: Pour itérer sur les indices d'une séquence, on peut combiner les fonctions :func:`range` et :func:`len` ::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
fr: Cependant, dans la plupart des cas, il est plus pratique d'utiliser la fonction :func:`enumerate`. Voyez pour cela :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
fr: Une chose étrange se produit lorsqu'on affiche un range : :

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
fr: Les objets données par : func:`range` se comportent presque comme des listes, mais n'en sont pas. Ce sont des objets qui génèrent les éléments de la séquence au fur et à mesure de leur itération, économisant ainsi de l'espace.

source: We say such an object is *iterable*, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such an *iterator*. The function :func:`list` is another; it creates lists from iterables::
fr: On appelle de tels objets des *iterables*, c'est à dire des objets qui conviennent à des *iterateurs*, des fonctions ou constructions qui s'attendent à quelque-chose duquel ils peuvent tirer des éléments, successives successivement, jusqu'à épuisement. On a vu que l'instruction :keyword:`for` est un iterateur. La fonction :func:`list` en est un autre, qui créé des listes à partir d'iterables ::

source: Later we will see more functions that return iterables and take iterables as argument.
fr: Plus loin nous verrons d'autre fonctions qui donnent des iterables ou en prennent en paramètre.

source: :keyword:`break` and :keyword:`continue` Statements, and :keyword:`else` Clauses on Loops
fr: Les instructions :keyword:`break` et :keyword:`continue`, et les clauses :keyword:`else` au sein des boucles

source: The :keyword:`break` statement, like in C, breaks out of the smallest enclosing :keyword:`for` or :keyword:`while` loop.
fr: L'instruction :keyword:`break`, comme en C, interrompt la boucle :keyword:`for` ou :keyword:`while` la plus imbriquée.

source: Loop statements may have an ``else`` clause; it is executed when the loop terminates through exhaustion of the list (with :keyword:`for`) or when the condition becomes false (with :keyword:`while`), but not when the loop is terminated by a :keyword:`break` statement. This is exemplified by the following loop, which searches for prime numbers::
fr: Les boucles peuvent également disposer d'une instruction ``else`` ; celle-ci est exécutée lorsqu'une boucle se termine alors que tous ses éléments ont été traités (dans le cas d'un :keyword:`for`) ou que la condition devient fausse (dans le cas d'un :keyword:`while`), mais pas lorsque la boucle est interrompue par une instruction :keyword:`break`. L'exemple suivant, qui effectue une recherche de nombres premiers, en est une démonstration ::
