Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
fr: Le module :mod:`sys` à aussi des attributs pour *stdin*, *stdout*, et *stderr*. Ce dernier est utile pour émettre des messages d'avertissement ou d'erreur qui restent visibles même si *stdout* est redirigé ::

source: The most direct way to terminate a script is to use ``sys.exit()``.
fr: Le moyen le plus direct de terminer un script est d'utiliser ``sys.exit()``.

source: String Pattern Matching
fr: Recherche de motifs dans les Chaînes

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
fr: Le module :mod:`re` fournit des outils basés sur les expressions rationnelles permettant des opérations complexes sur les chaînes. C'est une solution optimisée, utilisant une syntaxe consise, pour rechercher des motifs complexes, ou effectuer des remplacements complexes dans les chaînes ::

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
fr: Lorsque les opérations sont simples, il est préférable d'utiliser les méthodes des chaînes, elles sont plus lisibles et plus facile à débugger ::

source: Mathematics
fr: Mathématiques

source: The :mod:`math` module gives access to the underlying C library functions for floating point math::
fr: Le module :mod:`math` expose des fonctions d'opération sur les "float* de la bibliothèque C ::

source: The :mod:`random` module provides tools for making random selections::
fr: Le module :mod:`random` offre des outils pour faire des sélections aléatoires ::

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
fr: Le module :mod:`statistics` permet de calculer des valeurs statistiques basiques (la moyenne, la médiane, la variance, ...) ::

source: The SciPy project <http://scipy.org> has many other modules for numerical computations.
fr: Le projet SciPy <http://scipy.org> contient beaucoup d'autres modules autour des calculs numériques.

source: Internet Access
fr: Accès à internet

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
fr: Il existe tout un tat de modules permettant d'accéder à internet et gérer des protocoles utilisés sur internet. Les deux plus simples sont :mod:`urllib.request`, qui permet de télécharger à partir d'une URL, et :mod:`smtplib` pour envoyer des emails ::

source: (Note that the second example needs a mailserver running on localhost.)
fr: (Notez que le deuxième exemple a besoin d'un serveur mail tournant localement.)

source: Dates and Times
fr: Dates et heures

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
fr: Les module :mod:`datetime` propose des classes pour manipuler les dates et les heures, que le besoin soit simple ou compliqué. Bien que faire des calculs de dates est possible, l'implémentation à être optimisée pour l'accès aux propriétés, le formatage et la manipulation. Le module gère aussi les objets conscients des fuseaux horaires ::

source: Data Compression
fr: Compression de donnée

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
fr: Les formats d'archivage et de compression les plus communs sont directement gérés par les modules :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile`, et :mod:`tarfile` ::

source: Performance Measurement
fr: Mesure des Performances

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
fr: Certains utilisateurs de Python développent un intérêt profond des performances de différentes approches d'un même problème. Python propose un outil de mesure répondant simplement à ces questions.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
fr: Par exemple, pour échanger deux variables, il peut être tentant d'utiliser l'empaquetage et le dépaquetage de tuples plutôt que la méthode traditionnelle. Le module :mod:`timeit` montre simplement laquelle est la plus efficace ::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
fr: En opposition à :mod:`timeit` et sa granularité fine, :mod:`profile` et :mod:`pstats` fournissent des outils permettant d'identifier les parties les plus gourmandes en temps d'exécution dans des volumes de code plus grands.

source: Quality Control
fr: Contrôle Qualité

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
fr: Une approche possible pour développer des application de très bonne qualité est d'écrire des tests pour chaque fonction au fur et à mesure de son développement, et d'exécuter ces tests fréquemment lors du processus de développement.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
fr: Le module :mod:`doctest` permet de chercher des tests dans les chaînes de documentation. Un tests ressemble à un simple copié-collé d'un appel et son résultat depuis le mode interactif. Cela améliore la documentation en fournissant des exemples tout en prouvant qu'ils sont justes ::

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
fr: Le module :mod:`unittest` est plus lourd que le module :mod:`doctest`, mais il permet de construire un jeu de tests plus complet, maintenable, et compréhensible dans un fichier séparé ::

source: Batteries Included
fr: Piles Fournies

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
fr: Python respecte la philosophie "piles fournies". C'est plus évident en regardant les capacités sophistiquées et solides de ses plus gros paquets. Par exemple:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules names, no direct knowledge or handling of XML is needed.
fr: Les modules :mod:`xmlrpc.client` et :mod:`xmlrpc.server` permettent d'appeler des fonctions à distance quasiment sans effort. En dépit du nom des modules, aucune connaissance du XML n'est nécessaire.

source: The :mod:`email` package is a library for managing email messages, including MIME and other RFC 2822-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
fr: Le paquet :mod:`email` est une bibliothèque pour gérer les messages electroniques, incluant les MIME et autre encodages basés sur la RFC 2822. Contrairement à :mod:`smtplib` et :mod:`poplib`, qui envoient et reçoivent des messages, le paquet email est une boite à outils pour construire, lire des structures de messages complexes (comprenant des pièces jointes), ou implémenter des encodages et protocoles.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
fr: Le paquet :mod:`json` permet de lire et d'écrire du JSON, format d'encodage de donnée répandu. Le module :mod:`csv` gère la lecture et l'écriture de données stockés sous forme de valeurs séparés par des virgules dans des fichiers (Coma-Separated Values), typique des base de donnée et feuiles de calculs. Pour la lecture du XML, utilisez les paquet :mod:`xml.etree.ElementTree`, :mod:`xml.dom` et :mod:`xml.sax`. Réunis, ces modules et paquets simplifient grandement l'échange de données entre les applications Python et les autres outils.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
fr: Le module :mod:`sqlite3` est une abstraction de la bibliothèque SQLite, permettant de manipuler une base de donnée persistante, accédée et manipulée en utilisant une syntaxe SQL quasi standard.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
fr: L'internationalisation est possible grâce à moulte paquets, comme :mod:`gettext`, :mod:`locale`, ou :mod:`codecs`.

source: Brief Tour of the Standard Library -- Part II
fr: Rapide tour de la Bibliothèque Standard -- Deuxième partie

source: This second tour covers more advanced modules that support professional programming needs. These modules rarely occur in small scripts.
fr: Cette seconde visite vous fera découvrir des modules d'un usage plus professionnel. Ces modules sont rarement nécessaires dans de petits scripts.

source: Output Formatting
fr: Formatage

source: The :mod:`reprlib` module provides a version of :func:`repr` customized for abbreviated displays of large or deeply nested containers::
fr: Le module :mod:`reprlib` est une variante de la fonction :func:`repr`, spécialisée dans l'affichage concis de conteneurs volumineux ou fortement imbriqués ::

source: The :mod:`pprint` module offers more sophisticated control over printing both built-in and user defined objects in a way that is readable by the interpreter. When the result is longer than one line, the "pretty printer" adds line breaks and indentation to more clearly reveal data structure::
fr: Le module :mod:`pprint` propose un contrôle plus fin de l'affichage des objets, aussi bien primitifs que définis par l'utilisateur, et souvent lisible part l'interpréteur. Lorsque le résultat fait plus d'une ligne, il est séparé sur plusieurs lignes et indenté pour rendre la structure plus visible ::

source: The :mod:`textwrap` module formats paragraphs of text to fit a given screen width::
fr: Le module :mod:`textwrap` formatte des paragraphes de texte pour tenir sur un écran d'une largeur donnée ::

source: The :mod:`locale` module accesses a database of culture specific data formats. The grouping attribute of locale's format function provides a direct way of formatting numbers with group separators::
fr: Le module :mod:`locale` offre une base de donnée de formats de donnée spécifique à chaque région. L'attribut ``grouping`` de la fonction de formattage permet de formater directement des nombres avec un séparateur ::

source: Templating
fr: Gabarits (Templates)

source: The :mod:`string` module includes a versatile :class:`~string.Template` class with a simplified syntax suitable for editing by end-users. This allows users to customize their applications without having to alter the application.
fr: Le module :mod:`string` contiens une classe fort polyvalente : :class:`~string.Template` permettant d'écrire des gabarits (dits "templates") avec une syntaxe simple, si simple qu'elle est compréhensible par des non-développeurs. Cela permet donc à vous utilisateurs de personnaliser leur application sans la modifier.

source: The format uses placeholder names formed by ``$`` with valid Python identifiers (alphanumeric characters and underscores). Surrounding the placeholder with braces allows it to be followed by more alphanumeric letters with no intervening spaces. Writing ``$$`` creates a single escaped ``$``::
fr: Le format est constitué de marqueurs formés d'un ``$`` suivi d'un identifiant Python valide (caractères alphanumériques et tirets-bas). Entourer le marqueur d'accolades permet de lui coller d'autres caractères alphanumériques sans intercaler un espace. Écrire ``$$`` créé un simple ``$``.

source: The :meth:`~string.Template.substitute` method raises a :exc:`KeyError` when a placeholder is not supplied in a dictionary or a keyword argument. For mail-merge style applications, user supplied data may be incomplete and the :meth:`~string.Template.safe_substitute` method may be more appropriate --- it will leave placeholders unchanged if data is missing::
fr: La méthode :meth:`~string.Template.substitute` lève une exception :exc:`KeyError` lorsqu'un marqueur n'a pas été fourni, ni dans un dictionnaire, ni sous forme d'un paramètre nommé. Dans certains cas, lorsque la donnée à appliquer n'est connur que partiellement, la méthode :meth:`~string.Template.safe_substitute` est plus appropriée car elle laissera tel quel les marqueurs manquants ::

source: Template subclasses can specify a custom delimiter. For example, a batch renaming utility for a photo browser may elect to use percent signs for placeholders such as the current date, image sequence number, or file format::
fr: Les classes filles de ``Template`` peuvent définir leur propre délimiteur. Typiquement, un script de renommage de photos par lots peut choisir le symbole pourcent comme marqueur pour, par exemple, la date actuelle, le numéro de l'image, ou son format ::

source: Another application for templating is separating program logic from the details of multiple output formats. This makes it possible to substitute custom templates for XML files, plain text reports, and HTML web reports.
fr: Un autre usage des templates est de séparer la logique métier dub côté et les détails spécifiques à chaque format de sortie. Il est possible de générer de cette manière des fichiers XML, texte, HTML, ...

source: Working with Binary Data Record Layouts
fr: Travailler avec des données binaires

source: The :mod:`struct` module provides :func:`~struct.pack` and :func:`~struct.unpack` functions for working with variable length binary record formats. The following example shows how to loop through header information in a ZIP file without using the :mod:`zipfile` module. Pack codes ``"H"`` and ``"I"`` represent two and four byte unsigned numbers respectively. The ``"<"`` indicates that they are standard size and in little-endian byte order::
fr: Le module :mod:`struct` expose les fonctions :func:`~struct.pack` et :func:`~struct.unpack` permettant de travailler avec des données binaires. L'exemple suivant montre comment parcourir une entête de fichier ZIP sans recourir au module :mod:`zipfile`. Les marqueurs ``"H"`` et ``"I"`` représentent des nombres entiers non signés, stockés respectivement sur deux et quatre octets. Le ``"<"`` indique qu'ils ont une taille standard et dans le style petit-boutiste.

source: Multi-threading
fr: Threads

source: Threading is a technique for decoupling tasks which are not sequentially dependent. Threads can be used to improve the responsiveness of applications that accept user input while other tasks run in the background. A related use case is running I/O in parallel with computations in another thread.
fr: Des tâches indépendantes peuvent être exécutées simultanément (on parle de concourrance), en utilisant des threads.Les threads peuvent améliorer la réactivité d'une application qui accepterait d'interagir avec l'utilisateur pendant que d'autres traitements sont exécutés en arrière plan. Un autre usage typique est de séparer sur deux threads distincts les I/O (entrées / sorties) et le calcul.

source: The following code shows how the high level :mod:`threading` module can run tasks in background while the main program continues to run::
fr: Le code suivant donne un exemple d'usage du module :mod:`threading` exécutant des tâches en arrière plan pendant que le programme principal continue de s'exécuter ::

source: The principal challenge of multi-threaded applications is coordinating threads that share data or other resources. To that end, the threading module provides a number of synchronization primitives including locks, events, condition variables, and semaphores.
fr: Le challenge principal des applications multi tâches est la coordination entre les threads qui partagent des données ou des ressources. Pour ce faire, lemodule :mod:`threading` expose quelques outils dédiés à la synchronisation comme les verrous (locks), événement (events), variables conditionnelles (condition variables), et les sémaphores.

source: While those tools are powerful, minor design errors can result in problems that are difficult to reproduce. So, the preferred approach to task coordination is to concentrate all access to a resource in a single thread and then use the :mod:`queue` module to feed that thread with requests from other threads. Applications using :class:`~queue.Queue` objects for inter-thread communication and coordination are easier to design, more readable, and more reliable.
fr: Bien que ces outils soient puissants, des erreurs de conceptions peuvent engendrer des problèmes difficiles à reproduire. Donc, l'approche favorite pour coordonner des tâches est de restreindre l'accès d'une ressource à un seul thread, et d'utiliser le module :mod:`queue` pour alimenter ce thread de requêtes venant d'autres threads. Les applications utilisant des :class:`~queue.Queue` pour leurs communication et coordination entre threads sont plus simples à concevoir, plus lisible, et plus fiables.

source: Logging
fr: Journalisation

source: The :mod:`logging` module offers a full featured and flexible logging system. At its simplest, log messages are sent to a file or to ``sys.stderr``::
fr: Le module :mod:`logging` est un système de journalisation complet. Dans son utilisation la plus élémentaire, les messages sont simplement envoyés dans un fichier ou sur ``sys.stderr`` ::

source: This produces the following output:
fr: Produisant l'affichage suivant :

source: By default, informational and debugging messages are suppressed and the output is sent to standard error. Other output options include routing messages through email, datagrams, sockets, or to an HTTP Server. New filters can select different routing based on message priority: :const:`~logging.DEBUG`, :const:`~logging.INFO`, :const:`~logging.WARNING`, :const:`~logging.ERROR`, and :const:`~logging.CRITICAL`.
fr: Par défaut, les messages d'information et de débogage sont ignorés, les autres écrites sur la sortie standard. Il est aussi possible d'envoyer les messages par email, datagrammes, sur des sockets, ou postés sur un serveur HTTP. Les nouveaux filtres permettent d'utiliser des sorties différentes en fonction de la priorité du message : :const:`~logging.DEBUG`,:const:`~logging.INFO`, :const:`~logging.WARNING`, :const:`~logging.ERROR`, et :const:`~logging.CRITICAL`.

source: The logging system can be configured directly from Python or can be loaded from a user editable configuration file for customized logging without altering the application.
fr: depuis un fichier de configuration, permettant de personnaliser le log sans modifier l'application.

source: Weak References
fr: Références faibles

source: Python does automatic memory management (reference counting for most objects and :term:`garbage collection` to eliminate cycles). The memory is freed shortly after the last reference to it has been eliminated.
fr: Python gère lui même la mémoire (par comptage de référence pour la majorité des objets, et en utilisant un :term:`ramasse-miette`\s (garbage collector) pour éliminer les cycles). La mémoire est libérée rapidement lorsque sa dernière référence est perdue.

source: This approach works fine for most applications but occasionally there is a need to track objects only as long as they are being used by something else. Unfortunately, just tracking them creates a reference that makes them permanent. The :mod:`weakref` module provides tools for tracking objects without creating a reference. When the object is no longer needed, it is automatically removed from a weakref table and a callback is triggered for weakref objects. Typical applications include caching objects that are expensive to create::
fr: Cette approche fonctionne bien pour la majorité des applications, mais, parfois, il est nécessaire de surveiller un objet seulement durant son utilisation par quelque chose d'autre. Malheureusement, le simple fait de le suivre crée une référence, qui rend l'objet permanent. Le module :mod:`weakref` expose des outils pour suivre les objets sans pour autant créer une référence. Lorsqu'un objet n'est pas utilisé, il est automatiquement supprimé du tableau des références faibles, et une fonction de rappel (callback) est appelée. Un exemple typique est le cache d'objets coûteux à créer ::

source: Tools for Working with Lists
fr: Outils pour travailler avec des listes

source: Many data structure needs can be met with the built-in list type. However, sometimes there is a need for alternative implementations with different performance trade-offs.
fr: Beaucoup de structures de données peuvent être représentés avec des listes natives. Cependant, parfois, d'autres besoins émergent, pour des structures ayant des caractéristiques différentes, typiquement en terme de performance.

source: The :mod:`array` module provides an :class:`~array.array()` object that is like a list that stores only homogeneous data and stores it more compactly. The following example shows an array of numbers stored as two byte unsigned binary numbers (typecode ``"H"``) rather than the usual 16 bytes per entry for regular lists of Python int objects::
fr: Le module :mod:`array` fournit un objet :class:`~array.array()`, ne permettant de stocker que des listes homogènes, mais d'une manière plus compacte. L'exemple suivant montre une liste de nombres, stockés chacun sur deux octets non signés (marqueur ``"H"``) plutôt que d'utiliser 16 octets comme l'aurais fait une liste classique ::

source: The :mod:`collections` module provides a :class:`~collections.deque()` object that is like a list with faster appends and pops from the left side but slower lookups in the middle. These objects are well suited for implementing queues and breadth first tree searches::
fr: Le module :mod:`collections` fournit la classe :class:`~collections.deque()`, qui ressemble à une liste, mais plus rapide à insérer ou sortir des éléments par la gauche, et plus lente pour accéder aux éléments du milieu. C'est objets sont particulièrement adaptés pour construire des queues ou des algorithme de parcours d'arbre en largeur ::
