Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
fr: Les *attributs données* correspondent à des "variables d'instance" en Smalltalk, et aux "membres de données" en C++. Les attributs données n'ont pas à être déclarés. Comme les variables locales, ils existent dès lors qu'ils sont attribués une première fois. Par exemple, si ``x`` est l'instance de :class:`MaClasse` créée ci-dessus, le code suivant affiche la valeur ``16 ``, sans laisser de traces ::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
fr: L'autre type de référence à un attribut d'instance est une *méthode*. Une méthode est une fonction qui "appartient à" un objet (en Python, le terme de méthode n'est pas unique aux instances de classes : d'autres types d'objets peuvent aussi avoir des méthodes. Par exemple, les objets listes ont des méthodes appelées append, insert, remove, sort, et ainsi de suite. Toutefois, dans la discussion qui suit, sauf indication contraire, nous allons utiliser le terme de méthode exclusivement en référence à des méthodes d'objets instances de classe).

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
fr: Les noms de méthodes valides d'un objet instance dépendent de sa classe. Par définition, tous les attributs d'une classe qui sont des objets fonction définissent les méthodes correspondantes de ses instances. Donc, dans notre exemple, ``x.f`` est une méthode de référence valide, car ``MaClasse.f`` est une fonction, mais pas ``x.i`` car ``MaClasse.i`` n'en est pas une. Attention cependant, ``x.f`` n'est pas la même chose que ``MaClasse.f`` --- Il s'agit d'un *objet méthode*, pas d'un objet fonction.

source: Method Objects
fr: Les objets méthode

source: Usually, a method is called right after it is bound::
fr: Le plus souvent, une méthode est appelée juste après avoir été liée::

source: In the :class:`MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
fr: Dans l'exemple de la class :class! `MaClass`, cela va retourner la chaîne de caractères ``hello world``. Toutefois, il n'est pas nécessaire d'appeler la méthode directement: ``x.f`` est un objet méthode, il peut être gardé de coté et être appelé plus tard. Par exemple::

source: will continue to print ``hello world`` until the end of time.
fr: va afficher ``hello world`` jusqu'à la fin des temps.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
fr: Que ce passe-t-il exactement quand une méthode est appelée ? Vous avez dû remarquer que ``x.f()`` a été appelée dans le code ci-dessus sans argument, alors que la définition de la méthode :meth: `f` spécifie bien qu'elle prend un argument. Qu'est-il arrivé à l'argument ? Python doit sûrement lever une exception lorsqu'une fonction qui requiert un argument est appelée sans -- même si l'argument n'est pas utilisé...

source: Actually, you may have guessed the answer: the special thing about methods is that the object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's object before the first argument.
fr: En fait, vous aurez peut-être deviné la réponse : la particularité des méthodes est que l'objet est passé comme premier argument de la fonction. Dans notre exemple, l'appel ``x.f ()`` est exactement équivalent à ``MaClasse.f(x)``. En général, appeler une méthode avec une liste d'arguments *n* est équivalent à appeler la fonction correspondante avec cette liste d'arguments modulo l'insertion de l'objet de la méthode avant le premier argument.

source: If you still don't understand how methods work, a look at the implementation can perhaps clarify matters. When an instance attribute is referenced that isn't a data attribute, its class is searched. If the name denotes a valid class attribute that is a function object, a method object is created by packing (pointers to) the instance object and the function object just found together in an abstract object: this is the method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
fr: Si vous ne comprenez toujours pas comment les méthodes fonctionnent, un coup d'œil à l'implémentation vous aidera peut être. Lorsque l'instance d'un attribut est référencé qui n'est pas un attribut donnée, sa classe est recherchée. Si le nom correspond à un attribut valide qui est une fonction, un objet méthode est créé en associant (via leurs pointeurs) l'objet instance et l'objet fonction trouvé ensemble dans un nouvel objet abstrait : c'est l'objet méthode. Lorsque l'objet méthode est appelé avec une liste d'arguments, une nouvelle liste d'arguments est construite à partir de l'objet méthode et de la liste des arguments. L'objet fonction est appelé avec cette nouvelle liste d'arguments.

source: Class and Instance Variables
fr: Classes et variables d'instance

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
fr: En général, les variables d'instance stockent des informations relatives à chaque instance alors que les variables de classe servent à stocker les attributs et méthodes communes à toutes les instances de la classe::

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
fr: Comme vu dans :ref:`tut-object`, les données partagées modifiables (tel que les listes, dictionnaires, etc...) peuvent avoir des effets surprenants. Part exemple, la liste *tricks* dans le code suivant ne devrait pas être une variable de classe, car jiate une seule liste serait partagées par toutes les instances de *Dog*::

source: Correct design of the class should use an instance variable instead::
fr: Une conception correcte de la classe serait d'utiliser une variable d'instance à la place : :

source: Random Remarks
fr: Remarques diverses

source: Data attributes override method attributes with the same name; to avoid accidental name conflicts, which may cause hard-to-find bugs in large programs, it is wise to use some kind of convention that minimizes the chance of conflicts. Possible conventions include capitalizing method names, prefixing data attribute names with a small unique string (perhaps just an underscore), or using verbs for methods and nouns for data attributes.
fr: Les attributs de données surchargent les méthodes avec le même nom ; pour éviter des conflits de nommage, qui peuvent causer des bugs difficiles à trouver dans de grands programmes, il est sage d'adopter certaines conventions qui minimisent les risques de conflits. Les conventions possibles comprennent la mise en majuscule des noms de méthodes, le préfixe des noms d'attributs de données par une chaîne courte et unique (parfois juste la caractère souligné), ou l'utilisation de verbes pour les méthodes et de noms pour les attributs de données.

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
fr: Les attributs de données peuvent être référencés par des méthodes comme par des utilisateurs ordinaires ("clients") d'un objet. En d'autres termes, les classes ne sont pas utilisables pour implémenter des types de données purement abstraits. En fait, rien en Python ne rend possible d'imposer de masquer des données --- tout est basé sur des conventions (d'un autre coté, l'implémentation Python, écrite en C, peut complètement masquer les détails d'implémentation et contrôler l'accès à un objet si nécessaire ; ceci peut être utilisé par des extensions de Python écrites en C).

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
fr: Les clients doivent utiliser les attributs de données avec précaution --- ils pourraient mettre le désordre dans les invariants gérés par les méthodes avec leurs propres valeurs d'attributs. Remarquez que les clients peuvent ajouter leurs propres attributs de données à une instance d'objet sans altérer la validité des méthodes, pour autant que les noms n'entrent pas en conflit --- aussi, adopter une convention de nommage peut éviter bien des problèmes.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
fr: Il n'y a pas de notation abrégée pour référencer des attributs de données (ou d'autres méthodes !) depuis les méthodes. Nous pensons que ceci améliore en fait la lisibilité des méthodes : il n'y a aucune chance de confondre variables locales et variables d'instances quand on regarde le code d'une méthode.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
fr: Souvent, le premier argument d'une méthode est nommé ``self``. Ce n'est qu'une convention : le nom ``self`` n'a aucune signification particulière en Python. Notez cependant que si vous ne suivez pas cette convention, votre code risque d'être moins lisible pour d'autres programmeurs Python, et il est aussi possible qu'un programme qui fasse l'introspection de classes repose sur une telle convention.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
fr: Tout objet fonction qui est un attribut de classe définit une méthode pour des instances de cette classe. Il n'est pas nécessaire que le texte de définition de la fonction soit dans la définition de la classe : il est possible d'affecter un objet fonction à une variable locale de la classe. Par exemple ::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`C` that refer to function objects, and consequently they are all methods of instances of :class:`C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
fr: Maintenant, ``f``, ``g`` et ``h`` sont tous des attributs des classes :class:`C` faisant référence aux fonctions objets, et par conséquent sont toutes des méthodes des instances de :class:`C` --- ``h`` est exactement identique à ``g``. Remarquez qu'en pratique, ceci ne sert qu'à embrouiller le lecteur d'un programme.

source: Methods may call other methods by using method attributes of the ``self`` argument::
fr: Les méthodes peuvent appeler d'autres méthodes en utilisant des méthodes qui sont des attributs de l'argument ``self`` ::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
fr: Les méthodes peuvent faire référence à des noms globaux de la même manière que les fonctions. La portée globale associée à une méthode est le module contenant la définition de la classe (la classe elle même n'est jamais utilisée en tant que portée globale). Alors qu'on rencontre rarement une bonne raison d'utiliser des données globales dans une méthode, il y a de nombreuses utilisations légitimes d'une portée globale : par exemple, les fonctions et modules importés dans une portée globale peuvent être utilisés par des méthodes, de même que les fonctions et classes définies dans cette même portée. Habituellement, la classe contenant la méthode est elle même définie dans cette portée globale, et dans la section suivante, nous verrons de bonnes raisons pour qu'une méthode référence sa propre classe.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
fr: Toute valeur est un objet, et a donc une *classe* (appelé aussi son *type*). Elle est stockée dans ``objet.__class__``.

source: Inheritance
fr: L'héritage

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
fr: Bien sûr, ce terme de «classe» ne serait pas utilisé s'il n'y avait pas l'héritage. La syntaxe pour définir une sous-classe ressemble à ceci ::

source: The name :class:`BaseClassName` must be defined in a scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
fr: Le nom :class:`ClasseDeBase` doit être défini dans un espace contenant la définition de la classe dérivée. A la place du nom d'une classe de base, une expression est aussi autorisée. Ceci peut être utile, par exemple, lorsque la classe est définie dans un autre module ::

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
fr: L'exécution d'une définition de classe dérivée se déroule comme pour une classe de base. Quand l'objet de la classe est construit, la classe de base est mémorisée. Elle est utilisée pour la résolution des références d'attributs : si un attribut n'est pas trouvé dans la classe, la recherche procède en regardant dans la classe de base. Cette règle est appliquée récursivement si la classe de base est elle-même dérivée d'une autre classe.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
fr: Il n'y a rien de particulier dans l'instantiation des classes dérivées : ``DerivedClassName()`` crée une nouvelle instance de la classe. Les références aux méthodes sont résolues comme suit : l'attribut correspondant de la classe est recherché, en remontant la hiérarchie des classes de base si nécessaire, et la référence de méthode est valide si cela conduit à une fonction.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
fr: Les classes dérivées peuvent surcharger des méthodes de leurs classes de base. Comme les méthodes n'ont aucun privilège particulier quand elles appellent d'autres méthodes d'un même objet, une méthode d'une classe de base qui appelle une autre méthode définie dans la même classe peut en fait appeler une méthode d'une classe dérivée qui la surcharge (pour les programmeurs C++ : toutes les méthodes de Python sont en effet ``virtual``).

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
fr: Une méthode surchargée dans une classe dérivée peut en fait vouloir étendre plutôt que simplement remplacer la méthode du même nom de sa classe de base. Il y a une façon simple d'appeler la méthode de la classe de base directement : appelez simplement ``BaseClassName.methodname(self, arguments)``. Ceci est parfois utile également aux clients (notez bien que ceci ne fonctionne que si la classe de base est accessible en tant que ``ClasseDeBase`` dans la portée globale).

source: Python has two built-in functions that work with inheritance:
fr: Python a deux fonctions primitives qui gèrent l'héritage :

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
fr: Utilisez :func:`isinstance` pour tester le type d'une instance : ``isinstance(obj, int)`` renverra ``True`` seulement si ``obj.__class__`` est égal à :class:`int` ou à une autre classe dérivée de :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
fr: Utilisez :func:`issubclass` pour tester l'héritage d'une class : ``issubclass(bool, int)`` renvoie ``True`` car la class :class:`bool` est une sous-classe de :class:`int`. Par contre, ``issubclass(float, int)`` renvoie ``False`` car :class:`float` n'est pas une sous-classe de :class:`int`.

source: Multiple Inheritance
fr: L'héritage multiple

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
fr: Python gère également une forme d'héritage multiple. Une définition de classe ayant plusieurs classes de base ressemble à ::

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`DerivedClassName`, it is searched for in :class:`Base1`, then (recursively) in the base classes of :class:`Base1`, and if it was not found there, it was searched for in :class:`Base2`, and so on.
fr: Dans la plupart des cas, vous pouvez imaginer la recherche d'attributs dans les classes parentes comme étant : le plus profond d'abord, de gauche à droite, sans chercher deux fois dans la même classe si elle apparaît plusieurs fois dans la hiérarchie. Ainsi, si un attribut n'est pas trouvé dans :class:`DerivedClassName`, il est recherché dans :class:`Base1`, puis (récursivement) dans les classes de base de :class:`Base1` ; s'il n'y est pas trouvé, il est recherché dans :class:`Base2` et ses classes de base, et ainsi de suite.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
fr: Dans les faits, c'est un peu plus complexe que ça, l'ordre de la recherche (method resolution order, ou MRO) change dynamiquement pour gérer des appels coopératifs à :func:`super`. Cette approche est connue sous le nom de la "méthode la plus proche" ("call-next-method") dans d'autres langages supportant l'héritage multiple, et est plus puissante que l'appel à super trouve dans les langages à héritage simple.
