Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
fr: Il existe deux circonstances pour lesquelles Python ne vérifie pas le cache : Le premier cas lorsque le module est donné par la ligne de commande (cas où le module est toujours recompilé, sans même cacher sa version compilée), le second cas est lorsque le module n'a pas de source dans ce cas Python n'essaye pas de charger la version compilée. Pour gérer un module sans source (seulement compilé) le module compilé doit être dans le dossier source et sa source ne doit pas être présente.

source: Some tips for experts:
fr: Astuces pour les experts :

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
fr: Vous pouvez utiliser les options :option:`-O` ou :option:`-OO` lors de l'appel à Python pour réduire la taille des modules compilés. L'option ``-O`` supprime les instructions ``assert``, et l'option ``-OO`` supprime aussi les documentations ``__doc__``. Cependant, puisque certains programmes ont besoin de ces ``__doc__``, vous ne devriez utiliser ``-OO`` que si vous savez ce que vous faites. Les modules "optimisés" sont marqués d'un ``opt-`` et sont généralement plus petits. Les versions futures de Python pourraient changer les effets de l'optimisation.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
fr: Un programme ne s'exécute pas plus vite lorsqu'il est lu depuis un ``.pyc``, il est cependant chargé plus vite puisque le ``.pyc`` est plut petit que le ``.py``.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
fr: Le module :mod:`compileall` peut créer des fichiers ``.pyc`` pour tous les modules d'un dossier.

source: There is more detail on this process, including a flow chart of the decisions, in PEP 3147.
fr: Voilà plus de détails sur le processus, ainsi qu'un organigramme des decisions, dans la PEP 3147.

source: Standard Modules
fr: Modules standards

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
fr: Python est accompagné d'une bibliothèque de modules standards, décrits dans la documentation de la Bibliothèque Python, plus loin. Certains modules sont intégrés dans l'interpréteur, ils exposent des outils qui ne font pas partie du langage, mais qui font tout de même partie de l'interpréteur, soit pour le côté pratique, soit pour exposer des outils essentiels tels que l'accès aux appels systems. La composition de ces modules est configurable à la compilation, et dépend aussi de la plateforme ciblée. Par exemple, le module :mod:`winreg` n'est proposé que sur les systèmes Windows. Un module mérite une attention particulière, le module :mod:`sys`, qui est présent dans tous les interpréteurs Python. Les variables ``sys.ps1`` et ``sys.ps2`` définissent les chaînes d'invites principales et secondaires ::

source: These two variables are only defined if the interpreter is in interactive mode.
fr: Ces deux variables ne sont définies que si l'interpréteur est en mode interactif.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
fr: La variable ``sys.path`` est une liste de chaînes qui détermine les chemins de recherche de modules pour l'interpréteur. Il est initialisé à un chemin par défaut pris de la variable d'environnement :envvar:`PYTHONPATH`, ou d'une valeur par défaut interne si :envvar:`PYTHONPATH` n'est pas définie. ``sys.path`` est modifiable en utilisant les opérations habituelles des listes ::

source: The :func:`dir` Function
fr: La fonction :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
fr: La fonction interne :func:`dir` est utilisée pour trouver quels noms sont définies par un module. Elle donne une liste triée de chaînes :;

source: Without arguments, :func:`dir` lists the names you have defined currently::
fr: Sans paramètres, :func:`dir` listes les noms actuellement définis ::

source: Note that it lists all types of names: variables, modules, functions, etc.
fr: Notez qu'elle liste tout types de noms : les variables, fonctions, modules, etc.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
fr: :func:`dir` ne liste ni les fonctions primitives ni les variables internes. Si vous voulez les lister, ils sont définis dans le module :mod:`builtins` ::

source: Packages
fr: Les paquets

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or the Python Imaging Library from having to worry about each other's module names.
fr: Les paquets sont un moyen de structurer les espaces de noms des modules Python en utilisant une notations "pointée". Par exemple, le nom de module :mod:`A.B` désigne le sous-module ``B`` du paquet ``A``. De la même manière que l'utilisation des modules évite aux auteurs de différents modules d'avoir à se soucier des noms de variables globales des autres, l'utilisation des noms de modules avec des points évite aux auteurs de paquets contenant plusieurs modules tel que NumPy ou "Python Image Library" d'avoir à se soucier des noms des modules des autres.

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
fr: Imaginez que vous voulez constuire une collections de modules (un "paquet") pour gérer uniformément les fichiers contenant du son et des données sonores. Il existe un grand nombre de formats de fichiers pour stocker du son (généralement repérés par leur extension, par exemple :file:`.wav`, :file:`.aiff`, :file:`.au`), vous aurez donc envie de créer et maintenir un nombre croissant de modules pour gérer la conversion entre tous ces formats. Il existe aussi tout une floppée d'opérations que vous voudriez pouvoir faire sur du son (mixer, ajouter de l'écho, égaliser, ajouter un effet stéréo articifiel), donc, en plus des modules de conversion, vous allez écrire un nombre illimité de modules permettant d'effectuer ces opérations. Voici une structure possible pour votre paquet (exprimée comme un système de fichier, hierarchiquement) :

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
fr: Lorsqu'il importe des paquets, Python cherche dans chaque dossiers de ``sys.path``, à la recherche du dossier du paquet.

source: The :file:`__init__.py` files are required to make Python treat the directories as containing packages; this is done to prevent directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
fr: Les fichiers :file:`__init__.py` sont nécessaires pour que Python considère les dossiers comme contenant des paquets, ça évite des dossiers ayant des noms courants comme ``string`` de cacher des modules qui auraient été trouvés plus loin dans les dossiers de recherche. Dans le plus simple des cas, :file:`__init__.py` peut être vide, mais il peut exécuter du code d'initialisation pour son paquet ou configurer la variable ``__all__`` (documentée plus loin).

source: Users of the package can import individual modules from the package, for example::
fr: Les utilisateurs d'un module peuvent importer ses modules individuellement, par exemple ::

source: This loads the submodule :mod:`sound.effects.echo`. It must be referenced with its full name. ::
fr: Chargera le sous-module :mod:`sound.effects.echo`. Il dit être référencé par son nom complet. ::

source: An alternative way of importing the submodule is::
fr: Une autre manière d'importer des sous-modules est ::

source: This also loads the submodule :mod:`echo`, and makes it available without its package prefix, so it can be used as follows::
fr: Chargera aussi le sous-module :mod:`echo`, et le rendra disponible dans le préfixe du paquet, il peut donc être utilisé comme ça ::

source: Yet another variation is to import the desired function or variable directly::
fr: Une autre méthode consisterait à importer la fonction ou variable désirée directement ::

source: Again, this loads the submodule :mod:`echo`, but this makes its function :func:`echofilter` directly available::
fr: Le sous-module :mod:`echo` est toujours chargé, mais ici la fonction :func:`echofilter` est disponible directement ::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
fr: Notez que lorsque vous utilisez ``from package import item``, ``item`` peut aussi bien être un sous-module, un sous-paquet, ou simplement un nom déclaré dans le paquet (une variable, une fonction ou une classe). L'instruction ``import`` cherche en premier si ``item`` est définit dans le paquet, s'il ne l'est pas, elle cherche à charger un module, et si elle n'y arrive pas, une exception `ImportError` est levée.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
fr: Au contraire, en utilisant la syntaxe ``import item.item.subitement.subsubitem``, chaque ``item`` sauf le dernier doivent être des paquets. Le dernier ``item`` peut être un module ou un paquet, mais ne peut être ni une fonction, ni une classe, ni une variable défini dans l'élément précédent.

source: Importing \* From a Package
fr: Importer \* depuis un paquet

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
fr: Qu'arrive-il lorsqu'un utilisateur écrit ``from sound.effects import *`` ? Dans l'idéal on pourrait espérer que ça irait chercher tous les sous-modules du paquet sur le système de fichiers, et qu'ils seraient tous importés. Ça pourrait être long, et importer certains sous-modules pourrait avoir des effets secondaires indésirables, du moins, désirés seulement lorsque le sous module est importé explicitement.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
fr: La seule solution, pour l'auteur du paquet, est de fournir un index explicite du contenu du paquet. L'instruction :keyword:`import` utilise la convention suivante: Si le fichier :file:`__init__.py` du paquet définit une liste nommée ``__all__`, cette liste sera utilisée comme liste des noms de modules devant être importés lorsque ``from package import *`` est utilisé. C'est le rôle de l'auteur du paquet de maintenir cette liste à jour lorsque de nouvelles version du paquet sont publiées. Un auteur de paquet peut aussi décider de ne pas autoriser d'importer ``*`` de leur paquet. Par exemple, le fichier :file:`sound/effects/__init__.py` peut contenir le code suivant ::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`sound` package.
fr: Cela signifierai que ``from sound.effects import *`` importait les trois sous-modules du paquet :mod:`sound`.

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`sound.effects` into the current namespace; it only ensures that the package :mod:`sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
fr: Si ``__all__`` n'est pas défini, l'instruction ``from sound.effects import *`` n'importera *pas* tous les sous-modules du paquet :mod:`sound.effects` dans l'espace de nom courant, mais s'assurera seulement que le paquet :mod:`sound.effects` à été importé (que tout le code du fichier :file:`__init__.py` à été executé) et importe ensuite n'importe quels noms définis dans le paquet. Cela inclu tous les noms définis (et sous modules chargés explicitement) par :file:`__init__.py`. Elle inclu aussi tous les sous-modules du paquet ayant été chargés explicitement par une instruction :keyword:`import`. Typiquement ::

source: In this example, the :mod:`echo` and :mod:`surround` modules are imported in the current namespace because they are defined in the :mod:`sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
fr: Dans cet exemple, les modules :mod:`echo` et :mod:`surround` sont importés dans l'espace de noms courant lorsque ``from...import`` est exécuté, parce qu'ils sont définis dans le paquet :mod:`sound.effects`. (Cela fonctionne lorsque ``__all__`` est défini.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practise in production code.
fr: Bien que certains modules ont été pensés pour n'exporter que les noms respectant une certaine structure lorsque ``import *`` est utilisé, ``import *`` reste considéré comme une mauvaise pratique.

source: Remember, there is nothing wrong with using ``from Package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
fr: Rappelez-vous qu'il n'y a rien de mauvais à utiliser ``from Package import specific_submodule`` ! C'est d'ailleurs la manière recommandée à moins que le module qui fait les imports ai besoin de sous-modules ayant le même nom mais provenant se paquets différents.

source: Intra-package References
fr: Références internes dans un paquet

source: When packages are structured into subpackages (as with the :mod:`sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`sound.filters.vocoder` needs to use the :mod:`echo` module in the :mod:`sound.effects` package, it can use ``from sound.effects import echo``.
fr: Lorsque les paquets sont organisés en sous-paquets (comme le paquet :mod:`sound` par exemple), vous pouvez utiliser des imports absolus pour cibler des paquets voisins. Par exemple, si le module :mod:`sound.filters.vocoder` a besoin du module :mod:`echo` du paquet :mod:`sound.effects`, il peut utiliser ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`surround` module for example, you might use::
fr: Il est aussi possible d'écrire des imports relatifs de la forme ``from module import name``. Ces imports sont préfixés par des points pour indiquer leur origine (paquet courant ou parent). Depuis le module :mod:`surround`, par exemple vous pourriez faire ::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
fr: Notez que les imports relatifs se fient au nom du module actuel. Puisque le nom du module principal est toujours ``"__main__"``, les modules utilisés par le module principal d'une application ne peuvent être importées que par des imports absolus.

source: Packages in Multiple Directories
fr: Paquets dans plusieurs dossiers

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
fr: Les paquets exposent un attribut supplémentaire, :attr:`__path__`, contenant une liste, initialisée avant l'exécution du fichier :file:`__init__.py`, contenant le nom de son dossier dans le système de fichier. Cette liste peut être modifiée, altérant ainsi les futures recherches de modules et sous-paquets contenus dans le paquet.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
fr: Bien que cette fonctionnalité ne soit que rarement utile, elle peut servir à élargir la liste des modules trouvés dans un paquet.

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition enters the function name in the module's global symbol table.
fr: En réalité, la déclaration d'une fonction est elle même une instruction, sont l'exécution enregistre le nom de la fonction dans la table des symboles globaux du module.

source: Brief Tour of the Standard Library
fr: Survol de la Bibliothèque Standard

source: Operating System Interface
fr: Interface avec le Système d'Exploitation

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
fr: Le modules :mod:`os` propose pléthore fonctions pour interagir avec le système d'exploitation ::

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
fr: Mais, encore une fois, préférez ``import os``, à ``from os import *``, sans quoi :func:`os.open` cacherait la primitive :func:`open`, qui fonctionne différemment.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
fr: Les primitives :func:`dir` et :func:`help` sont des outils utiles lorsque vous travaillez en mode interactif avez des gros modules comme :mod:`os` ::

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
fr: Pour la gestion des fichiers et dossiers, le module :mod:`shutil` expose une interface plus abstraite et plus facile à utiliser ::

source: File Wildcards
fr: Jokers sur les noms de Fichiers

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
fr: Le module :mod:`glob` fournit une fonction pour construire des listes de fichiers à partir de motifs ::

source: Command Line Arguments
fr: Paramètres en ligne de Commande

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance the following output results from running ``python demo.py one two three`` at the command line::
fr: Typiquement, les outils en ligne de commande ont besoin de lire les paramètres qui leur sont donnés. Ces paramètres sont stockés dans la variable ``argv`` dans le module :mod:`sys`sous forme de liste. Par exemple, l'affichage suivant vient de l'exécution de ``python demo.py one two three`` depuis la ligne de commande ::

source: The :mod:`getopt` module processes *sys.argv* using the conventions of the Unix :func:`getopt` function. More powerful and flexible command line processing is provided by the :mod:`argparse` module.
fr: Le module :mod:`getopt`comprend *sys.argv* en utilisant les conventions habituelles de la fonction Unix :func:`getopt`. Des outils de compréhension des paramètres de la ligne de commande plus flexibles et avancés sont disponibles dnas le module :mod:`argparse`.

source: Error Output Redirection and Program Termination
fr: Redirection de la sortie d'erreur et fin d'exécution
