Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support readline. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
fr: Les fonctionnalités d'édition de l'interpréteur comprennent l'édition interactive, la substitution depuis l'historique, et la complétion, sur les systèmes qui gèrent readline. Le moyen le plus rapide de tester si l'édition de la ligne decommande est gérée est peut-être de taper :kbd:`Control-P` suite au premier invite de commande que vous rencontrez. Si cela bip, vous disposez de l'édition de la ligne de commande; voyez l'appendice :ref:`tut-interacting` pour une introduction aux touches. Si rien ne semble se produire ou si ``^P`` s'affiche, l'édition de la ligne de commande n'est pas disponible; vous serez seulement en mesure d'utiliser la touche retour arrière pour supprimer des caractères de la ligne courante.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
fr: L'interpréteur opère de façon similaire au shell Unix : lorsqu'il est appelé avec l'entrée standard connectée à un périphérique tty, il lit et exécute les commandes de façon interactive; lorsqu'il est appelé avec un nom de fichier en argument ou avec un fichier comme entrée standard, il lit et exécute un *script* depuis ce fichier.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety with single quotes.
fr: Une autre façon de lancer l'interpréteur est ``python -c commande [arg] ...``. Cela exécute les instructions de *commande* de façon analogue à l'option :option:`-c` du shell. Parce que les instructions Python contiennent souvent des espaces et d'autres caractères spéciaux pour le shell, il est généralement conseillé de mettre *commande* entre guillemets simples.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
fr: Certains modules Python sont aussi utiles en tant que scripts. Ils peuvent être appelé avec ``python -m module [arg] ...`` qui exécute le fichier source de *module* comme si vous aviez tapé son nom complet dans la ligne de commande.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
fr: Quand un fichier de script est utilisé, il est parfois utile de pouvoir lancer le script puis d'entrer dans le mode interactif après coup. Cela est possible en passant :option:`-i` avant le script.

source: All command line options are described in :ref:`using-on-general`.
fr: Tous les paramètres utilisables en ligne de commande sont documentés dans :ref:`using-on-general`.

source: Argument Passing
fr: Passage d'arguments

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
fr: Lorsqu'ils sont connus de l'interpréteur, le nom du script et les arguments additionnels sont représentés sous forme d'une liste assignée à la variable ``argv`` du module ``sys``. Vous pouvez y accéder en exécutant ``import sys``. La liste contient au minimum un élément; quand aucun script ni aucun arguments ne sont donnés, ``sys.argv[0]`` est une chaine vide. Quand ``'-'`` (qui représente l'entrée standard) est passé comme nom de script, ``sys.argv[0]`` contient ``'-'``. Quand :option:`-c` *commande* est utilisé, ``sys.argv[0]`` contient ``'-c'``. Enfin, quand :option:`-m` *module* est utilisé, le nom complet du module est assigné à ``sys.argv[0]``. Les options trouvées après :option:`-c` *commande* ou :option:`-m` *module* ne sont pas lues comme options de l'interpréteur Python mais laissées dans ``sys.argv`` pour être utilisée par le module ou la commande.

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt::
fr: Lorsque les commandes sont lues depuis un tty, l'interpréteur est dit *en mode interactif*. Dans ce mode, il attend la prochaine commande en affichant *l'invite de commande primaire*, généralement trois "signes supérieur à" (``>>>``); pour demander une ligne de continuation, l'interpréteur affiche *l'invite de commande secondaire*, par défaut trois points (``...``). L'interpréteur affiche un message de bienvenue indiquant son numéro de version et une mention de *copyright* avant d'afficher le premier invite de commande ::

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
fr: Les lignes de continuation sont nécessaires pour entrer une construction multi-lignes. Par exemple, regardez cette instruction :keyword:`if` ::

source: For more on interactive mode, see :ref:`tut-interac`.
fr: Pour plus d'informations sur le mode interactif, voir :ref:`tut-interac`.

source: The Interpreter and Its Environment
fr: L'interpréteur et son environnement

source: Source Code Encoding
fr: Encodage du code source

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
fr: Par défaut Python considère que ses fichiers source sont encodés en UTF-8. Dans cet encodage, les caractères de la plupart des langues peuvent être utilisés ensemble dans les chaînes de caractères, identifiants, et commentaires, bien que la bibliothèque standard n'utilise que des caractères ASCII dans ses identifiants, une bonne habitude que tout code portable devrait suivre. Pour afficher correctement tous ces caractères, votre éditeur doit reconnaître que le fichier est en UTF-8, et utiliser une fonte de caractère qui comprend tous les caractères utilisés dans le fichier.

source: It is also possible to specify a different encoding for source files. In order to do this, put one more special comment line right after the ``#!`` line to define the source file encoding::
fr: Il est possible d'utiliser un autre encodage dans un fichier source Python. La meilleure façon de faire est de placer un commentaire spécial supplémentaire juste après le ``#!`` pour définir l'encodage du fichier source::

source: With that declaration, everything in the source file will be treated as having the encoding *encoding* instead of UTF-8. The list of possible encodings can be found in the Python Library Reference, in the section on :mod:`codecs`.
fr: Avec cette déclaration, tous les caractères du fichier source sont traités comme étant dans l'encodage *encoding* au lieu d'UTF-8. La liste des encodages disponibles peut être trouvée dans la référence de la bibliothèque Python dans la partie à propos de :mod:`codecs`.

source: For example, if your editor of choice does not support UTF-8 encoded files and insists on using some other encoding, say Windows-1252, you can write::
fr: Par exemple, si votre éditeur de gère pas l'UTF-8 et insiste pour utiliser un autre encodage, disons Windows-1252, vous pouvez écrire ::

source: and still use all characters in the Windows-1252 character set in the source files. The special encoding comment must be in the *first or second* line within the file.
fr: et continuer d'utiliser tous les caractères de Windows-1252 dans votre code. Ce commentaire spécial spécifiant l'encodage doit être à *la première ou deuxième* ligne du fichier.

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
fr: Sur Unix, l'interpréteur Python 3.x n'est pas, par défaut, installé sous le nom de ``python`` pour ne pas entrer en conflit avec une éventuelle installation de Python 2.x.

source: An Informal Introduction to Python
fr: Introduction informelle à Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
fr: Dans les exemples qui suivent, les entrées et sorties se distinguent par la présence ou l'absence d'invite (``>>>`` et ``...``) : pour reproduire les exemples, vous devez taper tout ce qui est après l'invite, au moment où celle-ci apparaît ; les lignes qui n'affichent pas d'invite sont les sorties de l'interpréteur. Notez qu'une invite secondaire affichée seule sur une ligne dans un exemple indique que vous devez entrer une ligne vide ; ceci est utilisé pour terminer une commande multi-lignes.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
fr: Beaucoup d'exemples de ce manuel, même ceux saisis à l'invite de l'interpréteur, incluent des commentaires. Les commentaires en Python commencent avec un caractère dièse, ``#``, et s'étendent jusqu'à la fin de la ligne. Un commentaire peut apparaître au début d'une ligne ou à la suite d'un espace ou de code, mais pas à l'intérieur d'une chaîne de caractères littérale. Un caractère dièse à l'intérieur d'une chaîne de caractères est juste un caractère dièse. Comme les commentaires ne servent qu'à expliquer le code et ne sont pas interprétés par Python, ils peuvent être ignorés lorsque vous tapez les exemples.

source: Using Python as a Calculator
fr: Utiliser Python comme une calculatrice

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
fr: Essayons quelques commandes Python simples. Démarrez l'interpréteur et attendez l'invite primaire, ``>>>``. Ça ne devrait pas être long.

source: Numbers
fr: Les nombres

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` work just like in most other languages (for example, Pascal or C); parentheses (``()``) can be used for grouping. For example::
fr: L'interpréteur agit comme une simple calculatrice : vous pouvez lui entrer une expression et il vous affiche la valeur. La syntaxe des expressions est simple : les opérateurs ``+``, ``-``, ``*`` et ``/`` fonctionnent comme dans la plupart des langages (par exemple, Pascal ou C) ; les parenthèses peuvent être utilisées pour faire des regroupements. Par exemple ::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
fr: Les nombre entiers (comme ``2``, ``4``, ``20``) sont de type :class:`int`, alors que les décimaux (comme ``5.0``, ``1.6``) sont de type :class:`float`. Plus de détails sont données sur les types numériques plus loin dans ce tutoriel.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result (discarding any fractional result) you can use the ``//`` operator; to calculate the remainder you can use ``%``::
fr: Les divisions (``/``) donnent toujours des :class:`float`. Utilisez l'opérateur ``//`` pour effectuer des divisions entières, et donc obtenir un résultat entier. Pour obtenir le reste de cette division entière, utilisez l'opérateur ``%`` ::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
fr: Avec Python il est possible de calculer des puissances avec l'opérateur ``**`` [#]_ ::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
fr: Le signe égal (``=``) est utilisé pour affecter une valeur à une variable. Après cela, aucun résultat n'est affiché avant l'invite suivante ::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
fr: Si une variable n'est pas "définie" (si aucune valeur ne lui a été affecté), l'utiliser engendrera une erreur ::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
fr: Il y a un support complet des nombres à virgule flottante ; les opérateurs avec des types d'opérandes mélangés convertissent l'opérande entier en virgule flottante ::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
fr: En mode interactif, la dernière expression affichée est affectée à la variable ``_``. Ce qui signifie que lorsque vous utilisez Python comme calculatrice, il est parfois plus simple de continuer des calculs, par exemple ::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
fr: Cette variable doit être considérée comme une variable en lecture seule par l'utilisateur. Ne lui affectez pas de valeur explicitement --- vous créeriez ainsi une variable locale indépendante avec le même nom qui masquerait la variable native et son fonctionnement magique.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
fr: En plus des :class:`int` et des :class:`float`, il existe les :class:`~decimal.Decimal` et les :class:`~fractions.Fraction`. Python gère aussi les :ref:`nombre complexes <typesnumeric>`, en utilisant le suffixe ``j`` ou ``J`` pour indiquer la partie imaginaire (tel que: ``3+5j``).

source: Strings
fr: Les chaînes de caractères

source: Besides numbers, Python can also manipulate strings, which can be expressed in several ways. They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_. ``\`` can be used to escape quotes::
fr: Au delà des nombres, Python peut aussi manipuler des chaînes de caractères, qui peuvent être exprimés de différentes manières. Elles peuvent être écrites entre guillemets simples (``'...'``) ou entre guillemets (``"..."``) sans distinction [#]_. ``\`` peut être utilisé pour protéger un guillemet ::

source: In the interactive interpreter, the output string is enclosed in quotes and special characters are escaped with backslashes. While this might sometimes look different from the input (the enclosing quotes could change), the two strings are equivalent. The string is enclosed in double quotes if the string contains a single quote and no double quotes, otherwise it is enclosed in single quotes. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
fr: En mode interactif, l'interpréteur affiche les chaînes de caractères entre guillemets et en protégant les guillemets et autres caractères spéciaux avec des antislash. Bien que cela puisse paraître différent de ce qui a été donné (les guillemets peuvent changer) La chaîne est affichée entre guillemets si elle contient un guillemet simple mais aucun guillemet, sinon elle est affichée entreguillemets simples. La fonction :func:`print` affiche les chaînes de manière plus lisible, en retirant les guillemets et en affichant les caractères spéciaux qui étaient protégées par un antislash ::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
fr: Pour éviter que les caractères précédées d'un ``\`` ne soient interprétés comme étant spéciaux, utilisez les *chaînes brutes* (*raw strings*) en préfixant la chaîne d'un ``r`` ::

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
fr: Les chaînes de caractères peuvent s'étendre sur plusieurs lignes. On peut utiliser les triples guillemets, simples ou doubles: ``'''...'''`` ou ``"""..."""``. Les retours à la ligne sont automatiquement inclus, mais on peut l'en empêcher en ajoutant ``\`` à la fin de la ligne. L'exemple suivant ::

source: produces the following output (note that the initial newline is not included):
fr: produit l'affichage suivant (notez que le premier retour à la ligne n'est pas inclus) :

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
fr: Les chaines peuvent être concaténées (collées ensemble) avec l'opérateur ``+``, et répétées avec l'opérateur ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
fr: Plusieurs chaînes de caractères, écrites littéralement (c'est à dire entre guillemets), côte à côte, sont automatiquement concaténées. ::

source: This only works with two literals though, not with variables or expressions::
fr: Cela ne fonctionne cependant qu'avec les chaînes littérales, pas les variables ni les expressions ::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
fr: Pour concaténer des variables, ou des variables avec des chaînes littérales, utilisez l'opérateur ``+``::

source: This feature is particularly useful when you want to break long strings::
fr: Cette fonctionnalité est surtout intéressante pour couper des chaînes trop longues ::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
fr: Les chaînes de caractères peuvent être indexées (accéder aux caractères par leur position), le premiercaractère d'une chaîne est à la position 0. Il n'existe pas de type distinct pour les caractères, un caractère est simplement une chaîne de longueur 1 ::

source: Indices may also be negative numbers, to start counting from the right::
fr: Les indices peuvent également être négatifs, pour effectuer un décompte en partant de la droite. Par exemple ::

source: Note that since -0 is the same as 0, negative indices start from -1.
fr: Notez que puisque -0 égal 0, les indices négatifs commencent par -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain substring::
fr: En plus d'accéder à un élément par son indice, il est aussi possible de *trancher* une liste. Accéder à une chaîne par un indice permet d'obtenir un caractère, alors que la *trancher* permet d'obtenir une sous-chaïne ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
fr: Notez que le début est toujours inclus et la fin toujours exclue. Cela assure que ``s[:i] + s[i:]`` est toujours égal à ``s`` ::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
fr: Les indices par tranches ont des valeurs par défaut utiles ; le premier indice lorsqu'il est omis équivaut à zéro, le second à la taille de la chaîne de caractères ::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
fr: Une façon de mémoriser la façon dont les tranches fonctionnent est de penser que les indices pointent *entre* les caractères, le côté gauche du premier caractère ayant la position 0. Le côté droit du dernier caractère d'une chaîne de *n* caractères a alors pour indice *n*, par exemple ::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
fr: La première ligne de nombres donne la position des indices 0...6 dans la chaîne ; la deuxième ligne donne l'indice négatif correspondant. La tranche de *i* à *j* est constituée de tous les caractères situés entre les bords libellés *i* et *j*, respectivement.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
fr: Pour des indices non négatifs, la longueur d'une tranche est la différence entre ces indices, si les deux sont entre les bornes. Par exemple, la longue de ``word[1:3]`` est 2.
