Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
fr: Un problème spécifique est la construction de tuples ne contenant aucun ou un seul élément : la syntaxe a quelques tournures spécifiques pour s'en accomoder. Les tuples vides sont construits par une paire de parenthèses vides ; un tuple avec un seul élément est construit en faisant suivre la valeur par une virgule (il n'est pas suffisant de placer cette valeur entre parenthèses). Pas très joli, mais efficace. Par exemple ::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
fr: L'instruction ``t = 12345, 54321, 'hello !'`` est un exemple d'un *emballage de tuple* : les valeurs ``12345``, ``54321`` et ``hello !`` sont emballées ensemble dans un tuple. L'opération inverse est aussi possible ::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
fr: Ceci est appelé, de façon plus ou moins appropriée, un *déballage de séquence* et fonctionne pour toute séquence placée à droite de l'expression. Ce déballage requiert autant de variables dans la partie gauche qu'il y a d'éléments dans la séquence. Notez également que cette affectation multiple est juste une combinaison entre un emballage de tuple et un déballage de séquence.

source: Sets
fr: Les ensembles

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
fr: Python fournit également un type de donnée pour les *ensembles*. Un ensemble est une collection non ordonnée sans élément dupliqué. Des utilisations basiques concernent par exemple des tests d'appartenance ou des suppressons de doublons. Les ensembles supportent également les opérations mathématiques comme les unions, intersections, différences et différences symétriques.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
fr: Des accolades, ou la fonction :func:`set` peuvent être utilisés pour créer des ensembles. Notez que pour créer un ensemble vide, ``{}`` ne fonctionne pas, cela créé un dictionnaire vide. Utilisez plutôt ``set()``.

source: Here is a brief demonstration::
fr: Voici une brève démonstration ::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
fr: Tout comme les :ref:`comprehensions de listes <tut-listcomps>`, il est possibled'écrire des comprehensions d'ensembles ::

source: Dictionaries
fr: Dictionnaires

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`append` and :meth:`extend`.
fr: Un autre type de donnée très utile, natif dans Python, est le *dictionnaire* (voir :ref:`typesmapping`). Ces dictionnaires sont parfois présents dans d'autres langages sous le nom de "mémoires associatives" ou de "tableaux associatifs". À la différence des séquences, qui sont indexées par des nombres, les dictionnaires sont indexés par des *clés*, qui peuvent être de n'importe quel type immuable ; les chaînes de caractères et les nombres peuvent toujours être des clés. Des tuples peuvent être utilisés comme clés s'ils ne contiennent que des chaînes, des nombres ou des tuples ; si un tuple contient un objet mutable, de façon directe ou indirecte, il ne peut pas être utilisé comme une clé. Vous ne pouvez pas utiliser des listes comme clés, car les listes peuvent être modifiées en place en utilisant des affectations par position, par tranches ou via des méthodes comme :meth:`append` ou :meth:`extend`.

source: It is best to think of a dictionary as an unordered set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
fr: Le plus simple est de considérer les dictionnaires comme des ensembles non ordonnés de paires *clé: valeur*, les clés devant être uniques (au sein d'un dictionnaire). Une paire d'accolades crée un dictionnaire vide : ``{}``. Placer une liste de paires clé:valeur séparées par des virgules à l'intérieur des accolades ajoute les valeurs correspondantes au dictionnaire ; c'est également de cette façon que les dictionnaires sont affichés en sortie.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
fr: Les principales opérations effectuées sur un dictionnaire consistent à stocker une valeur pour une clé et à extraire la valeur correspondant à une clé. Il est également possible de supprimer une paire clé:valeur avec ``del``. Si vous stockez une valeur pour une clé qui est déjà utilisée, l'ancienne valeur associée à cette clé est perdue. Si vous tentez d'extraire une valeur associée à une clé qui n'existe pas, une exception est levée.

source: Performing ``list(d.keys())`` on a dictionary returns a list of all the keys used in the dictionary, in arbitrary order (if you want it sorted, just use ``sorted(d.keys())`` instead). [2]_ To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
fr: Exécuter ``list(d.keys())`` sur un dictionnaire ``d`` retourne une liste de toutes lesclés utilisées dans le dictionnaire, dans un ordre arbitraire (si vous voulez qu'elles soient triées, utilisez ``sorted(d.keys())``). [2]_ Pour tester si une clé est dans le dictionnaire, utilisez le mot-clé :keyword:`in`.

source: Here is a small example using a dictionary::
fr: Voici un petit exemple utilisant un dictionnaire ::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
fr: Le constructeur :func:`dict` fabrique un dictionnaire directement à partir d'une liste de paires clé-valeur stockées sous la forme de tuples ::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
fr: De plus, il est possible de créer des dictionnaires par compréhension depuis un jeu de clef et valeurs ::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
fr: Lorsque les clés sont de simples chaînes de caractères, il est parfois plus facile de spécifier les paires en utilisant des paramètres nommés ::

source: Looping Techniques
fr: Techniques de boucles

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`items` method. ::
fr: Lorsque vous faites une boucle sur un dictionnaire, les clés et leurs valeurs peuvent être récupérées en même temps en utilisant la méthode :meth:`items` ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
fr: Lorsque vous itérez sur une séquence, la position et la valeur correspondante peuvent être récupérées en même temps en utilisant la fonction :func:`enumerate`.

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
fr: Pour faire des boucles sur deux séquences ou plus en même temps, les éléments peuvent être associés par la fonction :func:`zip` ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
fr: Pour faire une boucle sur une séquence inversée, commencez par créer la séquence dans son ordre normal, puis appliquez la fonction :func:`reversed` ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
fr: Pour faire une boucle sur une séquence triée, utilisez la fonction :func:`sorted`, qui renvoie une nouvelle liste triée sans altérer la source ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
fr: Il est parfois tentant de changer une liste pendant son itération, cependant, c'est souvent plus simple et plus sûr de créer une nouvelle liste à la place. ::

source: More on Conditions
fr: Plus d'informations sur les conditions

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
fr: Les conditions utilisées dans une instruction ``while`` ou ``if`` peuvent contenir n'importe quel opérateur, pas seulement des comparaisons.

source: The comparison operators ``in`` and ``not in`` check whether a value occurs (does not occur) in a sequence. The operators ``is`` and ``is not`` compare whether two objects are really the same object; this only matters for mutable objects like lists. All comparison operators have the same priority, which is lower than that of all numerical operators.
fr: Les opérateurs de comparaison ``in`` et ``not in`` testent si une valeur est présente ou non dans une séquence. Les opérateurs ``is`` et ``is not`` testent si deux objets sont vraiment le même objet ; ceci n'est important que pour des objets mutables comme des listes. Tous les opérateurs de comparaison ont la même priorité, qui est plus faible que celle des opérateurs numériques.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
fr: Les comparaison peuvent être enchaînées. Par exemple, ``a < b == c`` teste si ``a`` est inférieur ou égal à ``b`` et par ailleurs si ``b`` est égal à ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
fr: Les comparaisons peuvent être combinées en utilisant les opérateurs booléens ``and`` et ``or``, le résultat d'une comparaison (ou de toute expression booléenne) pouvant être inversé avec ``not``. Ces opérateurs ont une priorité inférieure à celle des opérateurs de comparaison ; entre eux, ``not`` a la priorité la plus élevée et ``or`` la plus faible, de telle sorte que ``A and not B or C`` est équivalent à ``(A and (not B)) or C``. Comme toujours, des parenthèses peuvent être utilisées pour exprimer l'instruction désirée.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
fr: Les opérateurs booléens ``and`` et ``or`` sont appelés opérateurs *en circuit court* : leurs arguments sont évalués de la gauche vers la droite, et l'évaluation s'arrête dès que le résultat est déterminé. Par exemple, si ``A`` et ``C`` sont vrais et ``B`` est faux, ``A and B and C`` n'évalue pas l'expression ``C``. Lorsqu'elle est utilisée en tant que valeur et non en tant que booléen, la valeur de retour d'un opérateur en circuit court est celle du dernier argument évalué.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
fr: Il est possible d'affecter le résultat d'une comparaison ou d'une autre expression booléenne à une variable. Par exemple ::

source: Note that in Python, unlike C, assignment cannot occur inside expressions. C programmers may grumble about this, but it avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
fr: Notez qu'en Python, à la différence du C, des affectations ne peuvent pas intervenir à l'intérieur d'expressions. Les programmeurs C râleront peut-être après cela, mais cela évite des erreurs fréquentes que l'on rencontre en C, lorsque l'expression ``=`` est placée alors qu'une expression ``==`` était attendue.

source: Comparing Sequences and Other Types
fr: Comparer des séquences avec d'autres types

source: Sequence objects may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
fr: Des séquences peuvent être comparées avec d'autres séquences du même type. La comparaison utilise un ordre *lexicographique* : les deux premiers éléments de chaque séquence sont comparés, et s'ils diffèrent cela détermine le résultat de la comparaison ; s'ils sont égaux, les deux éléments suivants sont comparés à leur tour, et ainsi de suite jusqu'à ce que l'une des séquences soit épuisée. Si deux éléments à comparer sont eux-mêmes des séquences du même type, alors la comparaison lexicographique est effectuée récursivement. Si tous les éléments des deux séquences sont égaux, les deux séquences sont alors considérées comme égales. Si une séquence est une sous-séquence de l'autre, la séquence la plus courte est celle dont la valeur est inférieure. La comparaison lexicographique des chaînes de caractères utilise le code Unicode des caractères. Voici quelques exemples de comparaisons entre séquences de même type ::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
fr: Comparer des objets de type différents avec ``<`` ou ``>``est autorisé si les objets ont des méthodes de comparaison appropriées. Par exemple, les types numériques sont comparées via leur valeur numérique, donc 0 est égal à 0,0, etc. Dans les autres cas, au lieu de donner un ordre imprévisible, l'interpréteur lancera une exception :exc:`TypeError`.

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
fr: D'autres langages pourraient renvoie l'objet modifié, qui permet de chaîner les méthodes, tel que: ``d->insert``("a")->remove("b")->sort();``.

source: Calling ``d.keys()`` will return a :dfn:`dictionary view` object. It supports operations like membership test and iteration, but its contents are not independent of the original dictionary -- it is only a *view*.
fr: Appeler ``d.keys()`` renvoie un objet :dfn:`dictionary view`, qui gère les opérations du type test d'appartenance (``in``) et l'itération. Mais son contenu n'est pas indépendant du dictionnaire d'origine, c'est une simple *vue*.

source: Errors and Exceptions
fr: Erreurs et exceptions

source: Until now error messages haven't been more than mentioned, but if you have tried out the examples you have probably seen some. There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions*.
fr: Jusqu'à maintenant, les messages d'erreurs ont seulement été mentionnés, mais si vous avez essayé les exemples vous avez certainement vu plus que cela. En fait, il y a au moins deux types d'erreurs à distinguer : les *erreurs de syntaxe* et les *exceptions*.

source: Syntax Errors
fr: Les erreurs de syntaxe

source: Syntax errors, also known as parsing errors, are perhaps the most common kind of complaint you get while you are still learning Python::
fr: Les erreurs de syntaxe, qui sont des erreurs d'analyse du code, sont peut-être celles que vous rencontrez le plus souvent lorsque vous êtes encore en phase d'apprentissage de Python ::

source: The parser repeats the offending line and displays a little 'arrow' pointing at the earliest point in the line where the error was detected. The error is caused by (or at least detected at) the token *preceding* the arrow: in the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing before it. File name and line number are printed so you know where to look in case the input came from a script.
fr: L'analyseur répère la ligne incriminée et affiche une petite 'flèche' pointant vers le premier endroit de la ligne où l'erreur a été détectée. L'erreur est causée (ou, au moins, a été détectée comme telle) par le symbole placé *avant* la flèche. Dans cet exemple la flèche est sur la fonction :func:`print` car il manque deux points (``':'``) justeavant. Le nom de fichier et le numéro de ligne sont affichés pour vous permettre de localiser facilement l'erreur lorsque le code provient d'un script.

source: Exceptions
fr: Les exceptions

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called *exceptions* and are not unconditionally fatal: you will soon learn how to handle them in Python programs. Most exceptions are not handled by programs, however, and result in error messages as shown here::
fr: Même si une instruction ou une expression est syntaxiquement correcte, elle peut générer une erreur lors de son exécution. Les erreurs détectées durant l'exécution son appelées des *exceptions* et ne sont pas toujours fatales : vous apprendrez bientôt comment les traîter dans vos programmes. La plupart des exceptions toutefois ne sont pas prises en charge par les programmes, ce qui génère des messages d'erreurs comme celui-ci ::

source: The last line of the error message indicates what happened. Exceptions come in different types, and the type is printed as part of the message: the types in the example are :exc:`ZeroDivisionError`, :exc:`NameError` and :exc:`TypeError`. The string printed as the exception type is the name of the built-in exception that occurred. This is true for all built-in exceptions, but need not be true for user-defined exceptions (although it is a useful convention). Standard exception names are built-in identifiers (not reserved keywords).
fr: La dernière ligne du message d'erreur indique la cause de l'erreur. Les exceptions peuvent être de différents types, et ce type est indiqué dans le message : les types indiqués dans l'exemple sont :exc:`ZeroDivisionError`, :exc:`NameError` et :exc:`TypeError`. Le texte affiché comme type de l'exception est le nom de l'exception native qui a été déclenchée. Ceci est vrai pour toutes les exceptions natives, mais n'est pas une obligation pour les exceptions définies par l'utilisateur (même si c'est une convention bien pratique). Les noms des exceptions standards sont des identifiants natifs (pas des mots réservés).

source: The rest of the line provides detail based on the type of exception and what caused it.
fr: Le reste de la ligne fournit plus de détails en fonction du type de l'exception et de ce qui l'a causé.

source: The preceding part of the error message shows the context where the exception happened, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
fr: La partie précédente du message d'erreur montre le contexte dans lequel s'est produite l'exception, sous la forme d'une trace de pile d'exécution. En général, celle-ci contient les lignes du code source ; toutefois, les lignes lues à partir de l'entrée standard ne seront pas affichées.

source: :ref:`bltin-exceptions` lists the built-in exceptions and their meanings.
fr: Vous trouverez dans :ref:`bltin-exceptions` la liste des exceptions natives et leur signification.

source: Handling Exceptions
fr: Gestion des exceptions

source: It is possible to write programs that handle selected exceptions. Look at the following example, which asks the user for input until a valid integer has been entered, but allows the user to interrupt the program (using :kbd:`Control-C` or whatever the operating system supports); note that a user-generated interruption is signalled by raising the :exc:`KeyboardInterrupt` exception. ::
fr: Il est possible d'écrire des programmes qui prennent en charge certaines exceptions. Regardez l'exemple suivant, qui demande une saisie à l'utilisateur jusqu'à ce qu'un entier valide ait été entré, mais permet à l'utilisateur d'interrompre le programme (en utilisant :kbd:`Control-C` ou un autre raccourci que le système supporte) ; notez qu'une interruption générée par l'utilisateur est signalée en levant l'exception :exc:`KeyboardInterrupt`.

source: The :keyword:`try` statement works as follows.
fr: L'instruction :keyword:`try` fonctionne comme ceci.

source: First, the *try clause* (the statement(s) between the :keyword:`try` and :keyword:`except` keywords) is executed.
fr: Premièrement, la *clause try* (instruction(s) placée(s) entre les mots-clés :keyword:`try` et :keyword:`except`) est exécutée.

source: If no exception occurs, the *except clause* is skipped and execution of the :keyword:`try` statement is finished.
fr: Si aucune exception n'intervient, la *clause except* est sautée et l'exécution de l'instruction :keyword:`try` est terminée.
