Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys ::
fr: Si vous avez vraiment une longue chaîne de formatage que vous ne voulez pas découper, ce serait bien de pouvoir référencer les variables à formater par leur nom plutôt que par leur position. Cela peut être fait simplement en passant un dictionnaire et en utilisant des crochets ``'[]'`` pour accéder aux clés ::

source: This could also be done by passing the table as keyword arguments with the '**' notation. ::
fr: On pourrait également faire ça en passant le tableau comme des arguments nommés en utilisant la notation '**' ::

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables.
fr: C'est particulièrement utile en combinaison avec la fonction native :func:`vars`, qui retourne un dictionnaire contenant toutes les variables locales.

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
fr: Pour avoir une vue complète du formatage des chaînes de caractères avec la méthode :meth:`str.format`, voyez : :ref:`formatstrings`.

source: Old string formatting
fr: Anciennes méthodes de formatage de chaînes

source: The ``%`` operator can also be used for string formatting. It interprets the left argument much like a :c:func:`sprintf`\ -style format string to be applied to the right argument, and returns the string resulting from this formatting operation. For example::
fr: L'opérateur ``%`` peut aussi être utilisé pour formater des chaînes. Il interprète l'argument de gauche un peu comme une chaîne de formatage d'une fonction :c:func:`sprintf` à appliquer à l'argument de droite, et retourne la chaîne résultant de cette opération de formatage. Par exemple ::

source: More information can be found in the :ref:`old-string-formatting` section.
fr: Vous trouverez plus d'informations dans la section :ref:`old-string-formatting`.

source: Reading and Writing Files
fr: Lecture et écriture de fichiers

source: :func:`open` returns a :term:`file object`, and is most commonly used with two arguments: ``open(filename, mode)``.
fr: :func:`open` retourne un :term:`objet fichier`, et est le plus souvent utilisé avecdeux arguments : ``open(filename, mode)``.

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
fr: Le premier argument est une chaîne contenant le nom du fichier. Le second argument est une autre chaîne contenant quelques caractères décrivant la façon dont le fichier sera utilisé. *mode* peut être ``'r'`` quand le fichier ne sera accédé qu'en lecture, ``'w'`` en écriture seulement (un fichier existant portant le même nom sera alors écrasé), et ``'a'`` ouvre le fichier en mode ajout (toute donnée écrite dans le fichier est automatiquement ajoutée à la fin). ``'r+'`` ouvre le fichier en mode lecture/écriture. L'argument *mode* est optionnel ; sa valeur par défaut est ``'r'``.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific encoding. If encoding is not specified, the default is platform dependent (see :func:`open`). ``'b'`` appended to the mode opens the file in :dfn:`binary mode`: now the data is read and written in the form of bytes objects. This mode should be used for all files that don't contain text.
fr: Normalement, les fichiers sont ouverts en :dfn:`mode texte`, c'est à dire que vous lisez et écrivez des chaînes de caractères depuis et dans ce fichier, qui y sont encodées avec un encodage donné. Si aucun encodage n'est spécifié, l'encodage par défaut dépendra de la plateforme (voir :func:`open`). ``'b'`` collé à la fin du mode indique que le fichier doit être ouvert en :dfn:`mode binaire` c'est à dire que les données sont lues et écrites sous formes d'octets. Ce mode est à utiliser pour les fichiers contenant autre chose que du texte.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
fr: En mode texte, le comportement par défaut, à la lecture, est de convertir les fin de lignes spécifiques à la plateforme (``\n`` sur Unix, ``\r\n`` sur windows etc...) en simples `` ``. Lors de l'écriture, le comprennent par défaut est d'appliquer l'opération contraire : les `` `` sont convertis dans leur équivalent sur la plateforme courante. Ces modifications effectuées automatiquement sont normales pour du texte mais détérioreraient des données binaires comme un fichier :file:`JPEG` ou :file:`EXE`. Soyez particulièrement attentifs à ouvrir ces fichiers binaires en mode binaire.

source: Methods of File Objects
fr: Méthodes des objets fichiers

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
fr: Les derniers exemples de cette section supposeront qu'un objet fichier appelé ``f`` a déjà été créé.

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
fr: ``f.readline()`` lit une seule ligne du fichier ; un caractère de fin de ligne (``\n``) est laissé à la fin de la chaîne, et n'est omis que sur la dernière ligne du fichier si celui-ci ne se termine pas un caractère de fin de ligne. Ceci permet de rendre la valeur de retour non ambigüe : si ``f.readline()`` retourne une chaîne vide, c'est que la fin du fichier a été atteinte, alors qu'une ligne vide est représentée par ``'\n'``, une chaîne de caractères ne contenant qu'une fin de ligne. ::

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
fr: Une autre approche de lecture des lignes est de faire une boucle sur l'objet fichier. Cela est plus efficace en terme de gestion mémoire, plus rapide, et donne un code plus simple ::

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
fr: Pour lire toutes les lignes d'un fichier, il est aussi possible d'utiliser ``list(f)`` ou ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
fr: ``f.write(string)`` écrit le contenu de *string* dans le fichier, et renvoie le nombre de caractères écrits. ::

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
fr: ``f.tell()`` retourne un entier indiquant la position actuelle dans le fichier, mesurée en octets à partir du début du fichier, lorsque le fichier est ouvert en mode binaire, ou un nombre obscure en mode texte.

source: To change the file object's position, use ``f.seek(offset, from_what)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *from_what* argument. A *from_what* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *from_what* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
fr: Pour modifier la position dans le fichier, utilisez ``f.seek(offset, from_what)``. Laposition est calculée en ajoutant *offset* à un point de référence ; ce point de référence est sélectionné par l'argument *from_what* : 0 pour le début du fichier, 1 pour la position actuelle, et 2 pour la fin du fichier. *from_what* peut être omis et sa valeur par défaut est 0, utilisant le début du fichier comme point de référence ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
fr: Sur un fichier en mode texte (ceux ouverts sans ``b`` dans le mode), seuls les changements de position relatifs au début du fichier sont autorisés (sauf une exception : se rendre à la fin du fichier avec ``seek(0, 2)``) et les seuls valeurs possible pour le paramètre *offset* sont les valeurs renvoyées par ``f.tell()``, ou zéro. Toute autre valeur pour le paramètre *offset* engendrera un comportement indéfini.

source: When you're done with a file, call ``f.close()`` to close it and free up any system resources taken up by the open file. After calling ``f.close()``, attempts to use the file object will automatically fail. ::
fr: Quand vous avez terminé d'utiliser un fichier, appeler ``f.close()`` pour le fermer et libérer toutes les ressources système qu'il a pu utiliser. Après l'appel de ``f.close()``, toute tentative d'utilisation de l'objet fichier échouera systématiquement ::

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. This has the advantage that the file is properly closed after its suite finishes, even if an exception is raised on the way. It is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
fr: C'est une bonne pratique d'utiliser le mot-clé :keyword:`with` lorsque vous traitez des fichiers. Ceci procure l'avantage de toujours fermer correctement le fichier, même si une exception a été déclenchée. C'est aussi beaucoup plus court que d'utiliser l'équivalent avec des blocs :keyword:`try`\ - \ :keyword:`finally` ::

source: File objects have some additional methods, such as :meth:`~file.isatty` and :meth:`~file.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
fr: Les fichiers disposent de méthodes supplémentaires, telles que :meth:`~file.isatty` et :meth:`~file.truncate` qui sont moins souvent utilisées ; consultez la Référence de la Bibliothèque Standard pour avoir un guide complet des objets fichiers.

source: Saving structured data with :mod:`json`
fr: Sauvegarder des données structurées avec le module :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
fr: Les chaînes de caractères peuvent facilement être écrites dans un fichier et relues. Les nombres nécessitent un peu plus d'efforts, car la méthode :meth:`read` ne retourne que des chaînes, qui doivent donc être passées à une fonction comme :func:`int`, qui prend une chaîne comme ``'123'`` en entrée et retourne sa valeur numérique 123. Mais dès que vous voulez enregistrer des types de données plus complexes comme des listes, des dictionnaires ou des instances de classes, les choses se compliquent beaucoup plus.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <http://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
fr: Plutôt que de passer son temps à écrire et déboguer du code permettant de sauvegarder des types de données compliquées, Python permet d'utiliser `JSON (JavaScript Object Notation) <http://json.org>`_, un format répandu de représentation et d'échange de données. Le module standard appellé :mod:`json` peut transformer des hiérarchies de données Python en leur représentation sous forme de chaîne de caractère. Ce processus est nommé :dfn:`sérialiser `. Reconstruire les données à partir de leur représentation sous forme de chaîne est appelé :dfn:`déserialiser`. Entre sa serialisation et sa déserialisation, la chaîne représentant les données peuvent avoir été stockées ou transmises à une autre machine.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
fr: Le format JSON se retrouve communément dans les applications modernes pour échanger des données. Beaucoup de développeurs sont déjà familier avec le JSON, en faisant un format de prédilection pour l'interopérabilité.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
fr: Si vous avez un objet ``x``, vous pouvez simplement voir sa représentation JSON ::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
fr: Une variation de la fonction :func:`~jspn.dumps`, nommée :func:`~json.dump`, sérialise simplement l'objet donné vers un fichier. Donc si ``f`` est un :term:`fichier texte` ouvert en écriture, il devient possible de faire ::

source: To decode the object again, if ``f`` is a :term:`text file` object which has been opened for reading::
fr: Pour reconstruire l'objet, si ``f`` est cette fois un :term:`fichier texte` ouverten lecture ::

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
fr: Cette méthode de serialisation peut sérialiser des listes et des dictionnaires, mais sérialiser d'autres types de données nécessité un peu plus de travail. La documentation du module :mod:`json` explique comment faire.

source: :mod:`pickle` - the pickle module
fr: Le module :mod:`pickle`

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
fr: À l'inverse de :ref:`JSON <tut-json>`, *pickle* est un protocole permettant la serialisation d'objets Python arbitrairement complexes. Il est donc spécifique à Python et ne peut être utilisé pour communiquer avec d'autres langages. Il n'est aussi pas sans failles : desérialiser des données au format pickle provenant d'une source malveillante et particulièrement habile pourrait mener exécuter du code arbitraire.

source: Interactive Input Editing and History Substitution
fr: Édition interactive des entrées et substitution d'historique

source: Some versions of the Python interpreter support editing of the current input line and history substitution, similar to facilities found in the Korn shell and the GNU Bash shell. This is implemented using the `GNU Readline`_ library, which supports various styles of editing. This library has its own documentation which we won't duplicate here.
fr: Certaines versions de l'interpréteur Python prennent en charge l'édition de la ligne d'entrée courante et la substitution d'historique, similaires aux facilités que l'on trouve dans le shell Korn et dans le shell GNU Bash. C'est implémenté en utilisant la bibliothèque `GNU Readline`_, qui supporte plusieurs styles d'édition. La bibliothèque a sa propre documentation qui ne va pas être dupliquée ici.

source: Tab Completion and History Editing
fr: Complément Automatique et édition de l'historique

source: Completion of variable and module names is :ref:`automatically enabled <rlcompleter-config>` at interpreter startup so that the :kbd:`Tab` key invokes the completion function; it looks at Python statement names, the current local variables, and the available module names. For dotted expressions such as ``string.a``, it will evaluate the expression up to the final ``'.'`` and then suggest completions from the attributes of the resulting object. Note that this may execute application-defined code if an object with a :meth:`__getattr__` method is part of the expression. The default configuration also saves your history into a file named :file:`.python_history` in your user directory. The history will be available again during the next interactive interpreter session.
fr: Ceci lie la touche :kbd:`Tab` à la fonction de complètement, donc taper la touche :kbd:`Tab` deux fois de suite suggère les options disponibles ; la recherche s'effectue dans les noms d'instructions Python, les noms des variables locales et les noms de modules disponibles. Pour les expressions pointées telles que ``string.a``, l'expression est évaluée jusqu'au dernier ``'.'`` avant de suggérer les options disponibles à partir des attributs de l'objet résultant de cette évaluation. Notez bien que ceci peut exécuter une partie du code de l'application si un objet disposant d'une méthode :meth:`__getattr__` fait partie de l'expression. La configuration par défaut sauvegarde l'historique dans un fichier nommé :file:`.python_history` dans votre dossier d'utilisateur. L'historique sera à nouveau disponible lors de la prochaine session interactive.

source: Alternatives to the Interactive Interpreter
fr: Alternatives à l'interpréteur interactif

source: This facility is an enormous step forward compared to earlier versions of the interpreter; however, some wishes are left: It would be nice if the proper indentation were suggested on continuation lines (the parser knows if an indent token is required next). The completion mechanism might use the interpreter's symbol table. A command to check (or even suggest) matching parentheses, quotes, etc., would also be useful.
fr: Cette facilité constitue un énorme pas en avant comparé aux versions précédentes de l'interpréteur ; toutefois, certains souhaits sont laissés de côté : ce serait bien si une indentation correcte était proposée sur les lignes de continuation (l'analyseur sait si une indentation doit suivre). Le mécanisme de complétion devrait utiliser la table de symboles de l'interpréteur. Une commande pour vérifier (ou même suggérer) les correspondances de parenthèses, de guillemets..., serait également utile.

source: One alternative enhanced interactive interpreter that has been around for quite some time is IPython_, which features tab completion, object exploration and advanced history management. It can also be thoroughly customized and embedded into other applications. Another similar enhanced interactive environment is bpython_.
fr: Une alternative améliorée de l'interpréteur interactif qui a été développée depuis maintenant quelques temps est IPython_, qui fournit la complétude, l'exploration d'objets et une gestion avancée de l'historique. Il peut également être personnalisé en profondeur et embarqué dans d'autres applications. Un autre environnement interactif amélioré similaire est bpython_.

source: Using the Python Interpreter
fr: Utiliser l'interpréteur Python

source: Invoking the Interpreter
fr: Invoquer l'interpréteur

source: The Python interpreter is usually installed as :file:`/usr/local/bin/python3.5` on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
fr: L'interpréteur Python est habituellement installé en temps que :file:`/usr/local/bin/python3.5` sur les machines où c'est possible. Ajouter :file:`/usr/local/bin` dans votre :envvar:`PATH` rend possible de le démarrer en tapant la commande:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
fr: dans le shell. [#]_ Le choix du répertoire où se trouve l'interpréteur étant uneoption d'installation, d'autres chemins sont possibles; voyez avec votre guru Python local ou votre administrateur système. (Par exemple, :file:`/usr/local/python` est une localisation courante.)

source: On Windows machines, the Python installation is usually placed in :file:`C:\\Python35`, though you can change this when you're running the installer. To add this directory to your path, you can type the following command into the command prompt in a DOS box::
fr: Sur les machines Windows, l'installation de Python se situe souvent dans :file:`C:\\Python35`, cependant, il est possible de changer ça à l'installation. Pour ajouter ce dossier à votre :envvar:`PATH`, vous pouvez copier cette commande dans un interpréteur DOS ::

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
fr: Taper un caractère de fin de fichier (:kbd:`Ctrl-D` sous Unix, :kbd:`Ctrl-Z` sous Windows) suive à une invite de commande primaire provoque la fermeture de l'interpréteur avec un statut d'erreur nul. Si cela ne fonctionne pas, vous pouvez fermer l'interpréteur en tapant la commande ``quit()``.
