Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: As that says near the end, "there are no easy answers." Still, don't be unduly wary of floating-point! The errors in Python float operations are inherited from the floating-point hardware, and on most machines are on the order of no more than 1 part in 2\*\*53 per operation. That's more than adequate for most tasks, but you do need to keep in mind that it's not decimal arithmetic and that every float operation can suffer a new rounding error.
fr: Il est vrai qu'il n'existe pas de réponse simple, cependant ne vous méfiez pas trop des nombres à virtule flottante ! Les erreurs, en Python, dans les opérations de nombres à virgule flottante sont dues au matériel sous-jacent, et sur la plupart des machines ne sont pas plus importantes que 1 sur 2\*\*53 par opération. C'est plus que nécessaire pour la plupart des tâches, mais vous devez garder à l'esprit que ce ne sont pas des opérations décimales, et que chaque opération sur des nombres à virgule flottante peut souffrir d'une nouvelle erreur.

source: While pathological cases do exist, for most casual use of floating-point arithmetic you'll see the result you expect in the end if you simply round the display of your final results to the number of decimal digits you expect. :func:`str` usually suffices, and for finer control see the :meth:`str.format` method's format specifiers in :ref:`formatstrings`.
fr: Bien que des cas pathologiques existent, pour la plupart des cas d'utilisations courants vous obtiendrez le résultat attendu à la fin et en arrondissant simplement au nombre de décimales désirées à l'affichage avec :func:`str`. Pour un contrôle fin sur la manière dont les décimales sont affichées, consultez dans :ref:`formatstrings` les spécifications de formattage de la méthode :meth:`str.format`.

source: For use cases which require exact decimal representation, try using the :mod:`decimal` module which implements decimal arithmetic suitable for accounting applications and high-precision applications.
fr: Pour les cas requérant une représentation décimale exacte, le module :mod:`decimal` peut être utile, il implémente l'arithmétique décimale et peut donc être un choix adapté pour des applications nécessitant une grande précision.

source: Another form of exact arithmetic is supported by the :mod:`fractions` module which implements arithmetic based on rational numbers (so the numbers like 1/3 can be represented exactly).
fr: Une autre forme d'arithmétique exacte est implémentée dans le module :mod:`fractions` qui se base sur les nombre rationnels (donc 1/3 peut y être représenté exactement).

source: If you are a heavy user of floating point operations you should take a look at the Numerical Python package and many other packages for mathematical and statistical operations supplied by the SciPy project. See <http://scipy.org>.
fr: Si vous êtes un utilisateur intensif des opérations sur les nombres à virgule flottante, vous devriez regarder le paquet *Numerical Python* et une série d'autres paquets pour les opérations statistiques et mathématiques fournis par le projet SciPy. Voir <http://scipy.org>.

source: Python provides tools that may help on those rare occasions when you really *do* want to know the exact value of a float. The :meth:`float.as_integer_ratio` method expresses the value of a float as a fraction::
fr: Python fournit des outils qui peuvent être utils dans les rares occasions ou vous voulez réellement connaître la valeur exacte d'un nombre à virgule flottante. La méthode :meth:`float.as_integer_ratio` donne la valeur du nombre sous forme de fraction ::

source: Since the ratio is exact, it can be used to losslessly recreate the original value::
fr: Puisque le ratio est exact, il peut être utilisé pour recréer la valeur originale dans perte ::

source: The :meth:`float.hex` method expresses a float in hexadecimal (base 16), again giving the exact value stored by your computer::
fr: La méthode :meth:`float.hex` donne le nombre en hexadécimal (base 16), donnant ici aussi la valeur exacte stockée par la machine ::

source: This precise hexadecimal representation can be used to reconstruct the float value exactly::
fr: Cette représentation hexadécimale petit être utilisée pour reconstruire, sans approximation, le *float* ::

source: Since the representation is exact, it is useful for reliably porting values across different versions of Python (platform independence) and exchanging data with other languages that support the same format (such as Java and C99).
fr: Puisque cette représentation est exacte, elle est pratique pour échanger des valeurs entre différentes version de Python (indépendamment de la machine) ou d'autres langages qui comprennent ce format (tel que Java et C99).

source: Another helpful tool is the :func:`math.fsum` function which helps mitigate loss-of-precision during summation. It tracks "lost digits" as values are added onto a running total. That can make a difference in overall accuracy so that the errors do not accumulate to the point where they affect the final total:
fr: Une autre fonction utile est :func:`math.fsum`, qui aide à diminuer les pertes de précision lors des additions. Elle surveille les *décimales perdues* au fur et à mesure que les valeurs sont ajoutées au total. Cela peut faire une différence au niveau de la précision globale car cela empêche les erreurs de s'accumuler jusqu'au point ou le résultat final est affecté:

source: Representation Error
fr: Erreurs de représentation

source: This section explains the "0.1" example in detail, and shows how you can perform an exact analysis of cases like this yourself. Basic familiarity with binary floating-point representation is assumed.
fr: Cette section explique en détail l'exemple du "0.1", et montre comment vous pouvez effectuer une analyse exacte de ce type de cas par vous-même. Il est supposé que vous êtes déjà familier de la représentation binaire des nombres flottants.

source: :dfn:`Representation error` refers to the fact that some (most, actually) decimal fractions cannot be represented exactly as binary (base 2) fractions. This is the chief reason why Python (or Perl, C, C++, Java, Fortran, and many others) often won't display the exact decimal number you expect.
fr: Le terme :dfn:`Representation error` signifie que la plupart des fractions décimales ne peuvent être représentées exactement en binaire. C'est la principale raison pour laquelle Python (ou Perl, C, C++, Java, Fortran, et beuacoup d'autres) n'affiche habituellement pas le résultat exact en décimal.

source: Why is that? 1/10 is not exactly representable as a binary fraction. Almost all machines today (November 2000) use IEEE-754 floating point arithmetic, and almost all platforms map Python floats to IEEE-754 "double precision". 754 doubles contain 53 bits of precision, so on input the computer strives to convert 0.1 to the closest fraction it can of the form *J*/2**\ *N* where *J* is an integer containing exactly 53 bits. Rewriting ::
fr: Pourquoi ? 1/10 n'est pas représentable de manière exacte en fractions binaires. Cependant, toutes les machines d'aujourd'hui (Juillet 2010) suivent la norme IEEE-754 en ce qui concerne l'arithmétique des nombres à virgule flottante. et la plupart des plateformes utilisent un "IEEE-754 double precision" pour représenter les floats de Python. Les "IEEE-754 double precision" utilisent 53 bits de précision, donc a la lecture l'ordinateur essaie de convertir 0,1 dans la fraction la plus proche possible de la forme *J*/2**\ *N* avec *J* un nombre entier d'exactement 53 bits. Réecrire ::

source: as ::
fr: en ::

source: and recalling that *J* has exactly 53 bits (is ``>= 2**52`` but ``< 2**53``), the best value for *N* is 56::
fr: en se rappelant que *J* fait exactement 53 bits (donc ``>= 2**52`` mais ``< 2**53``), la meilleur valeur possible pour *N* est 56::

source: That is, 56 is the only value for *N* that leaves *J* with exactly 53 bits. The best possible value for *J* is then that quotient rounded::
fr: Donc 56 est la seule valeur possible pour *N* qui laisse exactement 53 bits pour *J*. La meilleure valeur possible pour *J* est donc ce quotient, arrondi::

source: Since the remainder is more than half of 10, the best approximation is obtained by rounding up::
fr: Puisque la retenue est plus grande que la moitié de 10, la meilleure approximation est obtenue en arrondissant par le haut:

source: Therefore the best possible approximation to 1/10 in 754 double precision is::
fr: Par conséquent la meilleure approximation possible pour 1/10 en "IEEE-754 double precision" est cette au desus de 2\*\*56, soit ::

source: Dividing both the numerator and denominator by two reduces the fraction to::
fr: Diviser le numérateur et le dénominateur par deux réduit la fraction à ::

source: Note that since we rounded up, this is actually a little bit larger than 1/10; if we had not rounded up, the quotient would have been a little bit smaller than 1/10. But in no case can it be *exactly* 1/10!
fr: Notez que puisque l'arrondi a été fait vers le haut, le résultat est en réalité légèrement plus grand que 1/10; si nous n'avions pas arrondi par le haut, le quotient aurait été légèrement plus petit que 1/10. Mais dans aucun cas il ne vaut *exactement* 1/10 !

source: So the computer never "sees" 1/10: what it sees is the exact fraction given above, the best 754 double approximation it can get::
fr: Donc l'ordinateur ne "voit" jamais 1/10: ce qu'il voit est la fraction exacte donnée ci-dessus, la meilleure approximation utilisant les nombres à virgule flottante double précision de l'"IEEE-754"

source: If we multiply that fraction by 10\*\*55, we can see the value out to 55 decimal digits::
fr: Si on multiplie cette fraction par 10\*\*30, on peut observer les valeurs de ses 55 décimales de poid fort::

source: meaning that the exact number stored in the computer is equal to the decimal value 0.1000000000000000055511151231257827021181583404541015625. Instead of displaying the full decimal value, many languages (including older versions of Python), round the result to 17 significant digits::
fr: la valeur stockée dans l'ordinateur est donc égale à 0,1000000000000000055511151231257827021181583404541015625. Au lieu d'afficher toutes les décimales, beaucoup de langages (dont les vieilles version de Python) arrondissent le résultat à la 17eme décimale significative.

source: The :mod:`fractions` and :mod:`decimal` modules make these calculations easy::
fr: Les modules :mod:`fractions` et :mod:`decimal` rendent simples ces calculs ::

source: The Python Tutorial
fr: Le tutoriel python

source: Python is an easy to learn, powerful programming language. It has efficient high-level data structures and a simple but effective approach to object-oriented programming. Python's elegant syntax and dynamic typing, together with its interpreted nature, make it an ideal language for scripting and rapid application development in many areas on most platforms.
fr: Python est un langage de programmation puissant et facile à apprendre. Il dispose de structures de données de haut niveau et d'une approche de la programmation orientée objet simple mais efficace. Parce que sa syntaxe est élégante, que son typage est dynamique et qu'il est interprété, Python est un langage idéal pour l'écriture de scripts et le développement rapide d'applications dans de nombreux domaines et sur de nombreuses plateformes.

source: The Python interpreter and the extensive standard library are freely available in source or binary form for all major platforms from the Python Web site, https://www.python.org/, and may be freely distributed. The same site also contains distributions of and pointers to many free third party Python modules, programs and tools, and additional documentation.
fr: L'interpréteur Python et sa vaste bibliothèque standard sont disponibles librement, sous forme de sources ou de binaires, pour toutes les plateformes majeures, depuis le site Internet http://www.python.org/ et peuvent être librement redistribués. Le même site distribue et contient des liens vers des modules, des programmes et des outils tiers ainsi que vers de la documentation supplémentaire.

source: The Python interpreter is easily extended with new functions and data types implemented in C or C++ (or other languages callable from C). Python is also suitable as an extension language for customizable applications.
fr: L'interpréteur Python peut être facilement étendu par de nouvelles fonctions et types de données implémentés en C ou C++ (ou tout autre langage appelable depuis le C). Python est également adapté comme langage d'extension pour personnaliser des applications.

source: This tutorial introduces the reader informally to the basic concepts and features of the Python language and system. It helps to have a Python interpreter handy for hands-on experience, but all examples are self-contained, so the tutorial can be read off-line as well.
fr: Ce tutoriel introduit au lecteur, de façon informelle, les concepts de base ainsi que les fonctionnalités du langage Python et de son écosystème. Il aide à prendre en main l'interpréteur Python pour une utilisation sur des cas pratiques. Les exemples étant indépendants, le tutoriel est adapté à une lecture hors ligne.

source: For a description of standard objects and modules, see :ref:`library-index`. :ref:`reference-index` gives a more formal definition of the language. To write extensions in C or C++, read :ref:`extending-index` and :ref:`c-api-index`. There are also several books covering Python in depth.
fr: Pour une description des objets et modules de la bibliothèque standard, voyez :ref:`library-index`. :ref:`reference-index` présente une définition plus formelle du langage. Pour écrire des extensions en C ou en C++, lisez :ref:`extending-index` et :ref:`c-api-index`. Des livres sont également disponibles qui couvrent Python dans le détail.

source: This tutorial does not attempt to be comprehensive and cover every single feature, or even every commonly used feature. Instead, it introduces many of Python's most noteworthy features, and will give you a good idea of the language's flavor and style. After reading it, you will be able to read and write Python modules and programs, and you will be ready to learn more about the various Python library modules described in :ref:`library-index`.
fr: L'ambition de ce tutoriel n'est pas d'être exhaustif et de couvrir chaque fonctionnalités, ni même toutes les fonctionnalités les plus utilisées. Il cherche, par contre, à introduire plusieurs des fonctionnalités les plus notables et à vous donner une bonne idée de la saveur et du style du langage. Après l'avoir lu, vous serez capable de lire et d'écrire des modules et des programmes Python et vous serez prêts à en apprendre d'avantage sur les modules de la bibliothèque Python décrits dans :ref:`library-index`.

source: The :ref:`glossary` is also worth going through.
fr: Pensez aussi à consulter le :ref:`glossary`.

source: Input and Output
fr: Les entrées/sorties

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
fr: Il existe bien des moyens de présenter les sorties d'un programmes ; les données peuvent être imprimées sous une forme lisible par un être humain, ou sauvegardées dans un fichier pour une utilisation future. Ce chapitre présentera donc diverses possibilités.

source: Fancier Output Formatting
fr: Formatage de données

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
fr: Jusque là, nous avons rencontré deux moyens d'écrire des données : les *déclarations d'expressions* et la fonction :func:`print`. (Une troisième méthode consiste à utiliser la méthode :meth:`write` des fichiers, le fichier de sortie standard peut être référence en tant que ``sys.stdout``. Voyez le Guide de Référence de la Bibliothèque Standard pour en savoir plus.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are two ways to format your output; the first way is to do all the string handling yourself; using string slicing and concatenation operations you can create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width; these will be discussed shortly. The second way is to use the :meth:`str.format` method.
fr: Mais vous voudrez souvent avoir plus de contrôle sur le formatage de vos sorties que de simplement afficher des valeurs séparées par des espaces. Il y a deux méthodes pour formater ces sorties, la première est de gérer les chaînes de caractères par vous même, en utilisant des tranches sur vos chaînes et des opérations de concaténation, vous pouvez créer n'importe quelle présentation imaginable. Mais les chaînes de caractères disposent également de méthodes qui facilitent, par exemple, les alignements de chaînes de caractères selon une certaines largeur de colonne, et qui seront présentées rapidement. La seconde méthode consiste à utiliser la méthode :meth:`str.format`.

source: The :mod:`string` module contains a :class:`~string.Template` class which offers yet another way to substitute values into strings.
fr: Le module :mod:`string` contient une classe :class:`~string.Template` qui offre encore une autre façon de remplacer des valeurs au sein de chaînes de caractères.

source: One question remains, of course: how do you convert values to strings? Luckily, Python has ways to convert any value to a string: pass it to the :func:`repr` or :func:`str` functions.
fr: Mais une question demeure, bien sûr : comment convertir des valeurs en chaînes de caractères ? Heureusement, Python fournit plusieurs moyens de convertir n'importe quelle valeur en chaîne : les fonctions :func:`repr` et :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
fr: La fonction :func:`str` est destinée à renvoyer des représentations de valeurs qui soient lisibles par un être humain, alors que la fonction :func:`repr` est destinée à générer des représentations qui puissent être lues par l'interpréteur (ou forceront une :exc:`SyntaxError` s'il n'existe aucune syntaxe équivalente). Pour les objets qui n'ont pas de représentation humaine spécifique, :func:`str` renverra la même valeur que :func:`repr`. Beaucoup de valeurs, comme les nombres ou les structures telles que les listes ou les dictionnaires, ont la même représentation en utilisant les deux fonctions. Les chaînes de caractères et les nombres à virgule flottante, en revanche, ont deux représentations distinctes.

source: Some examples::
fr: Quelques exemples ::

source: Here are two ways to write a table of squares and cubes::
fr: Voici deux façons d'écrire une table de carrés et de cubes ::

source: (Note that in the first example, one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
fr: (Notez que dans ce premier exemple, un espace entre chaque colonne a été ajouté par la façon dont fonctionne :func:`print`, qui ajoute toujours des espaces entre ses paramètres.)

source: This example demonstrates the :meth:`str.rjust` method of string objects, which right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
fr: Cet exemple démontre l'utilisation de la méthode :meth:`str.rjust` des chaînes de caractères, qui fait une justification à droite d'une chaîne dans un champ d'une largeur donnée en ajoutant des espaces sur la gauche. Il existe des méthodes similaires :meth:`str.ljust` et :meth:`str.center`. Ces méthodes n'écrivent rien, elles retournent simplement une nouvelle chaîne. Si la chaîne passée en paramètre est trop longue, elle n'est pas tronquée mais renvoyée sans modification ; ce qui peut déranger votre mise en page mais est souvent préférable à l'alternative, qui pourrait mentir sur une valeur (et si vous voulez vraiment tronquer vos valeurs, vous pouvez toujours utiliser une tranche, comme dans ``x.ljust(n)[:n]``).

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
fr: Il existe une autre méthode, :meth:`str.zfill`, qui comble une chaîne numérique à gauche avec des zéros. Elle comprend les signes plus et moins ::

source: Basic usage of the :meth:`str.format` method looks like this::
fr: L'utilisation de base de la méthode :meth:`str.format` ressemble à cela ::

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
fr: Les accolades et les caractères qu'ils contiennent (appelés les champs de formatage) sont remplacés par les objets passés en paramètres à la méthode :meth:`str.format`. Un nombre entre accolades se réfère à la position de l'objet passé à la méthode :meth:`str.format`. ::

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
fr: Si des arguments nommés sont utilisés dans la méthode :meth:`str.format`, leurs valeurs sont utilisées en se basant sur le nom des arguments ::

source: Positional and keyword arguments can be arbitrarily combined::
fr: Les arguments positionnés et nommés peuvent être combinés arbitrairement ::

source: ``'!a'`` (apply :func:`ascii`), ``'!s'`` (apply :func:`str`) and ``'!r'`` (apply :func:`repr`) can be used to convert the value before it is formatted::
fr: ``'!a'`` (appliquer :func:`ascii`), ``'!s'`` (appliquer :func:`str`) et ``'!r'`` (appliquer :func:`repr`)peuvent être utilisées pour convertir les valeurs avant leur formatage ::

source: An optional ``':'`` and format specifier can follow the field name. This allows greater control over how the value is formatted. The following example rounds Pi to three places after the decimal.
fr: Des caractères ``':'`` suivis d'une spécification de formatage peuvent suivre le nom du champ. Ceci offre un niveau de contrôle plus fin sur la façon dont les valeurs sont formatées. L'exemple suivant arrondit Pi à trois décimales ::

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making tables pretty. ::
fr: Indiquer un entier après le ``':'`` indique la largeur minimale de ce champ en nombre de caractères. C'est utile pour faire de jolis tableaux ::
