Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: Appendix
fr: Annexe

source: Interactive Mode
fr: Mode interactif

source: Error Handling
fr: Gestion des erreurs

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
fr: Quand une erreur se produit, l'interpréteur affiche un message d'erreur et le suivit de la pile. En mode interactif, il revient à l'invite de commande primaire; si l'entrée provient d'un fichier, l'interpréteur se termine avec un état de sortie non nul après avoir affiché le suivit de la pile. (Les exceptions gérées par une clause :keyword:`except` dans une instruction :keyword:`try` ne sont pas des erreurs dans ce contexte.) Certaines erreurs sont inconditionnellement fatales et cause une sortie avec un état non nul; les incohérences internes et, dans certains cas, les pénuries de mémoires, sont traitées de la sorte. Tous les messages d'erreur sont écrits sur la sortie d'erreur standard; les sorties normales issues des commandes exécutées sont écrites sur la sortie standard.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
fr: Taper le caractère d'interruption (généralement :kbd:`Ctrl+C` ou :kbd:`Supprimer`) au niveau de l'invite de commande primaire annule l'entrée et revient à l'invite. [#]_ Saisir une interruption tandis qu'une commande s'exécute lève une exception :exc:`KeyboardInterrupt` qui peut être gérée par une instruction :keyword:`try`.

source: Executable Python Scripts
fr: Scripts Python exécutables

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
fr: Sur les systèmes Unix, un script Python peut être rendu directement exécutable comme un script shell en ajoutant la ligne ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
fr: (en supposant que l'interpréteur est dans le :envvar:`PATH` de l'utilisateur) au début du script et en rendant le fichier exécutable. ``#!`` doivent être les deux premiers caractères du fichier. Sur certaines plateformes, cette première ligne doit finir avec une fin de ligne de type Unix (``'\n'``) et pas de type Windows (``'\r\n'``). Notez que le caractère dièse, ``'#'``, est utilisé pour initier un commentaire en Python.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
fr: Un script peut être rendu utilisable en utilisant la commande :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
fr: Sur les système windows il n'y a pas de "mode executable". L'installateur Python associe automatiquement les fichier en ``.py`` avec ``python.exe`` de telle sorte qu'un double clic sur un fichier Python le lance comme un script. L'extension peut aussi être ``.pyw``, dans ce cas, la console n'apparait pas.

source: The Interactive Startup File
fr: La configuration du mode interactif

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
fr: En mode interactif, il peut être pratique de faire exécuter quelques commandes au lancement de l'interprète. C'est possible en configurant la variable d'environnement :envvar:`PYTHONSTARTUP`" avec le nom d'un fichier contenant les instructions à exécuter, à la même manière du :file:`.profile` dans un shell Unix.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
fr: Ce fichier n'est lu qu'en mode interactif, pas quand Python lis les instructions depuis un fichier, ni quand :file:`/dev/tty` est donné explicitement comme fichier source (qui d'ailleurs se compterait comme une session interactive). Les instructions de ce fichier, sont exécutées dans le même espace de noms que vos commandes, donc les objets définis et modules importés peuvent être utilisées directement dans la session interactive. Dans ce fichier il est aussi possible de changer les prompts ``sys.ps1`` et ``sys.ps2``.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
fr: Si vous voulez exécuter d'autres fichiers dans le dossier courant, vous pouvez le programmer dans le fichier global, par exemple: ``if os.""path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. Et si vous voulez exécuter le fichier depuis un script, vous devez le faire explicitement.

source: The Customization Modules
fr: Les modules de Personnalisation

source: Python provides two hooks to let you customize it: :mod:`sitecustomize` and :mod:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
fr: Python peut être personnalisé via les modules :mod:`sitecustomize` et :""mod:`usercustomize`. Pour découvrir comment ils fonctionnent vous devez d'abord les trouver, ils sont dans un dossier appelé user site-packages. Démarrez Python et exécutez : code::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
fr: Vous pouvez maintenant y créer un fichier :file:`usercustomize.py` " et y écrire ce que vous voulez. Il sera toujours pris en compte par Python peut importe le mode, sauf si il est démarré avec l'option :option:`-s`, qui désactive l'import automatique.

source: :mod:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :mod:`usercustomize`. See the documentation of the :mod:`site` module for more details.
fr: :mod:`sitecustomize` fonctionne de la même manière, mais plus typiquement créé par un administrateur et stocké dans le dossier site-packages global. Il est importé avant :mod:`usercustomize`. Pour plus de détails, consultez la documentation de :mod:`site`.

source: Footnotes
fr: Notes

source: A problem with the GNU Readline package may prevent this.
fr: Un problème avec GNU Readline peut l'en empêcher.

source: Whetting Your Appetite
fr: Mise en bouche

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
fr: Si vous faites beaucoup de travail sur ordinateur, vous finirez par vouloir automatiser certaines tâches. Par exemple vous pouvez avoir besoin d'effectuer une recherche et un remplacement sur un grand nombre de fichiers de texte, ou de renommer et réorganiser des photos d'une manière sophistiquée. Peut-être avez-vous besoin de créer une petite base de données ou une application graphique, ou un simple jeu.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
fr: Si vous êtes un développeur professionnel, vous pouvez avoir besoin de travailler avec certaines bibliothèques C/C++/Java, mais vous trouvez que le cycle habituel écriture/compilation/test/recompilation est trop lourd. Peut-être écrivez-vous une suite de tests pour une telle bibliothèque et trouvez-vous que l'écriture du code de test est pénible. Ou bien vous avez écrit un logiciel qui a besoin d'être extensible grâce à un langage de script, mais vous ne voulez pas concevoir ni implémenter un nouveau langage pour votre application.

source: Python is just the language for you.
fr: Python est le langage parfait pour vous.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, Mac OS X, and Unix operating systems, and will help you get the job done more quickly.
fr: Vous pouvez écrire un script shell Unix ou des fichiers batch Windows pour certaines de ces tâches. Les scripts shell sont appropriés pour déplacer des fichiers et modifier des données textuelles, mais pas pour une application ayant une interface graphique ni pour des jeux. Vous pouvez écrire un programme en C/C++/Java, mais cela peut prendre beaucoup de temps, ne serait-ce que pour avoir une première maquette. Python est plus facile à utiliser, il est disponible sous Windows, Mac OS X et Unix, et il vous aidera à terminer plus rapidement votre travail.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
fr: Python est facile à utiliser, mais c'est un vrai langage de programmation, offrant une bien meilleure structure et prise en charge des grands programmes que les scripts shell ou les fichiers batch. D'un autre coté, Python offre beaucoup plus de méthodes de vérification d'erreurs que le langage C et, étant un *langage de très haut niveau*, il possède nativement des types de données très évolués tels que des tableaux flexibles ou des dictionnaires. Grâce à ses types de données plus universels, Python est utilisable pour des domaines beaucoup plus variés que Awk ou même Perl. Pourtant, de nombreuses choses sont au moins aussi faciles en Python que dans ces langages.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
fr: Python vous permet de découper votre programme en modules qui peuvent être réutilisés dans d'autres programmes en Python. Il est fourni avec une vaste collection de modules standards que vous pouvez utiliser comme base de vos programmes, ou comme exemples pour apprendre à programmer. Certains de ces modules fournissent des services tels que les entrées/sorties, les appels système, les sockets, et même des accès aux outils comme Tk pour créer des interfaces graphiques.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
fr: Python est un langage interprété, ce qui peut vous faire gagner un temps considérable pendant le développement du programme car aucune compilation ni édition de liens n'est nécessaire. L'interpréteur peut être utilisé de manière interactive, pour vous permettre d'expérimenter avec les fonctionnalités du langage, d'écrire des programmes jetables ou de tester des fonctions lors d'un développement incrémental. Il constitue aussi une calculatrice de bureau pratique.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
fr: Python permet d'écrire des programmes compacts et lisibles. Les programmes écrits en Python sont généralement beaucoup plus court que l'équivalent en C, C++, ou Java, pour plusieurs raisons :

source: the high-level data types allow you to express complex operations in a single statement;
fr: les types de données de haut niveau vous permettent d'exprimer des opérations complexes en une seule instruction ;

source: statement grouping is done by indentation instead of beginning and ending brackets;
fr: les instructions sont regroupées entre elles grâce à l'indentation, plutôt que par l'utilisation d'accolades ;

source: no variable or argument declarations are necessary.
fr: aucune déclaration de variable ou d'argument n'est nécessaire.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
fr: Python est *extensible* : si vous savez écrire un programme en C, il est aisé d'ajouter à l'interpréteur une nouvelle fonction primitive ou un module, soit pour effectuer des opérations critiques à vitesse maximale, soit pour lier des programmes en Python à des bibliothèques disponibles uniquement sous forme binaire (par exemple des bibliothèques graphiques dédiées à un matériel). Une fois que vous êtes à l'aise avec ces principes, vous pouvez relier l'interpréteur Python à une application écrite en C et l'utiliser comme un langage d'extensions ou de commandes pour cette application.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
fr: À ce sujet, le nom du langage provient de l'émission de la BBC « Monty Python's Flying Circus » et n'a rien à voir avec les reptiles. Faire référence aux sketchs des Monty Python dans de la documentation n'est pas seulement permis, c'est encouragé !

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
fr: Votre soudain enthousiasme à propos de Python va vous pousser à l'examiner un peu plus en détail. Comme la meilleure façon d'apprendre un langage est de l'utiliser, le tutoriel vous invite à jouer avec l'interpréteur pendant la lecture.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
fr: Dans le prochain chapitre, nous allons expliquer comment utiliser l'interpréteur. Ce n'est pas la section la plus passionnante, mais c'est un passage obligé pour tester les exemples montrés plus loin.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
fr: Le reste du tutoriel présente diverses fonctionnalités du langage et du système Python au travers d'exemples, depuis les simples expressions, instructions ou types de données, jusqu'aux fonctions et modules, pour finalement aborder des concepts avancés comme les exceptions et les classes.

source: Compared with other programming languages, Python's class mechanism adds classes with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. Python classes provide all the standard features of Object Oriented Programming: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain arbitrary amounts and kinds of data. As is true for modules, classes partake of the dynamic nature of Python: they are created at runtime, and can be modified further after creation.
fr: Le mécanisme des classes Python ajoute au langage la notion de classes avec un minimum de syntaxe et de sémantique nouvelles. C'est un mélange des mécanismes rencontrés dans C++ et Modula-3. De la même manière que pour les modules, les classes Python ne posent pas de barrière rigide entre leur définition et l'utilisateur, mais s'appuient sur le respect de l'utilisateur à ne pas causer d'effraction dans la définition. Cependant, les fonctionnalités les plus importantes des classes sont conservées avec toutes leur puissance : le mécanisme d'héritage autorise d'avoir plusieurs classes de base, une classe dérivée peut surcharger toutes les méthodes de sa (ou ses) classe(s) de base et une méthode peut faire appel à la méthode d'une classe de base portant le même nom. Les objets peuvent contenir un nombre arbitraire de données.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
fr: Dans la terminologie C++, les membres des classes (y compris les données) sont *publics* (sauf exception, voir :ref:`tut-private`) et toutes les fonctions membres sont *virtuelles*. Comme avec Modulo-3, il n'y a aucune façon d'accéder aux membres d'un objet à partir de ses méthodes : une méthode est déclarée avec un premier argument explicite représentant l'objet, et cet argument est transmis de manière implicite lors de l'appel. Comme avec Smalltalk, les classes elles-mêmes sont des objets. Il existe ainsi une sémantique pour les importer et les renommer. Au contraire de C++ et Modulo-3, les types de base peuvent être utilisés comme classes de base pour que l'utilisateur puisse les étendre. Enfin, comme en C++, la plupart des opérateurs de base avec une syntaxe spéciale (opérateurs arithmétiques, sous-indiçage, etc.) peuvent être redéfinis pour les instances de classes.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
fr: (Par manque d'une terminologie universellement acceptée pour parler des classes, nous ferons un usage occasionnel des termes de Smalltalk et C++. Nous voulions utiliser les termes de Modula-3 puisque sa sémantique orientée objet est plus proche de celle de Python que de C++, mais il est probable que seul un petit nombre de lecteurs soit susceptibles de les connaître.)

source: A Word About Names and Objects
fr: Quelques mots au sujet des noms et objets
