Repository: AFPy/python_doc_fr
Catalog: 3.5/tutorial.po
Languages: fr

source: If an exception occurs during execution of the try clause, the rest of the clause is skipped. Then if its type matches the exception named after the :keyword:`except` keyword, the except clause is executed, and then execution continues after the :keyword:`try` statement.
fr: Si une exception intervient pendant l'exécution de la clause 'try', le reste de cette clause est sauté. Si son type correspond à un nom d'exception indiqué après le mot-clé :keyword:`except`, la clause 'except' correspondante est exécutée, puis l'exécution continue après l'instruction :keyword:`try`.

source: If an exception occurs which does not match the exception named in the except clause, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with a message as shown above.
fr: Si une exception intervient qui ne corresponde à aucune exception mentionnée dans la clause 'except', elle est transmise à l'instruction :keyword:`try` de niveau supérieur ; si aucun gestionnaire d'exception n'est trouvé, il s'agit d'une *exception non gérée* et l'exécution s'arrête avec un message comme indiqué ci-dessus.

source: A :keyword:`try` statement may have more than one except clause, to specify handlers for different exceptions. At most one handler will be executed. Handlers only handle exceptions that occur in the corresponding try clause, not in other handlers of the same :keyword:`try` statement. An except clause may name multiple exceptions as a parenthesized tuple, for example::
fr: Une instruction :keyword:`try` peut comporter plusieurs clauses except, pour permettre la prise en charge de différentes exceptions. Mais un seul gestionnaire, au plus, sera exécuté. Les gestionnaires ne prennent en charge que les exceptions qui interviennent dans la clause try correspondante, pas dans d'autres gestionnaires de la même instruction :keyword:`try`. Mais une même clause except peut citer plusieurs exceptions sous la forme d'un tuple entre parenthèses, comme dans cet exemple ::

source: The last except clause may omit the exception name(s), to serve as a wildcard. Use this with extreme caution, since it is easy to mask a real programming error in this way! It can also be used to print an error message and then re-raise the exception (allowing a caller to handle the exception as well)::
fr: La dernière clause except peut omettre le(s) nom(s) d'exception(s), pour servir de joker. C'est toutefois à utiliser avec beaucoup de précautions, car il est très facile de masquer une vraie erreur de programmation par ce biais. Elle peut aussi être utilisée pour afficher un message d'erreur avant de re-lever l'exception (en permettant à un appelant de prendre également en charge l'exception) ::

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all except clauses. It is useful for code that must be executed if the try clause does not raise an exception. For example::
fr: L'instruction :keyword:`try` ... :keyword:`except` a également une *clause else* optionnelle qui, lorsqu'elle est présente, doit suivre toutes les clauses except. Elle est utile pour du code qui doit être exécuté lorsqu'aucune exception n'a été levée par la clause try. Par exemple ::

source: The use of the :keyword:`else` clause is better than adding additional code to the :keyword:`try` clause because it avoids accidentally catching an exception that wasn't raised by the code being protected by the :keyword:`try` ... :keyword:`except` statement.
fr: Il vaut mieux utiliser la clause :keyword:`else`, plutôt que d'ajouter du code à la clause :keyword:`try`, car cela évite de capturer accidentellement une exception qui n'a pas été levée par le code initialement protégé par l'instruction :keyword:`try` ... :keyword:`except`.

source: When an exception occurs, it may have an associated value, also known as the exception's *argument*. The presence and type of the argument depend on the exception type.
fr: Quand une exception intervient, une valeur peut lui être associée, que l'on appelle également *l'argument* de l'exception. La présence de cet argument et son type dépendent du type de l'exception.

source: The except clause may specify a variable after the exception name. The variable is bound to an exception instance with the arguments stored in ``instance.args``. For convenience, the exception instance defines :meth:`__str__` so the arguments can be printed directly without having to reference ``.args``. One may also instantiate an exception first before raising it and add any attributes to it as desired. ::
fr: La clause except peut spécifier un nom de variable après le nom de l'exception. Cette variable est liée à une instance d'exception avec les arguments stockés dans ``instance.args``. Pour plus de commodité, l'instance de l'exception définit la méthode :meth:`__str__` afin que les arguments puissent être affichés directement sans avoir à référencer ``.args``. Il est possible de construire une exception, y ajouter ses attributs, puis la lancer plus tard. ::

source: If an exception has arguments, they are printed as the last part ('detail') of the message for unhandled exceptions.
fr: Si une exception a un argument, il est affiché dans la dernière partie ('detail') du message des exceptions non gérées.

source: Exception handlers don't just handle exceptions if they occur immediately in the try clause, but also if they occur inside functions that are called (even indirectly) in the try clause. For example::
fr: Les gestionnaires d'exceptions n'interceptent pas que les exceptions qui sont levées immédiatement dans leur clause try, mais aussi celles qui sont levées au sein de fonctions appelées (parfois indirectement) dans la clause try. Par exemple ::

source: Raising Exceptions
fr: Déclencher des exceptions

source: The :keyword:`raise` statement allows the programmer to force a specified exception to occur. For example::
fr: L'instruction :keyword:`raise` permet au programmeur de déclencher une exception spécifique. Par exemple ::

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`Exception`).
fr: Le seul argument à :keyword:`raise` indique l'exception à déclencher. Cela peut être soit une instance d'exception, soit une classe d'exception (une classe dérivée de :class:`Exception`).

source: If you need to determine whether an exception was raised but don't intend to handle it, a simpler form of the :keyword:`raise` statement allows you to re-raise the exception::
fr: Si vous devez savoir qu'une exception a été levée mais sans intention de la prendre en charge, une forme plus simple de l'instruction :keyword:`raise` permet de re-déclencher l'exception ::

source: User-defined Exceptions
fr: Exceptions définies par l'utilisateur

source: Programs may name their own exceptions by creating a new exception class (see :ref:`tut-classes` for more about Python classes). Exceptions should typically be derived from the :exc:`Exception` class, either directly or indirectly. For example::
fr: Les programmes peuvent nommer leur propres exceptions en créant de nouvelles classes (voir :ref:`tut-classes` à propos des classes Python). Ces exceptions doivent typiquement être dérivées de la classe :exc:`Exception`, directement ou indirectement. Par exemple ::

source: In this example, the default :meth:`__init__` of :class:`Exception` has been overridden. The new behavior simply creates the *value* attribute. This replaces the default behavior of creating the *args* attribute.
fr: Dans cet exemple, la méthode :meth:`__init__` de la classe :class:`Exception` a été surchargée. Le nouveau comportement crée simplement l'attribut *value*. Ceci remplace le comportement par défaut qui crée l'attribut *args*.

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception. When creating a module that can raise several distinct errors, a common practice is to create a base class for exceptions defined by that module, and subclass that to create specific exception classes for different error conditions::
fr: Les classes d'exceptions peuvent être définies pour faire tout ce qu'une autre classe peut faire. Mais elles sont le plus souvent assez simples, n'offrant que les attributs permettant aux gestionnaires de ces exceptions d'extraire les informations relatives à l'erreur qui s'est produite. Lorsque l'on crée un module qui peut déclencher plusieurs types d'erreurs distincts, une pratique courante est de créer une classe de base pour l'ensemble des exceptions définies dans ce module, et de créer des sous-classes spécifiques d'exceptions pour les différentes conditions d'erreurs ::

source: Most exceptions are defined with names that end in "Error," similar to the naming of the standard exceptions.
fr: La plupart des exceptions sont définies avec des noms qui se terminent par "Error", comme pour les exceptions standards.

source: Many standard modules define their own exceptions to report errors that may occur in functions they define. More information on classes is presented in chapter :ref:`tut-classes`.
fr: La plupart des modules standards définissent leurs propres exceptions pour décrire les erreurs que l'on peut rencontrer dans les fonctions qu'ils définissent. Plus d'informations sur les classes sont présentées dans le chapitre :ref:`tut-classes`.

source: Defining Clean-up Actions
fr: Définition d'actions de nettoyage

source: The :keyword:`try` statement has another optional clause which is intended to define clean-up actions that must be executed under all circumstances. For example::
fr: L'instruction :keyword:`try` a une autre clause optionnelle qui est destinée à définir des actions de nettoyage devant être exécutées dans certaines circonstances. Par exemple ::

source: A *finally clause* is always executed before leaving the :keyword:`try` statement, whether an exception has occurred or not. When an exception has occurred in the :keyword:`try` clause and has not been handled by an :keyword:`except` clause (or it has occurred in an :keyword:`except` or :keyword:`else` clause), it is re-raised after the :keyword:`finally` clause has been executed. The :keyword:`finally` clause is also executed "on the way out" when any other clause of the :keyword:`try` statement is left via a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement. A more complicated example::
fr: Une *clause finally* est toujours exécutée avant de quitter l'instruction :keyword:`try`, qu'une exception ait été déclenchée ou non. Quand uneexception a été déclenchée dans la clause :keyword:`try` et n'a pas été prise en charge par une clause :keyword:`except` (ou si elle a été déclenchée dans une clause :keyword:`except` ou :keyword:`else`), elle est re-déclenchée après l'exécution de la clause :keyword:`finally`. La clause :keyword:`finally` est également exécutée "à la sortie" quand n'importequelle autre clause de l'instruction :keyword:`try` est abandonnée par une instruction :keyword:`break`, :keyword:`continue` ou :keyword:`return`. Voici un exemple plus compliqué ::

source: As you can see, the :keyword:`finally` clause is executed in any event. The :exc:`TypeError` raised by dividing two strings is not handled by the :keyword:`except` clause and therefore re-raised after the :keyword:`finally` clause has been executed.
fr: Comme vous pouvez le voir, la clause :keyword:`finally` est exécutée dans tous les cas. L'exception de type :exc:`TypeError` déclenchée en divisant deux chaînes de caractères n'est pas prise en charge par la clause :keyword:`except` et est donc re-déclenchée après que la clause :keyword:`finally` ait été exécutée.

source: In real world applications, the :keyword:`finally` clause is useful for releasing external resources (such as files or network connections), regardless of whether the use of the resource was successful.
fr: Dans les vraies applicatons, la clause :keyword:`finally` est notamment utile pour libérer des ressources externes (telles que des fichiers ou des connections réseau), que l'utilisation de ces ressources ait réussi ou non.

source: Predefined Clean-up Actions
fr: Actions de nettoyage prédéfinies

source: Some objects define standard clean-up actions to be undertaken when the object is no longer needed, regardless of whether or not the operation using the object succeeded or failed. Look at the following example, which tries to open a file and print its contents to the screen. ::
fr: Certains objets définissent des actions de nettoyage standards qui doivent être exécutées lorsque l'objet n'est plus nécessaire, indépendamment du fait que l'opération ayant utilisé l'objet ait réussi ou non. Regardez l'exemple suivant, qui tente d'ouvrir un fichier et d'afficher son contenu à l'écran ::

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
fr: Le problème avec ce code est qu'il laisse le fichier ouvert pendant une durée indéterminée après que le code ait fini de s'exécuter. Ce n'est pas un problème avec des scripts simples, mais peut l'être au sein d'applications plus conséquentes. L'instruction :keyword:`with` permet d'utiliser certains objets comme des fichiers d'une façon qui assure qu'ils seront toujours nettoyés rapidement et correctement. ::

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
fr: Dès que l'instruction est exécutée, le fichier *f* est toujours fermé, même si un problème est survenu pendant l'exécution de ces lignes. D'autres objets qui, comme pour les fichiers, fournissent des actions de nettoyage prédéfinies l'indiquent dans leur documentation.

source: Floating Point Arithmetic: Issues and Limitations
fr: Arithmétique en Nombre à Virgule Flottante : Problèmes et Limites

source: Floating-point numbers are represented in computer hardware as base 2 (binary) fractions. For example, the decimal fraction ::
fr: Les nombres à virgule flottante sont représentés, au niveau matériel, en fractions de nombres binaires (base 2). Par exemple, la fraction décimale ::

source: has value 1/10 + 2/100 + 5/1000, and in the same way the binary fraction ::
fr: a la valeur 1/10 + 2/100 + 5/1000, et de la même manière, la fraction binaire ::

source: has value 0/2 + 0/4 + 1/8. These two fractions have identical values, the only real difference being that the first is written in base 10 fractional notation, and the second in base 2.
fr: a la valeur 0/2 + 0/4 + 1/8. Ces deux fractions ont une valeur identique, la seule différence est que la première est une fraction décimale, la seconde binaire.

source: Unfortunately, most decimal fractions cannot be represented exactly as binary fractions. A consequence is that, in general, the decimal floating-point numbers you enter are only approximated by the binary floating-point numbers actually stored in the machine.
fr: Malheureusement, la plupart des fractions décimales n'ont pas de représentation exacte en fractions binaires. Par conséquent, en général, les nombres à virgule flottante que vous donnez sont seulement approximés en fraction binaire pour être stocké dans la machine.

source: The problem is easier to understand at first in base 10. Consider the fraction 1/3. You can approximate that as a base 10 fraction::
fr: Le problème est plus simple à aborder en base 10. Prenons par exemple, la fraction 1/3. Vous pouvez l'approximer en une fraction décimale::

source: or, better, ::
fr: ou, mieux, ::

source: and so on. No matter how many digits you're willing to write down, the result will never be exactly 1/3, but will be an increasingly better approximation of 1/3.
fr: etc... Peu importe le nombre de décimales que vous écrirez, le résultat ne sera jamais exactement 1/3, mais une estimation s'en approchant toujours mieux.

source: In the same way, no matter how many base 2 digits you're willing to use, the decimal value 0.1 cannot be represented exactly as a base 2 fraction. In base 2, 1/10 is the infinitely repeating fraction ::
fr: De la même manière, peu importe combien de décimales en base 2 vous utiliserez, la valeur décimale 0.1 ne peut être représentée exactement en fraction binaire. En base 2, 1/10 est le nombre périodique suivant ::

source: Stop at any finite number of bits, and you get an approximation. On most machines today, floats are approximated using a binary fraction with the numerator using the first 53 bits starting with the most significant bit and with the denominator as a power of two. In the case of 1/10, the binary fraction is ``3602879701896397 / 2 ** 55`` which is close to but not exactly equal to the true value of 1/10.
fr: En se limitant à une quantité finie de bits, on ne peut obtenir qu'une approximation. Sur la majorité des machines aujourd'hui, les nombres à virgule flottante sont approximés par une fraction binaire avec les 53 premiers bits comme numérateur et une puissance de deux au dénominateur. Dans le cas de 1/10, la fraction binaire est ``3602879701896397 / 2 ** 55`` qui est proche mais pas exactement 1/10.

source: Many users are not aware of the approximation because of the way values are displayed. Python only prints a decimal approximation to the true decimal value of the binary approximation stored by the machine. On most machines, if Python were to print the true decimal value of the binary approximation stored for 0.1, it would have to display ::
fr: Il est facile d'oublier que la valeur stockée est une approximation de la fraction décimale d'origine, du fait de la manière dont les flottants sont affichés dans l'interpréteur. Python n'affiche qu'une approximation décimale de la valeur stockée en binaire. Si Python devait afficher la vraie valeur décimale de l'approximation binaire stockée pour 0,1, il afficherait ::

source: That is more digits than most people find useful, so Python keeps the number of digits manageable by displaying a rounded value instead ::
fr: C'est bien plus de décimales que nécessaire, donc Python affiche une valeur arrondie afin d'améliorer la lisibilité ::

source: Just remember, even though the printed result looks like the exact value of 1/10, the actual stored value is the nearest representable binary fraction.
fr: Il faut se rappeler, bien que la valeur affichée ressemble à la valeur exacte de 1/10, que la valeur stockée est la représentation la plus proche en fraction binaire.

source: Interestingly, there are many different decimal numbers that share the same nearest approximate binary fraction. For example, the numbers ``0.1`` and ``0.10000000000000001`` and ``0.1000000000000000055511151231257827021181583404541015625`` are all approximated by ``3602879701896397 / 2 ** 55``. Since all of these decimal values share the same approximation, any one of them could be displayed while still preserving the invariant ``eval(repr(x)) == x``.
fr: Il existe beaucoup de nombres décimaux qui partagent une même approximation en fraction binaire. Par exemple, ``0.1``, ``0.10000000000000001``, et ``0.1000000000000000055511151231257827021181583404541015625``ont tous pour approximation ``3602879701896397 / 2 ** 55``. Puisques toutes ces valeurs décimales partagent la même approximation, chacune peut être affichée tout en respectant ``eval(repr(x)) == x``.

source: Historically, the Python prompt and built-in :func:`repr` function would choose the one with 17 significant digits, ``0.10000000000000001``. Starting with Python 3.1, Python (on most systems) is now able to choose the shortest of these and simply display ``0.1``.
fr: Historiquement, le mode interactif de Python et la primitive :func:`repr` auraient choisi la version avec 17 décimales significatives, ``0.10000000000000001``. Python, depuis la version 3.1 (sur la majorité des systèmes) est maintenant capable de choisir la plus courte représentation et n'afficher que ``0.1``.

source: Note that this is in the very nature of binary floating-point: this is not a bug in Python, and it is not a bug in your code either. You'll see the same kind of thing in all languages that support your hardware's floating-point arithmetic (although some languages may not *display* the difference by default, or in all output modes).
fr: Ce comportement est inhérent au comportement des nombres à virgule flottante : ce n'est pas un bug dans Python, et ce n'est pas non plus un bug dans votre code. Vous verrez le même type de comportement dans tous les autres langages utilisant le support matériel pour le calcul des nombres à virgules flottante (bien que certains langages ne rendent pas visible la différence par défaut, ou pas dans tous les modes d'affichage).

source: For more pleasant output, you may wish to use string formatting to produce a limited number of significant digits::
fr: Pour obtenir un affichage plus plaisant, les fonctions de formatage de chaînes de caractères peuvent limiter le nombre de décimales significatives affichées::

source: It's important to realize that this is, in a real sense, an illusion: you're simply rounding the *display* of the true machine value.
fr: Il est important de comprendre qu'en réalité, c'est une illusion : Python arrondit simplement, la vraie valeur stockée, à *l'affichage*.

source: One illusion may beget another. For example, since 0.1 is not exactly 1/10, summing three values of 0.1 may not yield exactly 0.3, either::
fr: Une autre conséquence du fait que 0,1 n'est pas exactement stocké 1/10 est que la somme de trois valeurs de 0,1 ne donne pas 0,3 non plus ::

source: Also, since the 0.1 cannot get any closer to the exact value of 1/10 and 0.3 cannot get any closer to the exact value of 3/10, then pre-rounding with :func:`round` function cannot help::
fr: Aussi, puisque 0,1 ne peut pas être stocké avec une représentation plus proche de sa valeur exacte 1/10, comme 0,3 qui ne peut pas être plus proche de sa valeur exacte 3/10, arrondir avec la fonction :func:`round` n'aide en rien ::

source: Though the numbers cannot be made closer to their intended exact values, the :func:`round` function can be useful for post-rounding so that results with inexact values become comparable to one another::
fr: Bien que les nombres ne peuvent se rapprocher plus de la valeur qu'on attend qu'ils aient, la fonction :func:`round` peut être utile à posteriori pour arrondir deux valeurs inexactes et les rendre comparables ::

source: Binary floating-point arithmetic holds many surprises like this. The problem with "0.1" is explained in precise detail below, in the "Representation Error" section. See `The Perils of Floating Point <http://www.lahey.com/float.htm>`_ for a more complete account of other common surprises.
fr: L'arithmétique des nombres binaires à virgule flottante réserve beaucoup de surprises de ce genre. Le problème avec "0.1" est expliqué en détails ci-desous, dans la section "Représentation d'Erreur". Voir `The Perils of Floating Point <http://www.lahey.com/float.htm>`_ pour une liste plus complète de ce genre de surprises.
